
#Область ПрограммныйИнтерфейс

// Функция возвращает признак использования торгового оборудования.
//
Функция ИспользоватьПодключаемоеОборудование() Экспорт
	
	 Возврат ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование")
		   И ТипЗнч(Пользователи.АвторизованныйПользователь()) = Тип("СправочникСсылка.Пользователи");
	 
КонецФункции // ИспользоватьПодключаемоеОборудование()

// Функция возвращает признак использования фискальных регистраторов.
//
Функция ИспользоватьФискальныйРегистратор() Экспорт
	
	 Возврат ПолучитьФункциональнуюОпцию("ИспользоватьФискальныйРегистратор")
		   И ТипЗнч(Пользователи.АвторизованныйПользователь()) = Тип("СправочникСсылка.Пользователи");
	 
КонецФункции // ИспользоватьФискальныйРегистратор()

#КонецОбласти
