#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Это старая запись.
	Если ЗначениеЗаполнено(Параметры.Ключ.Организация)
		Или ЗначениеЗаполнено(Параметры.Ключ.Контрагент) 
		Или ЗначениеЗаполнено(Параметры.Ключ.Договор) Тогда 
		ТолькоПросмотр = Истина;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	
	ТолькоПросмотр = Ложь;
	Элементы.ФормаВключитьВозможностьРедактирования.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьСчетаУчета(Команда)
	Если ЗначениеЗаполнено(Запись.СчетРасчетовПоставщика) Тогда 
		ТекстВопроса = НСтр("ru = 'Буду перезаполнены счета учета. Продолжить выполнение операции?'");
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);

		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСчетаУчетаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ОтветНаВопросЗаполнитьСчетаУчета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСчетаУчетаНаСервере();
	КонецЕсли; 
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСчетаУчетаНаСервере()

	СчетаУчета = БухгалтерскийУчетСервер.ПолучитьСчетаРасчетовСКонтрагентом(Запись.Организация, Запись.Контрагент, Запись.Договор);
	ЗаполнитьЗначенияСвойств(Запись, СчетаУчета, "СчетРасчетовПоставщика, СчетАвансовПоставщика, СчетРасчетовПокупателя, СчетАвансовПокупателя, СчетРасчетовПоЗаймам"); 	

КонецПроцедуры 
	
#КонецОбласти

