#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЗаполнитьСписокВыбораОПФ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода КодПравовойФормы.
//
&НаКлиенте
Процедура КодПравовойФормыПриИзменении(Элемент)
	ЗаполнитьСписокВыбораОПФ(); 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораОПФ()
	
	КодыПравовойФормы = БухгалтерскийУчетКлиентСервер.ПолучитьКодыПравовойФормы();
	Если ЗначениеЗаполнено(Объект.КодПравовойФормы) Тогда 
		КодыПравовойФормы.Вставить(0, Объект.КодПравовойФормы);
	КонецЕсли;	
	КодыПравовойФормы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(КодыПравовойФормы);
	Элементы.КодПравовойФормы.СписокВыбора.ЗагрузитьЗначения(КодыПравовойФормы);	

КонецПроцедуры // ЗаполнитьСписокВыбораОПФ()

#КонецОбласти