
#Область ПрограммныйИнтерфейс

#Область Основные

Процедура ДоступныеТипыОборудования(СписокТиповОборудования, СтандартнаяОбработка) Экспорт
	
	СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода);
	СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков);
	СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор);
	СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ККТ);
	
	Если ПолучитьФункциональнуюОпцию("ПечатьЭтикетокИЦенников") Тогда
		СписокТиповОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток);
	КонецЕсли;	
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойЭкземпляраОборудования

Процедура ЭкземплярОборудованияПриЧтенииНаСервере(ТекущийОбъект, ЭтаФорма) Экспорт
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

Процедура ЭкземплярОборудованияПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) Экспорт
	УправлениеДоступом.ПослеЗаписиНаСервере(Неопределено, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

// Возвращает признак возможности обращения к разделенным данным из текущего сеанса.
//  
// Возвращаемое значение:
//  Булево - В случае вызова в неразделенной конфигурации возвращает Истина.
//
Функция ДоступноИспользованиеРазделенныхДанных() Экспорт
	
	Возврат ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();
	
КонецФункции

#КонецОбласти