#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьНормыАмортизацииГруппНалоговогоУчетаОС(ДополнительныеПараметры) Экспорт
	
	Результат = РаботаСКонтрагентамиБП.РеквизитыСтавкиНалогов("ratesDepreciation");
	
	Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда 
		Возврат;
	КонецЕсли;	
	
	// Получение из XML.
	КлассификаторXML = Результат.КлассификаторXML;
	ТаблицаНормАмортизации = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	ТаблицаНормАмортизации.Индексы.Добавить("КодГруппы");
	
	ПериодЗаполнения = ОбщегоНазначенияБПСервер.ПолучитьПериодИзXML(КлассификаторXML);
	
	НаборЗаписей = РегистрыСведений.НормыАмортизацииГруппНалоговогоУчетаОС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ГруппаНалоговогоУчетаОС.Установить(ДополнительныеПараметры.Ссылка);
	НаборЗаписей.Отбор.Период.Установить(ПериодЗаполнения);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	НайденныеСтроки = ТаблицаНормАмортизации.НайтиСтроки(Новый Структура("КодГруппы", ДополнительныеПараметры.Код));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, НайденнаяСтрока);
		Запись.Период = ПериодЗаполнения;
		Запись.ГруппаНалоговогоУчетаОС = ДополнительныеПараметры.Ссылка;
		
	КонецЦикла;

	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина, Истина, Истина);
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли

