#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыВыбора();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает параметры выбора.
//
&НаКлиенте
Процедура УстановитьПараметрыВыбора()

	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();

	// Добавление параметра выбора для Кассы.
	НовыйМассив = Новый Массив();
    // по Валюте- только регламентированная валюта.
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(ВалютаРегламентированногоУчета);
	// Формирование параметра выбора.
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ВалютаДенежныхСредств", Новый ФиксированныйМассив(МассивПараметровВыбора));
	// Добавление параметра выбора.
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Касса.ПараметрыВыбора = НовыеПараметры;
	
	// Добавление параметра выбора для Договора.
	НовыйМассив = Новый Массив();
	// по Виду договора- только с покупателем.
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(ВалютаРегламентированногоУчета);
	// Формирование параметра выбора.
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ВалютаДенежныхСредств", Новый ФиксированныйМассив(МассивПараметровВыбора));
	НовыйМассив.Добавить(НовыйПараметр);
	
    // по Валюте- только регламентированная валюта.
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
	// Формирование параметра выбора.
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивПараметровВыбора));
	// Добавление параметра выбора.
	НовыйМассив.Добавить(НовыйПараметр);
	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ДоговорКонтрагента.ПараметрыВыбора = НовыеПараметры;
	
	
КонецПроцедуры // УстановитьПараметрыВыбора()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьБаннеры_РозничнаяТорговля");
КонецПроцедуры

#КонецОбласти