///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. КонтрольВеденияУчетаПереопределяемый.ПриОпределенииПроверок.
Процедура ПриОпределенииПроверок(ГруппыПроверок, Проверки) Экспорт
	
	// БПКР
	// 1. План счетов.
	ГруппаПроверок = ГруппыПроверок.Добавить();
	ГруппаПроверок.Наименование    = НСтр("ru='01. План счетов'");
	ГруппаПроверок.Идентификатор   = "ПланСчетов";
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      	= "ПланСчетов";
	Проверка.ИдентификаторРодителя        	= "ПланСчетов";
	Проверка.Наименование                 	= НСтр("ru='Проверка наличия субконто ДОГОВОРЫ (Склады) без субконто КОНТРАГЕНТЫ (Номенклатура)'");
	Проверка.Причины                      	= НСтр("ru='Если у счета есть субконто Договоры, то обязательно должно быть субконто Контрагенты. 
													 |Если у счета есть субконто Склады,  то обязательно должно быть субконто Номенклатура.'");
	Проверка.Рекомендация                 	= НСтр("ru='Добавьте счету необходимое субконто.'");
	Проверка.Идентификатор                	= "ПроверкаСубконтоКонтрагентыИНоменклатура";
	Проверка.ОбработчикПроверки           	= "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаСубконтоКонтрагентыИНоменклатура";
	Проверка.КонтекстПроверокВеденияУчета 	= "ПланСчетов";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ПланСчетов";
	Проверка.ИдентификаторРодителя        = "ПланСчетов";
	Проверка.Наименование                 = НСтр("ru='Проверка счетов денежных средств'");
	Проверка.Причины                      = НСтр("ru='У счетов 11хх и 12хх должны быть субконто ""Денежные средства"" и ""Статьи движения денежных средств"" и только они. 
													 |У других счетов не должно быть субконто ""Денежные средства"".'");
	Проверка.Рекомендация                 = НСтр("ru='Исправьте отсутствие(присутствие) необходимых субконто счета.'");
	Проверка.Идентификатор                = "ПроверкаСубконтоДС_СДДС";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаСубконтоДС_СДДС";
	Проверка.КонтекстПроверокВеденияУчета = "ПланСчетов";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ПланСчетов";
	Проверка.ИдентификаторРодителя        = "ПланСчетов";
	Проверка.Наименование                 = НСтр("ru='Проверка счетов 6,7,8,9'");
	Проверка.Причины                      = НСтр("ru='Должен быть признак ""Временный"". 
													 |У всех остальных счетов не должно быть признака ""Временный"".
													 |Не должно быть признаков ""Валютный"", ""Количественный"".
													 |У всех видов субконто должен быть признак ""Только обороты"", ""Суммовой"".
													 |Если счет не является группой то для него должна быть указана счет-группа.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверить и исправить признаки: ""Временный"", ""Валютный"", ""Количественный"". У всех видов субконто должен быть признак ""Только обороты"", ""Суммовой"".'");
	Проверка.Идентификатор                = "ПроверкаПризнаковСчета";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаПризнаковСчета";
	Проверка.КонтекстПроверокВеденияУчета = "ПланСчетов";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ПланСчетов";
	Проверка.ИдентификаторРодителя        = "ПланСчетов";
	Проверка.Наименование                 = НСтр("ru='Проверка правильности указания пар счетов'");
	Проверка.Причины                      = НСтр("ru='Парный счет указывается только для счетов 1ххх и 2ххх. 
													 |Каждый парный счет указывается только  для одного счета.
													 |Для счета 1ххх парный счет должен быть 3ххх.
													 |Для счета 21хх или 29хх парный счет должен быть также 21хх или 29хх.
													 |Для прочих счетов 2ххх парный счет должен быть 4ххх.
													 |Для парных счетов кроме 21хх и 29хх все признаки, субконто и признаки субконто должны совпадать.
													 |Один счет пары должен быть активным, а второй - пассивным.'");
	Проверка.Рекомендация                 = НСтр("ru='Исправьте парный счет или свойства парных счетов.'");
	Проверка.Идентификатор                = "ПроверкаПарныхСчетов";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаПарныхСчетов";
	Проверка.КонтекстПроверокВеденияУчета = "ПланСчетов";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ПланСчетов";
	Проверка.ИдентификаторРодителя        = "ПланСчетов";
	Проверка.Наименование                 = НСтр("ru='Проверка правильности признака ""Валютный""'");
	Проверка.Причины                      = НСтр("ru='Признак ""Валютный"" может указываться для счетов с субконто Контрагенты и Договоры. 
													 |Признак ""Валютный"" может указываться для счетов с субконто Денежные средства.
													 |Признак ""Валютный"" может указываться для счета 1520, 3620.
													 |Для других счетов признак ""Валютный"" не указывается.'");
	Проверка.Рекомендация                 = НСтр("ru='Исправьте признак ""Валютный"" счета.'");
	Проверка.Идентификатор                = "ПроверкаПризнакаВалютный";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаПризнакаВалютный";
	Проверка.КонтекстПроверокВеденияУчета = "ПланСчетов";	
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ПланСчетов";
	Проверка.ИдентификаторРодителя        = "ПланСчетов";
	Проверка.Наименование                 = НСтр("ru='Проверка правильности ""Активно-пассивных счетов""'");
	Проверка.Причины                      = НСтр("ru='Активно-пассивные счета должны иметь первым субконто ""Контрагенты"" или ""Работники (Физические лица)"". 
													 |Активно-пассивными могут быть только счета 14хх, 15хх, 31хх, 34хх, 35хх, 0000, 5ххх, 9000, 9800, Zххх.'");
	Проверка.Рекомендация                 = НСтр("ru='Исправьте свойство счета ""Вид счета"".'");
	Проверка.Идентификатор                = "ПроверкаПризнакаАктивно_Пассивный";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаПризнакаАктивно_Пассивный";
	Проверка.КонтекстПроверокВеденияУчета = "ПланСчетов";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ПланСчетов";
	Проверка.ИдентификаторРодителя        = "ПланСчетов";
	Проверка.Наименование                 = НСтр("ru='Проверка отсутствия отрицательного сальдо на счетах 1540,1549,3430'");
	Проверка.Причины                      = НСтр("ru='Неверная последовательность документов или ручные операции.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверьте ручные операции, проверьте последовательность документов по договорам включая закрытие месяца.'");
	Проверка.Идентификатор                = "ПроверкаСальдоСчетов_1540_1549_3430";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаСальдоСчетов_1540_1549_3430";
	Проверка.КонтекстПроверокВеденияУчета = "ПланСчетов";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ПланСчетов";
	Проверка.ИдентификаторРодителя        = "ПланСчетов";
	Проверка.Наименование                 = НСтр("ru='Проверка валютной суммы и учетной суммы по валютным счетам в валюте KGS'");
	Проверка.Причины                      = НСтр("ru='Возможно неверное заполнение документов.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверьте суммы в документах и перепроведите их.'");
	Проверка.Идентификатор                = "ПроверкаВалютныхИУчетныхСумм";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаВалютныхИУчетныхСумм";
	Проверка.КонтекстПроверокВеденияУчета = "ПланСчетов";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ПланСчетов";
	Проверка.ИдентификаторРодителя        = "ПланСчетов";
	Проверка.Наименование                 = НСтр("ru='Проверка корректного оформления пар счетов.'");
	Проверка.Причины                      = НСтр("ru='Некорректное заполнение.'");
	Проверка.Рекомендация                 = НСтр("ru='Перезапишите счет, в котором указан парный счет.'");
	Проверка.Идентификатор                = "ПроверкаКорректностиУказанияПарСчет";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаКорректностиУказанияПарСчет";
	Проверка.КонтекстПроверокВеденияУчета = "ПланСчетов";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ПланСчетов";
	Проверка.ИдентификаторРодителя        = "ПланСчетов";
	Проверка.Наименование                 = НСтр("ru='Проверка подчинение счета.'");
	Проверка.Причины                      = НСтр("ru='Счет-группа указывается для всех счетов кроме ""Х000""
												|Счет и группа должен иметь вид:
												|Х000, если сам счет имеет на конце ХХ00, где Х <> 0
												|ХХ00, если сам счет имеет вид ""ХХХZ"", где Х <> 0, Z - любое
												|или ХХХ0, если сам счет имеет вид ""ХХХZ"", где Х <> 0, Z - любое.'");
	Проверка.Рекомендация                 = НСтр("ru='Исправьте для счета подчинение счету.'");
	Проверка.Идентификатор                = "ПроверкаПодчинениеСчета";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаПодчинениеСчета";
	Проверка.КонтекстПроверокВеденияУчета = "ПланСчетов";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	   	
	// 2. Денежные средства.
	ГруппаПроверок = ГруппыПроверок.Добавить();
	ГруппаПроверок.Наименование    = НСтр("ru='02. Денежные средства'");
	ГруппаПроверок.Идентификатор   = "ДенежныеСредства";
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ДенежныеСредства";
	Проверка.ИдентификаторРодителя        = "ДенежныеСредства";
	Проверка.Наименование                 = НСтр("ru='Проверка на изменение валют от классификатора'");
	Проверка.Причины                      = НСтр("ru='Редактирование пользователем валют.'");
	Проверка.Рекомендация                 = НСтр("ru='Сверить измененные валюты по классификатору.'");
	Проверка.Идентификатор                = "ПроверкаНаИзменениеВалютОтКлассификатора";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаНаИзменениеВалютОтКлассификатора";
	Проверка.КонтекстПроверокВеденияУчета = "ДенежныеСредства";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ДенежныеСредства";
	Проверка.ИдентификаторРодителя        = "ДенежныеСредства";
	Проверка.Наименование                 = НСтр("ru='Проверка оборотов по банковскому счету/кассе только по одному счету учета'");
	Проверка.Причины                      = НСтр("ru='Редактирование пользователем банковских счетов/касс.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверить проводки, где участвует банковский счет/касса и исправить их.'");
	Проверка.Идентификатор                = "ПроверкаОборотовПоБанковскимСчетамИКассам";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаОборотовПоБанковскимСчетамИКассам";
	Проверка.КонтекстПроверокВеденияУчета = "ДенежныеСредства";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ДенежныеСредства";
	Проверка.ИдентификаторРодителя        = "ДенежныеСредства";
	Проверка.Наименование                 = НСтр("ru='Проверка наличия отрицательных остатков на счетах учета денежных средств.'");
	Проверка.Причины                      = НСтр("ru='Обнаружены отрицательные остатки по счетам денежных средств.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверить обороты по денежным средствам и исправить.'");
	Проверка.Идентификатор                = "ПроверкаОтрицательныхОстатковДенежныхСредств";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаОтрицательныхОстатковДенежныхСредств";
	Проверка.КонтекстПроверокВеденияУчета = "ДенежныеСредства";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ДенежныеСредства";
	Проверка.ИдентификаторРодителя        = "ДенежныеСредства";
	Проверка.Наименование                 = НСтр("ru='Проверка наличия документов ""Операции введеные вручную"" с использованием денежных счетов без указания субконто.'");
	Проверка.Причины                      = НСтр("ru='Обнаружены документы ""Операции введеные вручную"" с использованием счетов учета денежных средств без указания субконто.'");
	Проверка.Рекомендация                 = НСтр("ru='Заполнить аналитику по счетам учета денежных средств.'");
	Проверка.Идентификатор                = "ПроверкаСчетовДСВОперацияхВведенныхВручную";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаСчетовДСВОперацияхВведенныхВручную";
	Проверка.КонтекстПроверокВеденияУчета = "ДенежныеСредства";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;

	// 3. Покупка и продажа.
	ГруппаПроверок = ГруппыПроверок.Добавить();
	ГруппаПроверок.Наименование    = НСтр("ru='03. Покупка и продажа'");
	ГруппаПроверок.Идентификатор   = "ПокупкаИПродажа";
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ПокупкаИПродажа";
	Проверка.ИдентификаторРодителя        = "ПокупкаИПродажа";
	Проверка.Наименование                 = НСтр("ru='Проверка последовательности создания документов.'");
	Проверка.Причины                      = НСтр("ru='Последовательность документов (по дате документа) нарушена по следующим цепочкам:
														|Поступление - Доп. расходы - ГТД по импорту
														|Поступление - Возврат поставщику
														|Реализаци - Возврат от покупателя'");
	Проверка.Рекомендация                 = НСтр("ru='Исправьте даты документов.'");
	Проверка.Идентификатор                = "ПроверкаХронологическойПоследовательностиДокументов";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаХронологическойПоследовательностиДокументов";
	Проверка.КонтекстПроверокВеденияУчета = "ПокупкаИПродажа";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ПокупкаИПродажа";
	Проверка.ИдентификаторРодителя        = "ПокупкаИПродажа";
	Проверка.Наименование                 = НСтр("ru='Проверка соответствия договоров по контрагентам'");
	Проверка.Причины                      = НСтр("ru='В документе указан договор владельцем которого является другой контрагент.'");
	Проверка.Рекомендация                 = НСтр("ru='Выберите другой договор.'");
	Проверка.Идентификатор                = "ПроверкаСоответствияДоговоровПоКонтрагентам";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаСоответствияДоговоровПоКонтрагентам";
	Проверка.КонтекстПроверокВеденияУчета = "ПокупкаИПродажа";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ПокупкаИПродажа";
	Проверка.ИдентификаторРодителя        = "ПокупкаИПродажа";
	Проверка.Наименование                 = НСтр("ru='Указания ставки НСП в документах Релазиация и Возврат от покупателя'");
	Проверка.Причины                      = НСтр("ru='В документе, на некоторых закладках, не указаны ставки НСП.'");
	Проверка.Рекомендация                 = НСтр("ru='Укажите ставки НСП на закладках документа.'");
	Проверка.Идентификатор                = "ПроверкаСтавкиНСПВРеализацияхИВозвратах";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаСтавкиНСПВРеализацияхИВозвратах";
	Проверка.КонтекстПроверокВеденияУчета = "ПокупкаИПродажа";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	// 4. Запасы.
	ГруппаПроверок = ГруппыПроверок.Добавить();
	ГруппаПроверок.Наименование    = НСтр("ru='04. Запасы'");
	ГруппаПроверок.Идентификатор   = "Запасы";
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "Запасы";
	Проверка.ИдентификаторРодителя        = "Запасы";
	Проверка.Наименование                 = НСтр("ru='Проверка соответствия сумм списания ТМЗ и первоначальной стоимости
													 |в документах принятия ОС к учету для операции ""Оборудование""'");
	Проверка.Причины                      = НСтр("ru='Если принято ОС к учету по себестоимости ТМЗ, а затем были отредактированы суммы ТМЗ ""задним числом"", 
													 |то первоначальная стоимость ОС тоже изменится.'");
	Проверка.Рекомендация                 = НСтр("ru='Перезаполните первоначальную стоимость и проведите документ.'");
	Проверка.Идентификатор                = "ПроверкаСоответствияСуммТМЗ_И_ОС";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаСоответствияСуммТМЗ_И_ОС";
	Проверка.КонтекстПроверокВеденияУчета = "Запасы";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "Запасы";
	Проверка.ИдентификаторРодителя        = "Запасы";
	Проверка.Наименование                 = НСтр("ru='Проверка счета на признак ""Количественный"" в вводе начальных остатков'");
	Проверка.Причины                      = НСтр("ru='В документе ""Ввод начальных остатков"", с разделом учета ""Запасы"", 
													 |должны быть выбран счет учета БУ с признаком ""Количественный"".'");
	Проверка.Рекомендация                 = НСтр("ru='Зайдите в документ и выберите счет с установленным признаком ""Количественный"".'");
	Проверка.Идентификатор                = "ПроверкаУказанияКоличественногоСчетаВВводеНачальныхОстатков";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаУказанияКоличественногоСчетаВВводеНачальныхОстатков";
	Проверка.КонтекстПроверокВеденияУчета = "Запасы";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "Запасы";
	Проверка.ИдентификаторРодителя        = "Запасы";
	Проверка.Наименование                 = НСтр("ru='Проверка счета оприходования в документе ""Оприходование товаров""'");
	Проверка.Причины                      = НСтр("ru='В документе ""Оприходование товаров"" в табличной части ""Товары"" 
													 |в поле колонке ""Счет оприходования"" должен быть указан Счет доходов (6ххх или 91хх).'");
	Проверка.Рекомендация                 = НСтр("ru='Зайдите в документ и выберите Счет доходов.'");
	Проверка.Идентификатор                = "ПроверкаСчетаОприходованияДокумента_ОприходованиеТоваров";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаСчетаОприходованияДокумента_ОприходованиеТоваров";
	Проверка.КонтекстПроверокВеденияУчета = "Запасы";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "Запасы";
	Проверка.ИдентификаторРодителя        = "Запасы";
	Проверка.Наименование                 = НСтр("ru='Проверка номенклатуры, у которой есть суммовые остатки, но нет количественных'");
	Проверка.Причины                      = НСтр("ru='В документах, которые уменьшают/увеличивают остатки номенклатуры, указаны неверные суммы или количество.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверьте документы (и их проводки), которые уменьшают/увеличивают остатки номенклатуры.'");
	Проверка.Идентификатор                = "ПроверкаСуммовыхОстатковПоНоменклатуреСНулевымКоличеством";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаСуммовыхОстатковПоНоменклатуреСНулевымКоличеством";
	Проверка.КонтекстПроверокВеденияУчета = "Запасы";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	// 5. ОС и НМА.
	ГруппаПроверок = ГруппыПроверок.Добавить();
	ГруппаПроверок.Наименование    = НСтр("ru='05. ОС и НМА'");
	ГруппаПроверок.Идентификатор   = "ОСИНМА";
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ОСИНМА";
	Проверка.ИдентификаторРодителя        = "ОСИНМА";
	Проверка.Наименование                 = НСтр("ru='Проверка наличия принятого ОС и сальдо на счете учета'");
	Проверка.Причины                      = НСтр("ru='Для используемого ОС нет документа поступления или принятия у учету.
														|Есть сальдо на счете амортизации, но нет сальдо на счете учета.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверьте наличие документа поступления для ОС, счет учета, сальдо по счету.'");
	Проверка.Идентификатор                = "ПроверкаПоступленияИСальдоНаСчетеОС";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаПоступленияИСальдоНаСчетеОС";
	Проверка.КонтекстПроверокВеденияУчета = "ОСИНМА";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ОСИНМА";
	Проверка.ИдентификаторРодителя        = "ОСИНМА";
	Проверка.Наименование                 = НСтр("ru='Проверка суммы ликвидационной стоимости в документе ""Принятие к учету ОС""'");
	Проверка.Причины                      = НСтр("ru='У используемого ОС ликвидационная стоимость равна или больше первоначальной стоимости.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверить соотвествующие суммы в документах ""Принятие к учету ОС"", ""Ввод начальных остатков"" по используемым ОС.'");
	Проверка.Идентификатор                = "ПроверкаЛиквидационнойСтоимостиОСПриПринятии";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаЛиквидационнойСтоимостиОСПриПринятии";
	Проверка.КонтекстПроверокВеденияУчета = "ОСИНМА";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ОСИНМА";
	Проверка.ИдентификаторРодителя        = "ОСИНМА";
	Проверка.Наименование                 = НСтр("ru='Проверка заполнения группы НИ по счетам 2130, 2170.'");
	Проверка.Причины                      = НСтр("ru='У ОС по счетам 2130,2170 не заполнена группа имущества.'");
	Проверка.Рекомендация                 = НСтр("ru='Заполнить группы имущества у ОС по счетам 2130, 2170 в документах: ""Принятие к учету ОС"", ""Ввод начальных остатков"".'");
	Проверка.Идентификатор                = "ПроверкаЗаполненияГруппыНИ_ОС";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаЗаполненияГруппыНИ_ОС";
	Проверка.КонтекстПроверокВеденияУчета = "ОСИНМА";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ОСИНМА";
	Проверка.ИдентификаторРодителя        = "ОСИНМА";
	Проверка.Наименование                 = НСтр("ru='Проверка наличия документа ""Ввод начальных остатков"" с видом операции ""Налоговый учет"".'");
	Проверка.Причины                      = НСтр("ru='Отсутствует документ ""Ввод начальных остатков"" с видом операции ""Налоговый учет"".'");
	Проверка.Рекомендация                 = НСтр("ru='Добавить документ ""Ввод начальных остатков"" с видом операции ""Налоговый учет"".'");
	Проверка.Идентификатор                = "ПроверкаДанныхПоНалоговомуУчетуОС";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаДанныхПоНалоговомуУчетуОС";
	Проверка.КонтекстПроверокВеденияУчета = "ОСИНМА";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	// 7. Налоги.
	ГруппаПроверок = ГруппыПроверок.Добавить();
	ГруппаПроверок.Наименование    = НСтр("ru='07. Налоги'");
	ГруппаПроверок.Идентификатор   = "Налоги";
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "Налоги";
	Проверка.ИдентификаторРодителя        = "Налоги";
	Проверка.Наименование                 = НСтр("ru='Проверка заполнения группы НУ.'");
	Проверка.Причины                      = НСтр("ru='Незаполненная группа НУ в принятии к учету или вводу начальных остатков,
														|при условии что первоначальная стоимость больше или равна минимальной стоимости ОС для НУ.
														|Минимальная стоимость ОС для НУ указывается в учетной политике организации.'");
	Проверка.Рекомендация                 = НСтр("ru='Заполните группа НУ для основных средств.'");
	Проверка.Идентификатор                = "ПроверкаЗаполненияГруппыНУ";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаЗаполненияГруппыНУ";
	Проверка.КонтекстПроверокВеденияУчета = "Налоги";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "Налоги";
	Проверка.ИдентификаторРодителя        = "Налоги";
	Проверка.Наименование                 = НСтр("ru='Проверка на наличие счетов налогов в операциях введенных вручную.'");
	Проверка.Причины                      = НСтр("ru='В документе ""Операции введенные вручную"" использованы счета по налогам.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверить на правильность проводки в документе.'");
	Проверка.Идентификатор                = "ПроверкаСчетовНалоговВОперацияхВведеныхВручную";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаСчетовНалоговВОперацияхВведеныхВручную";
	Проверка.КонтекстПроверокВеденияУчета = "Налоги";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	// 8. Настройки и справочники.
	ГруппаПроверок = ГруппыПроверок.Добавить();
	ГруппаПроверок.Наименование    = НСтр("ru='08. Настройки и справочники'");
	ГруппаПроверок.Идентификатор   = "НастройкиИСправочники";
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "НастройкиИСправочники";
	Проверка.ИдентификаторРодителя        = "НастройкиИСправочники";
	Проверка.Наименование                 = НСтр("ru='Проверка признака ""Участник ЕАЭС"" у стран.'");
	Проверка.Причины                      = НСтр("ru='В элементе справочника ""Страны мира"" неверно указан признак ""Участник ЕАЭС"".'");
	Проверка.Рекомендация                 = НСтр("ru='В элементе справочника ""Страны мира"" необходимо установить или снять признак ""Участник ЕАЭС"".'");
	Проверка.Идентификатор                = "ПроверкаПризнакаСтраны_УчастникЕАЭС";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаПризнакаСтраны_УчастникЕАЭС";
	Проверка.КонтекстПроверокВеденияУчета = "НастройкиИСправочники";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "НастройкиИСправочники";
	Проверка.ИдентификаторРодителя        = "НастройкиИСправочники";
	Проверка.Наименование                 = НСтр("ru='Проверка признака страны у контрагентов.'");
	Проверка.Причины                      = НСтр("ru='В элементе справочника ""Контрагенты"" неверно указан признак страны.'");
	Проверка.Рекомендация                 = НСтр("ru='В элементе справочника ""Страны мира"" необходимо перевыбрать страну резидентства.
														|Если это не помогло, то необходимо проверить элемент справочника ""Страны мира"".'");
	Проверка.Идентификатор                = "ПроверкаПризнакаСтраныКонтрагента";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаПризнакаСтраныКонтрагента";
	Проверка.КонтекстПроверокВеденияУчета = "НастройкиИСправочники";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "НастройкиИСправочники";
	Проверка.ИдентификаторРодителя        = "НастройкиИСправочники";
	Проверка.Наименование                 = НСтр("ru='Проверка ИНН физических лиц.'");
	Проверка.Причины                      = НСтр("ru='В элементе справочника ""Физические лица"" неверно указан ИНН.'");
	Проверка.Рекомендация                 = НСтр("ru='В элементе справочника ""Страны мира"" необходимо исправить ИНН.'");
	Проверка.Идентификатор                = "ПроверкаИННФизическихЛиц";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаИННФизическихЛиц";
	Проверка.КонтекстПроверокВеденияУчета = "НастройкиИСправочники";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "НастройкиИСправочники";
	Проверка.ИдентификаторРодителя        = "НастройкиИСправочники";
	Проверка.Наименование                 = НСтр("ru='Проверка наличия вида расчета в методе расчета отпуска.'");
	Проверка.Причины                      = НСтр("ru='В элементе справочника ""Методы расчета отпуска"" не указано поле ""Вид начисления отпуска"".'");
	Проверка.Рекомендация                 = НСтр("ru='В элементе справочника ""Методы расчета отпуска"" необходимо заполнить поле ""Вид начисления отпуска"".'");
	Проверка.Идентификатор                = "ПроверкаВидаНачисленияВМетодеРасчетаОтпуска";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаВидаНачисленияВМетодеРасчетаОтпуска";
	Проверка.КонтекстПроверокВеденияУчета = "НастройкиИСправочники";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "НастройкиИСправочники";
	Проверка.ИдентификаторРодителя        = "НастройкиИСправочники";
	Проверка.Наименование                 = НСтр("ru='Проверка заполнение кодов ТНВЭД или ГКЭД для ТМЗ.'");
	Проверка.Причины                      = НСтр("ru='В элементе справочника ""Номенклатура"" не заполнен код ТНВЭД или ГКЭД.'");
	Проверка.Рекомендация                 = НСтр("ru='Заполните код ТНВЭД или ГКЭД.'");
	Проверка.Идентификатор                = "ПроверкаЗаполненияТНВЭДГКЭД";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаЗаполненияТНВЭДГКЭД";
	Проверка.КонтекстПроверокВеденияУчета = "НастройкиИСправочники";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	// 9. Валюты и валютные суммы.
	ГруппаПроверок = ГруппыПроверок.Добавить();
	ГруппаПроверок.Наименование    = НСтр("ru='09. Валюты и валютные суммы'");
	ГруппаПроверок.Идентификатор   = "ВалютыИВалютныеСуммы";
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ВалютыИВалютныеСуммы";
	Проверка.ИдентификаторРодителя        = "ВалютыИВалютныеСуммы";
	Проверка.Наименование                 = НСтр("ru='Проверка валюты и валютной суммы в проводках.'");
	Проверка.Причины                      = НСтр("ru='Неверно указаны счета или валюты.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверьте заполнение документа: счета, валюты.'");
	Проверка.Идентификатор                = "ПроверкаЗаполненияВалютыИВалютнойСуммыПроводок";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаЗаполненияВалютыИВалютнойСуммыПроводок";
	Проверка.КонтекстПроверокВеденияУчета = "ВалютыИВалютныеСуммы";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ВалютыИВалютныеСуммы";
	Проверка.ИдентификаторРодителя        = "ВалютыИВалютныеСуммы";
	Проверка.Наименование                 = НСтр("ru='Проверка заполнения валюты регламентированного учета.'");
	Проверка.Причины                      = НСтр("ru='Не заполнена валюта регламентированного учета.'");
	Проверка.Рекомендация                 = НСтр("ru='Перейдите по пути ""Настройки"" - ""Параметры учета"" и в разделе ""Валютный учет"" укажите валюту регламентированного учета.'");
	Проверка.Идентификатор                = "ПроверкаЗаполненияВалютыРегламентированногоУчета";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаЗаполненияВалютыРегламентированногоУчета";
	Проверка.КонтекстПроверокВеденияУчета = "ВалютыИВалютныеСуммы";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ВалютыИВалютныеСуммы";
	Проверка.ИдентификаторРодителя        = "ВалютыИВалютныеСуммы";
	Проверка.Наименование                 = НСтр("ru='Проверка валюты договора и валюты валютной суммы в проводке.'");
	Проверка.Причины                      = НСтр("ru='В документе неверно указаны какие валюты или поля откуда валюты берутся для проводок.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверьте правильность заполнения документа и валют в договоре, банковском счете и др. полях содержащих валюту.'");
	Проверка.Идентификатор                = "ПроверкаВалютыДоговораИВалютыПроводки";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаВалютыДоговораИВалютыПроводки";
	Проверка.КонтекстПроверокВеденияУчета = "ВалютыИВалютныеСуммы";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ВалютыИВалютныеСуммы";
	Проверка.ИдентификаторРодителя        = "ВалютыИВалютныеСуммы";
	Проверка.Наименование                 = НСтр("ru='Проверка актуальности курсов валют.'");
	Проверка.Причины                      = НСтр("ru='Курсы валют устарели.'");
	Проверка.Рекомендация                 = НСтр("ru='Обновить курсы валют.'");
	Проверка.Идентификатор                = "ПроверкаАктуальностиКурсовВалют";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаАктуальностиКурсовВалют";
	Проверка.КонтекстПроверокВеденияУчета = "ВалютыИВалютныеСуммы";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ВалютыИВалютныеСуммы";
	Проверка.ИдентификаторРодителя        = "ВалютыИВалютныеСуммы";
	Проверка.Наименование                 = НСтр("ru='Проверка валютной и сомовой суммы (не должны быть равны, если валюта не сом).'");
	Проверка.Причины                      = НСтр("ru='В документах валютные суммы равны учетным.'");
	Проверка.Рекомендация                 = НСтр("ru='Валютная сумма не должна быть равна учетной, проверьте валютные суммы в документах.'");
	Проверка.Идентификатор                = "ПроверкаВалютнойИСомовойСуммы";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаВалютнойИСомовойСуммы";
	Проверка.КонтекстПроверокВеденияУчета = "ВалютыИВалютныеСуммы";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	// 10. Общее.
	ГруппаПроверок = ГруппыПроверок.Добавить();
	ГруппаПроверок.Наименование    = НСтр("ru='10. Общее'");
	ГруппаПроверок.Идентификатор   = "Общее";
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "Общее";
	Проверка.ИдентификаторРодителя        = "Общее";
	Проверка.Наименование                 = НСтр("ru='Проверка проведения вводов начальных остатков первыми (по дате) документами в базе.'");
	Проверка.Причины                      = НСтр("ru='Документы ""Ввод начальных остатков"" должны быть первыми введены в базу.
														|Проверка происходит по дате проведения документа (вплоть до секунды).'");
	Проверка.Рекомендация                 = НСтр("ru='Необходимо перепровести все документы, не являющиеся вводом начальных остатков, установив дату позже, чем дата самого позднего ввода начальных остатков.'");
	Проверка.Идентификатор                = "ПроверкаВводаНачальныхОстатковНаПервенствоПоДате";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаВводаНачальныхОстатковНаПервенствоПоДате";
	Проверка.КонтекстПроверокВеденияУчета = "Общее";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "Общее";
	Проверка.ИдентификаторРодителя        = "Общее";
	Проверка.Наименование                 = НСтр("ru='Проверка связи документа ""Командировка"" с документом ""Начисление зарплаты по среднему заработку"".'");
	Проверка.Причины                      = НСтр("ru='В документе ""Командировка"" установлена настройка ""По СЗП"", но нет связанного с командировкой документа ""Начисление зарплаты по среднему заработку"".'");
	Проверка.Рекомендация				  = НСтр("ru='Проверьте документы на наличие связи.'");
	Проверка.Идентификатор                = "ПроверкаКомандировокПоСЗП";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаКомандировокПоСЗП";
	Проверка.КонтекстПроверокВеденияУчета = "Общее";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "Общее";
	Проверка.ИдентификаторРодителя        = "Общее";
	Проверка.Наименование                 = НСтр("ru='Проверка указания субконто для счетов учета блоков 1000-4000 в документе ""Операции, введенные вручную"".'");
	Проверка.Причины                      = НСтр("ru='Найдены документы ""Операции, введенные вручную"", в которых указаны счета 1ххх,2ххх,3ххх,4ххх без заполнения субконто.'");
	Проверка.Рекомендация                 = НСтр("ru='В указанных документах проверить и заполнить субконто по счетам учета.'");
	Проверка.Идентификатор                = "ПроверкаУказанияСубконтоПоСчетам1ххх_4ххх";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаУказанияСубконтоПоСчетам1ххх_4ххх";
	Проверка.КонтекстПроверокВеденияУчета = "Общее";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	// 11. Зарплата и кадры.
	ГруппаПроверок = ГруппыПроверок.Добавить();
	ГруппаПроверок.Наименование    = НСтр("ru='11. Зарплата и кадры'");
	ГруппаПроверок.Идентификатор   = "ЗарплатаИКадры";
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ЗарплатаИКадры";
	Проверка.ИдентификаторРодителя        = "ЗарплатаИКадры";
	Проверка.Наименование                 = НСтр("ru='Проверка пересечения вытесняющих видов расчета.'");
	Проверка.Причины                      = НСтр("ru='Обнаружено пересечение вытесняющих видов расчета.'");
	Проверка.Рекомендация                 = НСтр("ru='Устранить пересечение вытесняющих видов расчета.'");
	Проверка.Идентификатор                = "ПроверкаПересеченияВытесняющихВидовРасчета";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаПересеченияВытесняющихВидовРасчета";
	Проверка.КонтекстПроверокВеденияУчета = "ЗарплатаИКадры";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ЗарплатаИКадры";
	Проверка.ИдентификаторРодителя        = "ЗарплатаИКадры";
	Проверка.Наименование                 = НСтр("ru='Проверка остатков по уволенным сотрудникам.'");
	Проверка.Причины                      = НСтр("ru='Есть остатки по уволенным сотрудникам на счете 3520.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверить проведены ли документы выплат или выплатить остатки если выплаты не было.'");
	Проверка.Идентификатор                = "ПроверкаОстатковПоУволеннымСотрудникам";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаОстатковПоУволеннымСотрудникам";
	Проверка.КонтекстПроверокВеденияУчета = "ЗарплатаИКадры";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ЗарплатаИКадры";
	Проверка.ИдентификаторРодителя        = "ЗарплатаИКадры";
	Проверка.Наименование                 = НСтр("ru='Проверка указания незаполненного способа отражения зарплаты в документах: ""Отпуск"", ""Больничные листы"", ""Начисление зарплаты"".'");
	Проверка.Причины                      = НСтр("ru='В документах указан незаполненный способ отражения зарплаты.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверить используемые документы и изменить способ отражения зарплаты.'");
	Проверка.Идентификатор                = "ПроверкаСпособаОтраженияЗарплаты";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаСпособаОтраженияЗарплаты";
	Проверка.КонтекстПроверокВеденияУчета = "ЗарплатаИКадры";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ЗарплатаИКадры";
	Проверка.ИдентификаторРодителя        = "ЗарплатаИКадры";
	Проверка.Наименование                 = НСтр("ru='Проверка на заполнение графиков работ на новый год.'");
	Проверка.Причины                      = НСтр("ru='Не заполнен справочник ""Графики работ"" на новый год.'");
	Проверка.Рекомендация                 = НСтр("ru='Проверить, при необходимости внести значения на новый год.'");
	Проверка.Идентификатор                = "ПроверкаЗаполненияГрафиковРабот";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаЗаполненияГрафиковРабот";
	Проверка.КонтекстПроверокВеденияУчета = "ЗарплатаИКадры";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ЗарплатаИКадры";
	Проверка.ИдентификаторРодителя        = "ЗарплатаИКадры";
	Проверка.Наименование                 = НСтр("ru='Проверка наличия флага ""Зачет отработанного времени"" в способах расчета: по месячной ставке по дням, по месячной ставке по часам, по дневной ставе, по часовой ставке.'");
	Проверка.Причины                      = НСтр("ru='Не установлен флажок ""Зачет отработанного времени"" в справочнике ""Виды начисления"".'");
	Проверка.Рекомендация                 = НСтр("ru='Установить флажок ""Зачет отработанного времени"".'");
	Проверка.Идентификатор                = "ПроверкаЗачетаОтработанногоВремениВВидеНачисления";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаЗачетаОтработанногоВремениВВидеНачисления";
	Проверка.КонтекстПроверокВеденияУчета = "ЗарплатаИКадры";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ЗарплатаИКадры";
	Проверка.ИдентификаторРодителя        = "ЗарплатаИКадры";
	Проверка.Наименование                 = НСтр("ru='Проверка на правильность ставок налогов по зарплате в справочнике ""Статусы ЗП"".'");
	Проверка.Причины                      = НСтр("ru='Неправильно указаны ставки налогов.
													|Ставки по категориям должны быть:
													|001: ПФР-8%, ГНПФР-2%, ПН-10%, Вычеты-6,50, ПФФ-15%, МСФ-2%, ФОТФ-0,25%
													|001-64/69:	ПФР-10%, ГНПФР-0, ПН-10%, Вычеты-6,50, ПФФ-15%, МСФ-2%, ФОТФ-0,25%
													|003: ПФР-8%, ГНПФР-0, ПН-10%, Вычеты-6,50, ПФФ-15%, МСФ-2%, ФОТФ-0,25%
													|010, 020: ПФР-0, ГНПФР-0, ПН-10%, Вычеты-0, ПФФ-3%, МСФ-0, ФОТФ-0
													|100: ПФР-2%, ГНПФР-0, ПН-0, Вычеты-0, ПФФ-15%, МСФ-0, ФОТФ-0,25%
													|101: ПФР-0, ГНПФР-0, ПН-0, Вычеты-0, ПФФ-15%, МСФ-0, ФОТФ-0,25%
													|102: ПФР-0, ГНПФР-0, ПН-0, Вычеты-0, ПФФ-15%, МСФ-2%, ФОТФ-0,25%
													|106: ПФР-8%, ГНПФР-2%, ПН-10%, Вычеты-6,50, ПФФ-15%, МСФ-2%, ФОТФ-0,25%
													|106-64/69:	ПФР-10%, ГНПФР-0, ПН-10%, Вычеты-6,50, ПФФ-15%, МСФ-2%, ФОТФ-0,25%
													|107: ПФР-8%, ГНПФР-0, ПН-10%, Вычеты-6,50, ПФФ-15%, МСФ-2%, ФОТФ-0,25%'");
	Проверка.Рекомендация                 = НСтр("ru='Исправить ставки налогов.'");
	Проверка.Идентификатор                = "ПроверкаСтавокНалоговПоКатегории";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаСтавокНалоговПоКатегории";
	Проверка.КонтекстПроверокВеденияУчета = "ЗарплатаИКадры";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы	      = "ЗарплатаИКадры";
	Проверка.ИдентификаторРодителя        = "ЗарплатаИКадры";
	Проверка.Наименование                 = НСтр("ru='Проверка наличия флага ""Расчет ПН без накопления"" в УП по персоналу'");
	Проверка.Причины                      = НСтр("ru='Не установлен флаг ""Расчет ПН без накопления"".'");
	Проверка.Рекомендация                 = НСтр("ru='Установить флаг ""Расчет ПН без накопления"" во избежание пересчета с начала года.'");
	Проверка.Идентификатор                = "ПроверкаРачетаПНБезНакопления";
	Проверка.ОбработчикПроверки           = "КонтрольВеденияУчетаПереопределяемыйБП.ПроверкаРачетаПНБезНакопления";
	Проверка.КонтекстПроверокВеденияУчета = "ЗарплатаИКадры";
	Проверка.ПоддерживаетВыборочнуюПроверку = Истина;
	// Конец БПКР

КонецПроцедуры

// См. КонтрольВеденияУчетаПереопределяемый.ПередЗаписьюПроблемы.
Процедура ПередЗаписьюПроблемы(Проблема, СсылкаНаОбъект, Реквизиты) Экспорт
	
	// БПКР
	Если Реквизиты.Найти("Организация") <> Неопределено Тогда
		Проблема.Вставить("Организация", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "Организация"));
	КонецЕсли;
	// Конец БПКР
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБП

// Проверяет счета с субконто "Договоры" и "Склады".
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаСубконтоКонтрагентыИНоменклатура(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры)
		|		ИЛИ Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады)";
	Выборка = Запрос.Выполнить().Выбрать();

	СтруктураПоискаДоговора = Новый Структура();
	СтруктураПоискаДоговора.Вставить("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	СтруктураПоискаКонтрагента = Новый Структура();
	СтруктураПоискаКонтрагента.Вставить("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	                                                                                                             
	СтруктураПоискаНоменклатуры = Новый Структура();
	СтруктураПоискаНоменклатуры.Вставить("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	
	Пока Выборка.Следующий() Цикл
		Ошибка = Ложь;
		
		Если Выборка.Ссылка.ВидыСубконто.НайтиСтроки(СтруктураПоискаДоговора).Количество() > 0 Тогда
			Если Выборка.Ссылка.ВидыСубконто.НайтиСтроки(СтруктураПоискаКонтрагента).Количество() = 0 Тогда	
				Ошибка = Истина;
				ТекстУточнения = НСтр("ru = 'Обнаружен субконто ""Договоры"" но отсутствует субконто ""Контрагенты"":'") + Символы.ПС;
			КонецЕсли;
			
		Иначе
			Если Выборка.Ссылка.ВидыСубконто.НайтиСтроки(СтруктураПоискаНоменклатуры).Количество() = 0 Тогда	
				Ошибка = Истина;
				ТекстУточнения = НСтр("ru = 'Обнаружен субконто ""Склады"" но отсутствует субконто ""Номенклатура"":'") + Символы.ПС;
			КонецЕсли;	
		КонецЕсли;
		
		Если Ошибка Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда			
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = ТекстУточнения;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);				
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 1;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = ТекстУточнения;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

// Проверяет счета с субконто "ДенежныеСредства" и "СтатьиДвиженияДенежныхСредств".
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаСубконтоДС_СДДС(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	(Хозрасчетный.Родитель = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВКассе)
		|			ИЛИ Хозрасчетный.Родитель = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВБанке))
		|	И Хозрасчетный.Ссылка <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПути)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	НЕ(Хозрасчетный.Родитель = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВКассе)
		|				ИЛИ Хозрасчетный.Родитель = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВБанке))
		|	И Хозрасчетный.Ссылка <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваОграниченныеКИспользованию)";
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураПоискаДС = Новый Структура();
	СтруктураПоискаДС.Вставить("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДенежныеСредства);
	
	СтруктураПоискаСДДС = Новый Структура();
	СтруктураПоискаСДДС.Вставить("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств);
	
	ВыборкаСчетовДС_СДДС = МассивРезультатов[0].Выбрать();
	
	Пока ВыборкаСчетовДС_СДДС.Следующий() Цикл
		
		ВидыСубконто = ВыборкаСчетовДС_СДДС.Ссылка.ВидыСубконто;
		Ошибка = Ложь;
		
		Если ВидыСубконто.НайтиСтроки(СтруктураПоискаДС).Количество() = 0 Тогда
			Ошибка = Истина;
			ТекстУточнения = НСтр("ru = 'У счета не обнаружено субконто ""Денежные средства"".'") + Символы.ПС;
		КонецЕсли;
				
		Если ВидыСубконто.НайтиСтроки(СтруктураПоискаСДДС).Количество() = 0 Тогда
			Если Ошибка Тогда
				ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
										  |У счета не обнаружено субконто ""Статья движения денежных средств"".'"), ТекстУточнения);
			Иначе
				ТекстУточнения = НСтр("ru = 'У счета не обнаружено субконто ""Статья движения денежных средств"".'") + Символы.ПС;
			КонецЕсли;
			
			Ошибка = Истина;
		КонецЕсли;
		
		Если ВидыСубконто.Количество() < 2 Тогда
			Если Ошибка Тогда
				ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
										  |У счета не хватает субконто.'"), ТекстУточнения);
			Иначе
				ТекстУточнения = НСтр("ru = 'У счета не хватает субконто.'") + Символы.ПС;
			КонецЕсли;
			
			Ошибка = Истина;			
		КонецЕсли;
		
		Если ВидыСубконто.Количество() > 2 Тогда
			Если Ошибка Тогда
				ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
										  |У счета лишнее субконто.'"), ТекстУточнения);
			Иначе
				ТекстУточнения = НСтр("ru = 'У счета лишнее субконто.'") + Символы.ПС;
			КонецЕсли;
			
			Ошибка = Истина;			
		КонецЕсли;
		
		Если Ошибка Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаСчетовДС_СДДС.Ссылка, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = '%1'"),ТекстУточнения);
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 1;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаСчетовДС_СДДС.Ссылка;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = ТекстУточнения;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;				
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;

	ВыборкаОстальныхСчетов = МассивРезультатов[1].Выбрать();
	
	Пока ВыборкаОстальныхСчетов.Следующий() Цикл
		
		ВидыСубконто = ВыборкаОстальныхСчетов.Ссылка.ВидыСубконто;
		Ошибка = Ложь;
		
		Если ВидыСубконто.НайтиСтроки(СтруктураПоискаДС).Количество() > 0 Тогда	
			Ошибка = Истина;
			ТекстУточнения = НСтр("ru = 'У счета обнаружено субконто ""Денежные средства"".'") + Символы.ПС;
		КонецЕсли;
			
		Если ВидыСубконто.НайтиСтроки(СтруктураПоискаСДДС).Количество() > 0 Тогда
			Если Ошибка Тогда
				ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
										  |У счета обнаружено субконто ""Статья движения денежных средств"".'"), ТекстУточнения);
			Иначе
				ТекстУточнения = НСтр("ru = 'У счета обнаружено субконто ""Статья движения денежных средств"".'") + Символы.ПС;
			КонецЕсли;
			
			Ошибка = Истина;			
		КонецЕсли;
		
		Если Ошибка Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаОстальныхСчетов.Ссылка, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = '%1'"),ТекстУточнения);
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 1;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаОстальныхСчетов.Ссылка;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = ТекстУточнения;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;				
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Проверяет признаки и признаки субконто счетов 6ххх, 7ххх, 8ххх, 9ххх.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаПризнаковСчета(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка,
		|	Хозрасчетный.Временный КАК Временный,
		|	Хозрасчетный.Валютный КАК Валютный,
		|	Хозрасчетный.Количественный КАК Количественный
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
		|	И (ПОДСТРОКА(Хозрасчетный.Код, 0, 1) = ""6""
		|		  ИЛИ ПОДСТРОКА(Хозрасчетный.Код, 0, 1) = ""7""
		|		  ИЛИ ПОДСТРОКА(Хозрасчетный.Код, 0, 1) = ""8""
		|		  ИЛИ ПОДСТРОКА(Хозрасчетный.Код, 0, 1) = ""9"")
		|;
		|
		|/////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Временный
		|	И НЕ(ПОДСТРОКА(Хозрасчетный.Код, 0, 1) = ""6""
		|		    ИЛИ ПОДСТРОКА(Хозрасчетный.Код, 0, 1) = ""7""
		|		    ИЛИ ПОДСТРОКА(Хозрасчетный.Код, 0, 1) = ""8""
		|		    ИЛИ ПОДСТРОКА(Хозрасчетный.Код, 0, 1) = ""9"")";
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураПоискаТолькоОбороты = Новый Структура();
	СтруктураПоискаТолькоОбороты.Вставить("ТолькоОбороты", Ложь);
	
	СтруктураПоискаСуммовой = Новый Структура();
	СтруктураПоискаСуммовой.Вставить("Суммовой", Ложь);
	
	ВыборкаСчетов6789 = МассивРезультатов[0].Выбрать();		

	Пока ВыборкаСчетов6789.Следующий() Цикл
		Ошибка = Ложь;
		
		Если ВыборкаСчетов6789.Ссылка.ВидыСубконто.НайтиСтроки(СтруктураПоискаТолькоОбороты).Количество() > 0 Тогда
			Ошибка = Истина;
			//ТекстУточнения = НСтр("ru = 'У субконто счета не установлен признак ""Только обороты"".'") + Символы.ПС;
		КонецЕсли;
		
		Если ВыборкаСчетов6789.Ссылка.ВидыСубконто.НайтиСтроки(СтруктураПоискаСуммовой).Количество() > 0 Тогда
			Ошибка = Истина;
			//ТекстУточнения = НСтр("ru = 'У субконто счета не установлен признак ""Суммовой"".'") + Символы.ПС;
		КонецЕсли;
				
		Если НЕ ВыборкаСчетов6789.Временный Тогда
			//Если Ошибка Тогда
			//	ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
			//							  |У счета не указан признак ""Временный"".'"), ТекстУточнения);
			//Иначе
			//	ТекстУточнения = НСтр("ru = 'У счета не указан признак ""Временный"".'") + Символы.ПС;
			//КонецЕсли;
			
			Ошибка = Истина;
		КонецЕсли;
			
		Если ВыборкаСчетов6789.Валютный Тогда
			//Если Ошибка Тогда
			//	ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
			//							  |У счета указан признак ""Валютный"".'"), ТекстУточнения);
			//Иначе
			//	ТекстУточнения = НСтр("ru = 'У счета указан признак ""Валютный"".'") + Символы.ПС;
			//КонецЕсли;
			
			Ошибка = Истина;
		КонецЕсли;
			
		Если ВыборкаСчетов6789.Количественный Тогда
			//Если Ошибка Тогда
			//	ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
			//							  |У счета указан признак ""Количественный"".'"), ТекстУточнения);
			//Иначе
			//	ТекстУточнения = НСтр("ru = 'У счета указан признак ""Количественный"".'") + Символы.ПС;
			//КонецЕсли;
			
			Ошибка = Истина;
		КонецЕсли;
		
		Если Ошибка Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаСчетов6789.Ссылка, ПараметрыПроверки);
				//Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = '%1'"),ТекстУточнения);
				Проблема.УточнениеПроблемы = НСтр("ru = 'Обнаружен неправильно созданный счет.'") + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 3;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаСчетов6789.Ссылка;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'Обнаружен неправильно созданный счет.'") + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;				
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаОстальныхСчетов = МассивРезультатов[1].Выбрать();		

	Пока ВыборкаОстальныхСчетов.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаОстальныхСчетов.Ссылка, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = НСтр("ru = 'Обнаружен неправильно созданный счет.'") + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);	
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 3;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаОстальныхСчетов.Ссылка;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'Обнаружен неправильно созданный счет.'") + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Проверяет правильность указания парных счетов.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаПарныхСчетов(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		// 1. Выбираются все парные счета и свойства первого счета.
		// 2. Выбираются все парные счета, где ни один из счетов не является 1ххх или 2ххх.
		// 3. Выбираются все парные счета.
		// 4. Выбираются парные счета, где один счет 1ххх, а второй не 3ххх, за исключением счетов 1750 и 1795.
		// 5. Выбираются парные счета, где один счет 21хх или 29хх, а второй не 21хх или 29хх.
		// 6. Выбираются счета, где один счет 2ххх, но не 21хх и не 29хх, а второй счет не 4ххх.
		// 7. Выбираются все данные из 1 пункта, но коды счета и парного счета обрезаются до двух первых цифр.
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Счет,
		|	Хозрасчетный.ПарныйСчет КАК ПарныйСчет,
		|	Хозрасчетный.Код КАК КодСчета,
		|	Хозрасчетный.ПарныйСчет.Код КАК КодПарногоСчета,
		|	Хозрасчетный.Забалансовый КАК Забалансовый,
		|	Хозрасчетный.ЗапретитьИспользоватьВПроводках КАК ЗапретитьИспользоватьВПроводках,
		|	Хозрасчетный.Временный КАК Временный,
		|	Хозрасчетный.Валютный КАК Валютный,
		|	Хозрасчетный.Количественный КАК Количественный,
		|	Хозрасчетный.Вид КАК Вид
		|ПОМЕСТИТЬ ВременнаяТаблицаПарныеСчета
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	НЕ Хозрасчетный.ПарныйСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
		|	И Хозрасчетный.Ссылка <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МБП)
		|	И Хозрасчетный.Ссылка <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленныйИзносМБП)
		|	И Хозрасчетный.ПарныйСчет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МБП)
		|	И Хозрасчетный.ПарныйСчет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленныйИзносМБП)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПарныеСчета.Счет КАК Счет,
		|	ВременнаяТаблицаПарныеСчета.ПарныйСчет КАК ПарныйСчет
		|ИЗ
		|	ВременнаяТаблицаПарныеСчета КАК ВременнаяТаблицаПарныеСчета
		|ГДЕ
		|	ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодСчета, 0, 1) <> ""1""
		|	И ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодСчета, 0, 1) <> ""2""
		|	И ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодПарногоСчета, 0, 1) <> ""1""
		|	И ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодПарногоСчета, 0, 1) <> ""2""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПарныеСчета.Счет КАК Счет,
		|	ВременнаяТаблицаПарныеСчета.ПарныйСчет КАК ПарныйСчет
		|ИЗ
		|	ВременнаяТаблицаПарныеСчета КАК ВременнаяТаблицаПарныеСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПарныеСчета.Счет КАК Счет,
		|	ВременнаяТаблицаПарныеСчета.ПарныйСчет КАК ПарныйСчет
		|ИЗ
		|	ВременнаяТаблицаПарныеСчета КАК ВременнаяТаблицаПарныеСчета
		|ГДЕ
		|	ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодСчета, 0, 1) = ""1""
		|	И ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодПарногоСчета, 0, 1) <> ""3""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПарныеСчета.Счет КАК Счет,
		|	ВременнаяТаблицаПарныеСчета.ПарныйСчет КАК ПарныйСчет
		|ИЗ
		|	ВременнаяТаблицаПарныеСчета КАК ВременнаяТаблицаПарныеСчета
		|ГДЕ
		|	(ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодСчета, 0, 2) = ""21""
		|			ИЛИ ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодСчета, 0, 2) = ""29"")
		|	И ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодПарногоСчета, 0, 2) <> ""21""
		|	И ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодПарногоСчета, 0, 2) <> ""29""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПарныеСчета.Счет КАК Счет,
		|	ВременнаяТаблицаПарныеСчета.ПарныйСчет КАК ПарныйСчет
		|ИЗ
		|	ВременнаяТаблицаПарныеСчета КАК ВременнаяТаблицаПарныеСчета
		|ГДЕ
		|	ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодСчета, 0, 1) = ""2""
		|	И ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодСчета, 0, 2) <> ""21""
		|	И ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодСчета, 0, 2) <> ""29""
		|	И ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодПарногоСчета, 0, 1) <> ""4""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаПарныеСчета.Счет КАК Счет,
		|	ВременнаяТаблицаПарныеСчета.ПарныйСчет КАК ПарныйСчет,
		|	ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодСчета, 0, 2) КАК КодСчета,
		|	ПОДСТРОКА(ВременнаяТаблицаПарныеСчета.КодПарногоСчета, 0, 2) КАК КодПарногоСчета,
		|	ВременнаяТаблицаПарныеСчета.Забалансовый КАК Забалансовый,
		|	ВременнаяТаблицаПарныеСчета.ЗапретитьИспользоватьВПроводках КАК ЗапретитьИспользоватьВПроводках,
		|	ВременнаяТаблицаПарныеСчета.Временный КАК Временный,
		|	ВременнаяТаблицаПарныеСчета.Валютный КАК Валютный,
		|	ВременнаяТаблицаПарныеСчета.Количественный КАК Количественный,
		|	ВременнаяТаблицаПарныеСчета.Вид КАК Вид
		|ИЗ
		|	ВременнаяТаблицаПарныеСчета КАК ВременнаяТаблицаПарныеСчета";
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	// Парный счет указывается только для счетов 1ххх и 2ххх.
	ВыборкаОшибочныеПарныеСчета = МассивРезультатов[1].Выбрать();		
	
	Пока ВыборкаОшибочныеПарныеСчета.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаОшибочныеПарныеСчета.Счет, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Парный счет указывается только для счетов 1ххх и 2ххх.
															  |А для счета %1 указан парный счет %2.'"),
															  ВыборкаОшибочныеПарныеСчета.Счет, ВыборкаОшибочныеПарныеСчета.ПарныйСчет);
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 4;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаОшибочныеПарныеСчета.Счет;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Парный счет указывается только для счетов 1ххх и 2ххх.
															  |А для счета %1 указан парный счет %2.'"),
															  ВыборкаОшибочныеПарныеСчета.Счет, ВыборкаОшибочныеПарныеСчета.ПарныйСчет);
													
			 ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
		КонецЕсли;
	КонецЦикла;

	// Каждый парный счет указывается только  для одного счета. 
	ТЗПарныхСчетов = МассивРезультатов[2].Выгрузить();
	ТЗПарныхСчетов.Индексы.Добавить("Счет");

	Для Каждого СтрокаТаблицыЗначений Из ТЗПарныхСчетов Цикл
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Счет", СтрокаТаблицыЗначений.Счет);
		МассивСтрок = ТЗПарныхСчетов.НайтиСтроки(СтруктураОтбора);
		КоличествоСтрок = МассивСтрок.Количество();
		Если КоличествоСтрок > 1 Тогда
			СчетаСтрокой = НСтр("ru = 'Данный счет является парным для счетов:'");
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				Если КоличествоСтрок = 1 Тогда
					СчетаСтрокой = СтрШаблон(НСтр("ru = '%1 %2,'"), СчетаСтрокой, СтрокаТаблицыЗначений.ПарныйСчет);
				Иначе
					СчетаСтрокой = СтрШаблон(НСтр("ru = '%1 %2.'"), СчетаСтрокой, СтрокаТаблицыЗначений.ПарныйСчет);
				КонецЕсли;
				КоличествоСтрок = КоличествоСтрок - 1;
			КонецЦикла;
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(СтрокаТаблицыЗначений.Счет, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Каждый парный счет указывается только для одного счета.
																  |%1.'"), СчетаСтрокой);
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 4;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = СтрокаТаблицыЗначений.Счет;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Каждый парный счет указывается только для одного счета.
																  |%1.'"), СчетаСтрокой);
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Для счета 1ххх парный счет должен быть 3ххх.
	ВыборкаПарныхСчетов1ххх = МассивРезультатов[3].Выбрать();		
	
	Пока ВыборкаПарныхСчетов1ххх.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаПарныхСчетов1ххх.Счет, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = НСтр("ru = 'Для счета 1ххх парный счет должен быть 3ххх.'");
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 4;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаПарныхСчетов1ххх.Счет;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'Для счета 1ххх парный счет должен быть 3ххх.'");
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Для счета 21хх или 29хх парный счет должен быть также 21хх или 29хх.
	ВыборкаПарныхСчетов21хх_29хх = МассивРезультатов[4].Выбрать();		
	
	Пока ВыборкаПарныхСчетов21хх_29хх.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаПарныхСчетов21хх_29хх.Счет, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = НСтр("ru = 'Для счета 21хх или 29хх парный счет должен быть также 21хх или 29хх.'");
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 4;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаПарныхСчетов21хх_29хх.Счет;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'Для счета 21хх или 29хх парный счет должен быть также 21хх или 29хх.'");
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Для прочих счетов 2ххх парный счет должен быть 4ххх.
	ВыборкаПрочихПарныхСчетов2ххх = МассивРезультатов[5].Выбрать();		
	
	Пока ВыборкаПрочихПарныхСчетов2ххх.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаПрочихПарныхСчетов2ххх.Счет, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = НСтр("ru = 'Для счетов 2ххх, кроме 21хх и 29хх, парный счет должен быть 4ххх.'");
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 4;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаПрочихПарныхСчетов2ххх.Счет;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'Для счетов 2ххх, кроме 21хх и 29хх, парный счет должен быть 4ххх.'");
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Для парных счетов кроме 21хх и 29хх все признаки, субконто и признаки субконто должны совпадать. 
	// Первый счет пары должен быть активным, а второй - пассивным.
	ТЗСчетовСравнения = МассивРезультатов[6].Выгрузить();
	
	Счет = Неопределено;
	ПарныйСчет = Неопределено;
	
	Для Каждого СтрокаТаблицыЗначений Из ТЗСчетовСравнения Цикл;
		
		Ошибка = Ложь;
		
		Если Счет = Неопределено Тогда
			Счет = СтрокаТаблицыЗначений.Счет;
			ПарныйСчет = СтрокаТаблицыЗначений.ПарныйСчет;
		КонецЕсли;
		
		Если СтрокаТаблицыЗначений.ПарныйСчет = Счет И СтрокаТаблицыЗначений.Счет = ПарныйСчет Тогда
			Прервать;
		КонецЕсли;
		
		Если (СтрокаТаблицыЗначений.КодСчета <> "21" И СтрокаТаблицыЗначений.КодСчета <> "29")
			ИЛИ (СтрокаТаблицыЗначений.КодПарногоСчета <> "21" И СтрокаТаблицыЗначений.КодПарногоСчета <> "29") Тогда
			СтруктураОтбора = Новый Структура();
			СтруктураОтбора.Вставить("Счет", СтрокаТаблицыЗначений.ПарныйСчет);
			
			МассивСтрок = ТЗСчетовСравнения.НайтиСтроки(СтруктураОтбора);
			
			Если МассивСтрок.Количество() = 0 Тогда
				Ошибка = Истина;
				ТекстУточнения = СтрШаблон(НСтр("ru = 'Для счета %1 настроен парный счет %2, но у счета %2 не настроен парный счет.
										   |У счета %1 удалите парный счет, затем запишите его, а затем выберите парный счет.'"), 
										  СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;	
			Иначе	
			
				ДанныеПарногоСчета = МассивСтрок[0];
				
				Если СтрокаТаблицыЗначений.Вид = ВидСчета.Активный И ДанныеПарногоСчета.Вид = ВидСчета.Активный Тогда
					Ошибка = Истина;
					ТекстУточнения = СтрШаблон(НСтр("ru = 'Один счет пары должен быть активным, а второй - пассивным.
											   |Оба парных счета %1 и %2 являются активными.'"), 
											  СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
											  
				ИначеЕсли СтрокаТаблицыЗначений.Вид = ВидСчета.Пассивный И ДанныеПарногоСчета.Вид = ВидСчета.Пассивный Тогда
					Ошибка = Истина;
					ТекстУточнения = СтрШаблон(НСтр("ru = 'Один счет пары должен быть активным, а второй - пассивным.
											   |Оба парных счета %1 и %2 являются пассивными.'"), 
											  СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;	
				КонецЕсли;
				
				Если СтрокаТаблицыЗначений.Забалансовый <> ДанныеПарногоСчета.Забалансовый Тогда
					Если Ошибка Тогда
						ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
												  |У парных счетов %2 и %3 отличаются значения признака ""Забалансовый"".'"), 
												  ТекстУточнения, СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
					Иначе
						ТекстУточнения = СтрШаблон(НСтр("ru = 'У парных счетов %1 и %2 отличаются значения признака ""Забалансовый"".'"), 
												  СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
					КонецЕсли;
					
					Ошибка = Истина;
				КонецЕсли;

				Если СтрокаТаблицыЗначений.ЗапретитьИспользоватьВПроводках <> ДанныеПарногоСчета.ЗапретитьИспользоватьВПроводках Тогда
					Если Ошибка Тогда
						ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
												  |У парных счетов %2 и %3 отличаются значения признака ""Счет является группой"".'"), 
												  ТекстУточнения, СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
					Иначе
						ТекстУточнения = СтрШаблон(НСтр("ru = 'У парных счетов %1 и %2 отличаются значения признака ""Счет является группой"".'"), 
												  СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
					КонецЕсли;
					
					Ошибка = Истина;	
				КонецЕсли;
				
				Если СтрокаТаблицыЗначений.Временный <> ДанныеПарногоСчета.Временный Тогда
					Если Ошибка Тогда
						ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
												  |У парных счетов %2 и %3 отличаются значения признака ""Временный"".'"), 
												  ТекстУточнения, СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
					Иначе
						ТекстУточнения = СтрШаблон(НСтр("ru = 'У парных счетов %1 и %2 отличаются значения признака ""Временный"".'"), 
												  СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
					КонецЕсли;
					
					Ошибка = Истина;	
				КонецЕсли;
				
				Если СтрокаТаблицыЗначений.Валютный <> ДанныеПарногоСчета.Валютный Тогда
					Если Ошибка Тогда
						ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
												  |У парных счетов %2 и %3 отличаются значения признака ""Валютный"".'"), 
												  ТекстУточнения, СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
					Иначе
						ТекстУточнения = СтрШаблон(НСтр("ru = 'У парных счетов %1 и %2 отличаются значения признака ""Валютный"".'"), 
												  СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
					КонецЕсли;
					
					Ошибка = Истина;	
				КонецЕсли;
				
				Если СтрокаТаблицыЗначений.Количественный <> ДанныеПарногоСчета.Количественный Тогда
					Если Ошибка Тогда
						ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
												  |У парных счетов %2 и %3 отличаются значения признака ""Количественный"".'"), 
												  ТекстУточнения, СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
					Иначе
						ТекстУточнения = СтрШаблон(НСтр("ru = 'У парных счетов %1 и %2 отличаются значения признака ""Количественный"".'"), 
												  СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
					КонецЕсли;
					
					Ошибка = Истина;	
				КонецЕсли;

				СубконтоСчета = СтрокаТаблицыЗначений.Счет.ВидыСубконто;
				СубконтоПарногоСчета = ДанныеПарногоСчета.Счет.ВидыСубконто;
				
				Если СубконтоСчета.Количество() <> СубконтоПарногоСчета.Количество() Тогда
					ОдинаковоеКоличествоСубконто = Ложь;
					Если Ошибка Тогда
						ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
												  |У парных счетов %2 и %3 отличается количество субконто.'"), 
												  ТекстУточнения, СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
					Иначе
						ТекстУточнения = СтрШаблон(НСтр("ru = 'У парных счетов %1 и %2 отличается количество субконто.'"), 
												  СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
					КонецЕсли;
					
					Ошибка = Истина;
				Иначе
					ОдинаковоеКоличествоСубконто = Истина;
				КонецЕсли;
				
				Если ОдинаковоеКоличествоСубконто Тогда
					Для Каждого	СтрокаСубконтоСчета Из СубконтоСчета Цикл
						СтруктураОтбора = Новый Структура();
						СтруктураОтбора.Вставить("НомерСтроки", СтрокаСубконтоСчета.НомерСтроки);
						СтруктураОтбора.Вставить("ВидСубконто", СтрокаСубконтоСчета.ВидСубконто);
						СтруктураОтбора.Вставить("ТолькоОбороты", СтрокаСубконтоСчета.ТолькоОбороты);
						СтруктураОтбора.Вставить("Суммовой", СтрокаСубконтоСчета.Суммовой);
						
						Если СтрокаТаблицыЗначений.Валютный Тогда
							СтруктураОтбора.Вставить("Валютный", СтрокаСубконтоСчета.Валютный);
						КонецЕсли;	
						
						Если СтрокаТаблицыЗначений.Количественный Тогда
							СтруктураОтбора.Вставить("Количественный", СтрокаСубконтоСчета.Количественный);
						КонецЕсли;
						
						Если СубконтоПарногоСчета.НайтиСтроки(СтруктураОтбора).Количество() = 0 Тогда
							Если Ошибка Тогда
								ТекстУточнения = СтрШаблон(НСтр("ru = '%1 
														  |У парных счетов %2 и %3 отличаются субконто, или признаки субконто, или порядок.'"), 
														  ТекстУточнения, СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
							Иначе
								ТекстУточнения = СтрШаблон(НСтр("ru = 'У парных счетов %1 и %2 отличаются субконто, или признаки субконто, или порядок.'"), 
														  СтрокаТаблицыЗначений.Счет, СтрокаТаблицыЗначений.ПарныйСчет) + Символы.ПС;
							КонецЕсли;

							Ошибка = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли;
			КонецЕсли;	
				
			Если Ошибка Тогда
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(СтрокаТаблицыЗначений.Счет, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = '%1'"),ТекстУточнения);
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
				Иначе
					СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 4;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = СтрокаТаблицыЗначений.Счет;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = ТекстУточнения;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
				КонецЕсли;
					
				Продолжить;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

// Проверяет правильность указания признака "Валютный" у счетов.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаПризнакаВалютный(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка,
		|	Хозрасчетный.ВидыСубконто.(
		|		ВидСубконто КАК ВидСубконто
		|	) КАК ВидыСубконто
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Ссылка <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами)
		|	И Хозрасчетный.Ссылка <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДолговыеЦенныеБумаги)
		|	И Хозрасчетный.Ссылка <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.КредиторскаяЗадолженностьПодотчетнымЛицам)
		|	И Хозрасчетный.Ссылка <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПути)
		|	И Хозрасчетный.Валютный";
	Выборка = Запрос.Выполнить().Выбрать();		

	Пока Выборка.Следующий() Цикл
		
		ВыборкаВидыСубконто = Выборка.ВидыСубконто.Выбрать();
		
		Если ВыборкаВидыСубконто.Количество() = 0 Тогда	
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = НСтр("ru = 'У счета не обнаружено необходимых субконто, но стоит признак ""Валютный"".'") + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 5;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'У счета не обнаружено необходимых субконто, но стоит признак ""Валютный"".'") + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
			КонецЕсли;
			
		Иначе				
			ЕстьСубконтоКонтрагенты = Ложь;
			ЕстьСубконтоДоговоры 	= Ложь;
			ЕстьСубконтоДС		 	= Ложь;
			
			Пока ВыборкаВидыСубконто.Следующий() Цикл
				
				Если ВыборкаВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДенежныеСредства Тогда
					ЕстьСубконтоДС = Истина;					
				КонецЕсли;	
				
				Если ВыборкаВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты Тогда
					ЕстьСубконтоКонтрагенты = Истина;					
				КонецЕсли;
				
				Если ВыборкаВидыСубконто.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры Тогда
					ЕстьСубконтоДоговоры = Истина;					
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьСубконтоДС Тогда
				Продолжить;	
			КонецЕсли;	
			
			Если ЕстьСубконтоДоговоры И ЕстьСубконтоКонтрагенты Тогда
				Продолжить;	
			КонецЕсли;	
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = НСтр("ru = 'У счета не обнаружено необходимых субконто, но стоит признак ""Валютный"".'") + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);	
			Иначе
				СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 5;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'У счета не обнаружено необходимых субконто, но стоит признак ""Валютный"".'") + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
			КонецЕсли;
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

// Проверяет правильность указания признака "Валютный" у счетов.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаПризнакаАктивно_Пассивный(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка,
		|	Хозрасчетный.Код КАК Код,
		|	Хозрасчетный.ВидыСубконто.(
		|		ВидСубконто КАК ВидСубконто
		|	) КАК ВидыСубконто
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Вид = Значение(ВидСчета.АктивноПассивный)";	
	Выборка = Запрос.Выполнить().Выбрать();
	        
	Пока Выборка.Следующий() Цикл
		Код 				 = Выборка.Код;
		ПервыйСимволКода 	 = Лев(Код, 1);
		ПервыеДваСимволаКода = Лев(Код, 2);
		
		Если ПервыеДваСимволаКода <> "14" И ПервыеДваСимволаКода <> "15" И ПервыеДваСимволаКода <> "31" 
			И ПервыеДваСимволаКода <> "34" И ПервыеДваСимволаКода <> "35" 
			И ПервыйСимволКода <> "5" И ПервыйСимволКода <> "Z"
			И Код <> "0000" И Код <> "9000" И Код <> "9800" Тогда	
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = НСтр("ru = 'Активно-пассивными могут быть только счета 14хх, 15хх, 31хх, 34хх, 35хх, 0000, 5ххх, 9000, 9800, Zхххх.'") + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 6;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'Активно-пассивными могут быть только счета 14хх, 15хх, 31хх, 34хх, 35хх, 0000, 5ххх, 9000, 9800, Zхххх.'") + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
			КонецЕсли;
			
			Продолжить;
			
		ИначеЕсли ПервыйСимволКода = "5" ИЛИ ПервыйСимволКода = "Z" ИЛИ Код = "0000" ИЛИ Код = "9000" ИЛИ Код = "9800" Тогда	
			Продолжить;
		КонецЕсли;	
		
		ВыборкаСубконто = Выборка.ВидыСубконто.Выбрать();
		
		Если ВыборкаСубконто.Количество() = 0 Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = НСтр("ru = 'Активно-пассивные счета должны иметь первым субконто ""Контрагенты"" или ""Работники (Физические лица)"".'") + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 6;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'Активно-пассивные счета должны иметь первым субконто ""Контрагенты"" или ""Работники (Физические лица)"".'") + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
			КонецЕсли;
				
		Иначе	
			Пока ВыборкаСубконто.Следующий() Цикл
				Если ВыборкаСубконто.ВидСубконто <> ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты
					И ВыборкаСубконто.ВидСубконто <> ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СотрудникиОрганизаций Тогда
					
					Если ДанныеАвторскогоНадзора = Неопределено Тогда
						Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
						Проблема.УточнениеПроблемы = НСтр("ru = 'Активно-пассивные счета должны иметь первым субконто ""Контрагенты"" или ""Работники (Физические лица)"".'") + Символы.ПС;
						КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
					Иначе
						СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
						СтрокаТабличнойЧасти.НомерПроверки = 6;
						СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
						СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'Активно-пассивные счета должны иметь первым субконто ""Контрагенты"" или ""Работники (Физические лица)"".'") + Символы.ПС;
																
						ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
					КонецЕсли;
					
					Прервать;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

// Проверяет соответствие сумм себестоимости ТМЗ и первоначальной стоимости ОС.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаСоответствияСуммТМЗ_И_ОС(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Содержание", НСтр("ru = 'Поступление основного средства'"));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПринятиеКУчетуОС.Ссылка КАК Регистратор,
		|	ПринятиеКУчетуОС.Дата КАК Период,
		|	ПринятиеКУчетуОС.Организация КАК Организация,
		|	ПринятиеКУчетуОС.Склад КАК Склад,
		|	Неопределено КАК Контрагент,
		|	ПринятиеКУчетуОС.СчетУчета КАК СчетУчета,
		|	ПринятиеКУчетуОС.Номенклатура КАК Номенклатура,
		|	&Содержание КАК Содержание
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.ПринятиеКУчетуОС КАК ПринятиеКУчетуОС
		|ГДЕ
		|	ПринятиеКУчетуОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование)
		|	И ПринятиеКУчетуОС.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПринятиеКУчетуОСОС.НомерСтроки КАК НомерСтроки,
		|	ПринятиеКУчетуОСОС.СчетУчета КАК СчетУчета,
		|	ПринятиеКУчетуОСОС.ОсновноеСредство КАК ОсновноеСредство,
		|	ПринятиеКУчетуОСОС.Ссылка КАК Ссылка,
		|	ПринятиеКУчетуОСОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость
		|ПОМЕСТИТЬ ВременнаяТаблицаОС
		|ИЗ
		|	Документ.ПринятиеКУчетуОС.ОС КАК ПринятиеКУчетуОСОС
		|ГДЕ
		|	ПринятиеКУчетуОСОС.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОсновныхСредств.Оборудование)
		|	И ПринятиеКУчетуОСОС.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Регистратор КАК Регистратор,
		|	ВременнаяТаблицаШапка.Период КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Содержание КАК Содержание,
		|	ВременнаяТаблицаШапка.Склад КАК Склад,
		|	Неопределено КАК Контрагент
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Регистратор КАК Регистратор,
		|	""Товары"" КАК ИмяСписка,
		|	""Товары"" КАК СинонимСписка,
		|	ВременнаяТаблицаШапка.Период КАК Период,
		|	ВременнаяТаблицаОС.НомерСтроки КАК НомерСтроки,
		|	ВременнаяТаблицаШапка.СчетУчета КАК СчетУчета,
		|	ВременнаяТаблицаШапка.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаШапка.Склад КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК ДокументОприходования,
		|	0 КАК Себестоимость,
		|	1 КАК Количество,
		|	ВременнаяТаблицаОС.СчетУчета КАК КорСчетСписания,
		|	ВременнаяТаблицаОС.ОсновноеСредство КАК КорСубконто1,
		|	НЕОПРЕДЕЛЕНО КАК КорСубконто2,
		|	НЕОПРЕДЕЛЕНО КАК КорСубконто3,
		|	ВременнаяТаблицаОС.ПервоначальнаяСтоимость КАК СебестоимостьПоДокументу
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ПО ВременнаяТаблицаШапка.Регистратор = ВременнаяТаблицаОС.Ссылка";
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаРеквизиты = МассивРезультатов[2].Выгрузить();
	ТаблицаТовары = МассивРезультатов[3].Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаРеквизиты Цикл
	
		НоваяТаблицаРеквизиты 	= ТаблицаРеквизиты.СкопироватьКолонки();
		НоваяТаблицаТовары 		= ТаблицаТовары.СкопироватьКолонки();
		
		НоваяСтрокаТаблицы = НоваяТаблицаРеквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаТаблицы);
		
		Отбор = Новый Структура("Регистратор", СтрокаТаблицы.Регистратор);
		МассивСтрок = ТаблицаТовары.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаМассива Из МассивСтрок Цикл
			НоваяСтрокаТаблицы = НоваяТаблицаТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаМассива);	
		КонецЦикла;	
		
		ТаблицаСписанныеТовары = УчетТоваров.ПодготовитьТаблицуСписанныеТовары(НоваяТаблицаТовары, НоваяТаблицаРеквизиты, Ложь);
		
		Для Каждого СтрокаТаблицыТовары Из НоваяТаблицаТовары Цикл

			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура", СтрокаТаблицыТовары.Номенклатура);
			Отбор.Вставить("КорСубконто1", СтрокаТаблицыТовары.КорСубконто1);
			
			МассивСтрок = ТаблицаСписанныеТовары.НайтиСтроки(Отбор);
			
			Если МассивСтрок.Количество() > 0 Тогда
				
				Если СтрокаТаблицыТовары.СебестоимостьПоДокументу <> МассивСтрок[0].СуммаСписания Тогда
					
					Если ДанныеАвторскогоНадзора = Неопределено Тогда
						Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(СтрокаТаблицыТовары.КорСубконто1, ПараметрыПроверки);
						Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Первоначальная стоимость ОС ""%1"" отличается от себестоимости номенклатуры %2'"),
																			СтрокаТаблицыТовары.КорСубконто1, СтрокаТаблицыТовары.Номенклатура) + Символы.ПС;
						КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
					Иначе
						СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
						СтрокаТабличнойЧасти.НомерПроверки = 1;
						СтрокаТабличнойЧасти.ПроблемныйОбъект = СтрокаТаблицыТовары.КорСубконто1;
						СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Первоначальная стоимость ОС ""%1"" отличается от себестоимости номенклатуры %2'"),
																			СтрокаТаблицыТовары.КорСубконто1, СтрокаТаблицыТовары.Номенклатура) + Символы.ПС;
																
						ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Проверяет наличие основного договора с признаком "Прочее".
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаЗаполненияГруппыНУ(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетнаяПолитикаОрганизаций.Период КАК Период,
		|	УчетнаяПолитикаОрганизаций.Организация КАК Организация,
		|	УчетнаяПолитикаОрганизаций.МинимумСтоимостиОСДляНУ КАК МинимумСтоимостиОСДляНУ
		|ПОМЕСТИТЬ ВременнаяТаблицаУчетнаяПолитика
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыУчетаОС.ОсновноеСредство КАК ОсновноеСредство,
		|	ПараметрыУчетаОС.Организация КАК Организация,
		|	ПараметрыУчетаОС.Регистратор КАК Регистратор,
		|	ПараметрыУчетаОС.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
		|	МАКСИМУМ(ВременнаяТаблицаУчетнаяПолитика.Период) КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаМаксПериод
		|ИЗ
		|	РегистрСведений.ПараметрыУчетаОС КАК ПараметрыУчетаОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО ПараметрыУчетаОС.Период >= ВременнаяТаблицаУчетнаяПолитика.Период
		|			И ПараметрыУчетаОС.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|ГДЕ
		|	ПараметрыУчетаОС.ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.ПустаяСсылка)
		|	И ПараметрыУчетаОС.СчетУчета <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Земля)
		|	И (ПараметрыУчетаОС.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
		|		ИЛИ ПараметрыУчетаОС.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПараметрыУчетаОС.ОсновноеСредство,
		|	ПараметрыУчетаОС.Регистратор,
		|	ПараметрыУчетаОС.Организация,
		|	ПараметрыУчетаОС.ПервоначальнаяСтоимость
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаМаксПериод.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаМаксПериод.Регистратор КАК Ссылка
		|ИЗ
		|	ВременнаяТаблицаМаксПериод КАК ВременнаяТаблицаМаксПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО ВременнаяТаблицаМаксПериод.Период = ВременнаяТаблицаУчетнаяПолитика.Период
		|			И ВременнаяТаблицаМаксПериод.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|ГДЕ
		|	ВременнаяТаблицаМаксПериод.ПервоначальнаяСтоимость >= ВременнаяТаблицаУчетнаяПолитика.МинимумСтоимостиОСДляНУ";
	Выборка = Запрос.Выполнить().Выбрать();		

	Пока Выборка.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В документе ""%1"" не заполнена группа НУ у основного средства ""%2"".'"),
											Выборка.Ссылка, Выборка.ОсновноеСредство) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 1;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В документе ""%1"" не заполнена группа НУ у основного средства ""%2"".'"),
											Выборка.Ссылка, Выборка.ОсновноеСредство) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

// Проверяет наличие поступления (принятия) и сальдо на счете учета ОС.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаПоступленияИСальдоНаСчетеОС(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		// 1. Парные счета из 21хх и 29хх.
		// 2. Сальдо Дт по активным счетам из пункта 1.
		// 3. Сальдо Кт по пассивным счетам из пункта 1.
		// 4. Проверка наличия сальдо по пассивному счету с условием, что по парному активному счету сальдо нет.
		// 5. ОС поступившие, принятые или введенные с помощью док. "Ввод начальных остатков" (событие "Прочее"). 
		// 6. Проверка наличия ОС в 2 и 3 пунктах, которых нет в 5 пункте.
		// 7. Группировка 6 пункта.	
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка,
		|	Хозрасчетный.Вид КАК Вид,
		|	Хозрасчетный.ПарныйСчет КАК ПарныйСчет
		|ПОМЕСТИТЬ ВременнаяТаблицаСчета
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.ПарныйСчет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
		|	И (Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства))
		|			ИЛИ Хозрасчетный.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет КАК Счет,
		|	ХозрасчетныйОстатки.Субконто1 КАК ОсновноеСредство,
		|	ХозрасчетныйОстатки.СуммаОстатокДт КАК Сальдо
		|ПОМЕСТИТЬ ВременнаяТаблицаСальдоСчетовУчета
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			,
		|			Счет В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаСчета.Ссылка
		|				ИЗ
		|					ВременнаяТаблицаСчета
		|				ГДЕ
		|					ВременнаяТаблицаСчета.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)),
		|			,
		|			) КАК ХозрасчетныйОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет КАК Счет,
		|	ХозрасчетныйОстатки.Субконто1 КАК ОсновноеСредство,
		|	ХозрасчетныйОстатки.СуммаОстатокКт КАК Сальдо
		|ПОМЕСТИТЬ ВременнаяТаблицаСальдоСчетовАмортизации
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			,
		|			Счет В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаСчета.Ссылка
		|				ИЗ
		|					ВременнаяТаблицаСчета
		|				ГДЕ
		|					ВременнаяТаблицаСчета.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)),
		|			,
		|			) КАК ХозрасчетныйОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСальдоСчетовАмортизации.Счет КАК СчетАмортизации,
		|	ВременнаяТаблицаСальдоСчетовАмортизации.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаСчета.ПарныйСчет КАК СчетУчета
		|ИЗ
		|	ВременнаяТаблицаСальдоСчетовАмортизации КАК ВременнаяТаблицаСальдоСчетовАмортизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСчета КАК ВременнаяТаблицаСчета
		|		ПО ВременнаяТаблицаСальдоСчетовАмортизации.Счет = ВременнаяТаблицаСчета.Ссылка
		|ГДЕ
		|	НЕ ВременнаяТаблицаСальдоСчетовАмортизации.ОсновноеСредство В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаСальдоСчетовУчета.ОсновноеСредство
		|				ИЗ
		|					ВременнаяТаблицаСальдоСчетовУчета)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство
		|ПОМЕСТИТЬ ВременнаяТаблицаПринятыеОС
		|ИЗ
		|	РегистрСведений.СобытияОС.СрезПоследних(
		|			,
		|			Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Поступление)
		|				ИЛИ Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
		|				ИЛИ Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Прочее)) КАК СобытияОССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСальдоСчетовУчета.Счет КАК Счет,
		|	ВременнаяТаблицаСальдоСчетовУчета.ОсновноеСредство КАК ОсновноеСредство
		|ПОМЕСТИТЬ ВременнаяТаблицаОСБезДокументов
		|ИЗ
		|	ВременнаяТаблицаСальдоСчетовУчета КАК ВременнаяТаблицаСальдоСчетовУчета
		|ГДЕ
		|	НЕ ВременнаяТаблицаСальдоСчетовУчета.ОсновноеСредство В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаПринятыеОС.ОсновноеСредство
		|				ИЗ
		|					ВременнаяТаблицаПринятыеОС)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСальдоСчетовАмортизации.Счет,
		|	ВременнаяТаблицаСальдоСчетовАмортизации.ОсновноеСредство
		|ИЗ
		|	ВременнаяТаблицаСальдоСчетовАмортизации КАК ВременнаяТаблицаСальдоСчетовАмортизации
		|ГДЕ
		|	НЕ ВременнаяТаблицаСальдоСчетовАмортизации.ОсновноеСредство В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаПринятыеОС.ОсновноеСредство
		|				ИЗ
		|					ВременнаяТаблицаПринятыеОС)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВременнаяТаблицаОСБезДокументов.Счет) КАК Счет,
		|	ВременнаяТаблицаОСБезДокументов.ОсновноеСредство КАК ОсновноеСредство
		|ИЗ
		|	ВременнаяТаблицаОСБезДокументов КАК ВременнаяТаблицаОСБезДокументов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаОСБезДокументов.ОсновноеСредство";
	МассивРезультатов = Запрос.ВыполнитьПакет();		
	
	Выборка = МассивРезультатов[3].Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.ОсновноеСредство, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Основное средство (НМА) ""%1"" имеет сальдо на счете %2, но не имеет его на парном счете %3.'"),
											Выборка.ОсновноеСредство, Выборка.СчетАмортизации, Выборка.СчетУчета) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 1;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.ОсновноеСредство;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Основное средство (НМА) ""%1"" имеет сальдо на счете %2, но не имеет его на парном счете %3.'"),
											Выборка.ОсновноеСредство, Выборка.СчетАмортизации, Выборка.СчетУчета) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;	
			
	КонецЦикла;
	
	Выборка = МассивРезультатов[6].Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.ОсновноеСредство, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Основное средство (НМА) ""%1"" имеет сальдо на счете %2, но на данное основное средство (НМА) нет документа поступления или принятия к учету.'"),
											Выборка.ОсновноеСредство, Выборка.Счет) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 1;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.ОсновноеСредство;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Основное средство (НМА) ""%1"" имеет сальдо на счете %2, но на данное основное средство (НМА) нет документа поступления или принятия к учету.'"),
											Выборка.ОсновноеСредство, Выборка.Счет) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

// Проверяет указания количественного счета в шапке документа.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаУказанияКоличественногоСчетаВВводеНачальныхОстатков(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВводНачальныхОстатков.Ссылка КАК Ссылка,
		|	ВводНачальныхОстатков.СчетУчета КАК СчетУчета
		|ИЗ
		|	Документ.ВводНачальныхОстатков КАК ВводНачальныхОстатков
		|ГДЕ
		|	НЕ ВводНачальныхОстатков.СчетУчета.Количественный
		|	И ВводНачальныхОстатков.РазделУчета = ""Запасы""";
	Выборка = Запрос.Выполнить().Выбрать();		

	Пока Выборка.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В документе ""%1"" указан счет учета %2 с отключенным признаком ""Количественный"".'"),
											Выборка.Ссылка, Выборка.СчетУчета) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 2;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В документе ""%1"" указан счет учета %2 с отключенным признаком ""Количественный"".'"),
											Выборка.Ссылка, Выборка.СчетУчета) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

// Проверяет указания счета дохода в строке табличной части.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаСчетаОприходованияДокумента_ОприходованиеТоваров(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОприходованиеТоваровТовары.Ссылка КАК Ссылка,
		|	ОприходованиеТоваровТовары.СчетОприходования КАК СчетОприходования
		|ИЗ
		|	Документ.ОприходованиеТоваров.Товары КАК ОприходованиеТоваровТовары
		|ГДЕ
		|	НЕ ОприходованиеТоваровТовары.СчетОприходования В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Доходы))
		|	И НЕ ОприходованиеТоваровТовары.СчетОприходования В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыОтНеоперационнойДеятельности))";
	Выборка = Запрос.Выполнить().Выбрать();		

	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В документе ""%1"" в табличной части ""Товары"" указан счет оприходования ""%2"", который не является счетом дохода.'"),
											Выборка.Ссылка, Выборка.СчетОприходования) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 3;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В документе ""%1"" в табличной части ""Товары"" указан счет оприходования ""%2"", который не является счетом дохода.'"),
											Выборка.Ссылка, Выборка.СчетОприходования) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

// Проверяет являются ли документы "Ввод начальных остатков" первыми документами (по дате) в базе.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаВводаНачальныхОстатковНаПервенствоПоДате(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц; 
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
		|	ХозрасчетныйОбороты.ПериодСекунда КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаПериодыХозрасчетный
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(, , Авто, , , , , ) КАК ХозрасчетныйОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВременнаяТаблицаПериодыХозрасчетный.Период) КАК Период
		|ИЗ
		|	ВременнаяТаблицаПериодыХозрасчетный КАК ВременнаяТаблицаПериодыХозрасчетный
		|ГДЕ
		|	ВременнаяТаблицаПериодыХозрасчетный.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АвансыДоотгрузкаОбороты.Регистратор КАК Регистратор,
		|	АвансыДоотгрузкаОбороты.Период КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаПериодыАвансыДоотгрузка
		|ИЗ
		|	РегистрНакопления.АвансыДоотгрузка.Обороты(,,Регистратор) КАК АвансыДоотгрузкаОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВременнаяТаблицаПериодыАвансыДоотгрузка.Период) КАК Период
		|ИЗ
		|	ВременнаяТаблицаПериодыАвансыДоотгрузка КАК ВременнаяТаблицаПериодыАвансыДоотгрузка
		|ГДЕ
		|	ВременнаяТаблицаПериодыАвансыДоотгрузка.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалоговаяАмортизация.Регистратор КАК Регистратор,
		|	НалоговаяАмортизация.Регистратор.Дата КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаПериодыНалоговаяАмортизация
		|ИЗ
		|	РегистрСведений.НалоговаяАмортизация КАК НалоговаяАмортизация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВременнаяТаблицаПериодыНалоговаяАмортизация.Период) КАК Период
		|ИЗ
		|	ВременнаяТаблицаПериодыНалоговаяАмортизация КАК ВременнаяТаблицаПериодыНалоговаяАмортизация
		|ГДЕ
		|	ВременнаяТаблицаПериодыНалоговаяАмортизация.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков";
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[1].Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		Выборка.Следующий();
		Период = Выборка.Период;
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;              
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВременнаяТаблицаПериодыХозрасчетный.Регистратор КАК Регистратор
			|ИЗ
			|	ВременнаяТаблицаПериодыХозрасчетный КАК ВременнаяТаблицаПериодыХозрасчетный
			|ГДЕ
			|	ВременнаяТаблицаПериодыХозрасчетный.Период <= &Период
			|	И НЕ ВременнаяТаблицаПериодыХозрасчетный.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков";
		Запрос.УстановитьПараметр("Период", Период);
		Выборка = Запрос.Выполнить().Выбрать();		

		Пока Выборка.Следующий() Цикл	
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Регистратор, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Документ ""%1"" проведен раньше, чем самый поздний (от %2) документ ввода начальных остатков по регистру бухгалтерии.'"),
												Выборка.Регистратор, Период) + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 1;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Регистратор;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Документ ""%1"" проведен раньше, чем самый поздний (от %2) документ ввода начальных остатков по регистру бухгалтерии.'"),
												Выборка.Регистратор, Период) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Выборка = МассивРезультатов[3].Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		Выборка.Следующий();
		Период = Выборка.Период;
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;              
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВременнаяТаблицаПериодыАвансыДоотгрузка.Регистратор КАК Регистратор
			|ИЗ
			|	ВременнаяТаблицаПериодыАвансыДоотгрузка КАК ВременнаяТаблицаПериодыАвансыДоотгрузка
			|ГДЕ
			|	ВременнаяТаблицаПериодыАвансыДоотгрузка.Период <= &Период
			|	И НЕ ВременнаяТаблицаПериодыАвансыДоотгрузка.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков";
		Запрос.УстановитьПараметр("Период", Период);
		Выборка = Запрос.Выполнить().Выбрать();		

		Пока Выборка.Следующий() Цикл	
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Регистратор, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Документ ""%1"" проведен раньше, чем самый поздний (от %2) документ ввода начальных остатков по регистру накопления ""Авансы и доотгрузка"".'"),
												Выборка.Регистратор, Период) + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 1;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Регистратор;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Документ ""%1"" проведен раньше, чем самый поздний (от %2) документ ввода начальных остатков по регистру накопления ""Авансы и доотгрузка"".'"),
												Выборка.Регистратор, Период) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Выборка = МассивРезультатов[5].Выбрать();
	
	Если Выборка.Количество() <> 0 Тогда
		Выборка.Следующий();
		Период = Выборка.Период;
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;              
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВременнаяТаблицаПериодыНалоговаяАмортизация.Регистратор КАК Регистратор
			|ИЗ
			|	ВременнаяТаблицаПериодыНалоговаяАмортизация КАК ВременнаяТаблицаПериодыНалоговаяАмортизация
			|ГДЕ
			|	ВременнаяТаблицаПериодыНалоговаяАмортизация.Период <= &Период
			|	И НЕ ВременнаяТаблицаПериодыНалоговаяАмортизация.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков";
		Запрос.УстановитьПараметр("Период", Период);
		Выборка = Запрос.Выполнить().Выбрать();		

		Пока Выборка.Следующий() Цикл	
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Регистратор, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Документ ""%1"" проведен раньше, чем самый поздний (от %2) документ ввода начальных остатков по регистру сведений ""Налоговая амортизация"".'"),
												Выборка.Регистратор, Период) + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);	
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 1;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Регистратор;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Документ ""%1"" проведен раньше, чем самый поздний (от %2) документ ввода начальных остатков по регистру сведений ""Налоговая амортизация"".'"),
												Выборка.Регистратор, Период) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Проверяет наличие связи "Командировки" с "Начисление зарплаты по среднему заработку" при установленной насройке "По СЗП" в командировке.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаКомандировокПоСЗП(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Командировка.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Командировка КАК Командировка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплатыПоСреднемуЗаработку КАК НачислениеЗарплатыПоСреднемуЗаработку
		|		ПО Командировка.Ссылка = НачислениеЗарплатыПоСреднемуЗаработку.ДокументОснование
		|ГДЕ
		|	Командировка.ОплатаПоСреднемуЗаработку
		|	И НачислениеЗарплатыПоСреднемуЗаработку.Ссылка ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У документа %1 нет связанного документа ""Начисление зарплаты по среднему заработку"".'"),
											Выборка.Ссылка) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 2;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У документа %1 нет связанного документа ""Начисление зарплаты по среднему заработку"".'"),
											Выборка.Ссылка) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

// Проверяет признак страны "Участник ЕАЭС".
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаПризнакаСтраны_УчастникЕАЭС(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтраныМира.Ссылка КАК Ссылка,
		|	СтраныМира.Наименование КАК Наименование,
		|	СтраныМира.Код КАК Код,
		|	СтраныМира.УчастникЕАЭС КАК УчастникЕАЭС
		|ИЗ
		|	Справочник.СтраныМира КАК СтраныМира";
	Выборка = Запрос.Выполнить().Выбрать();		

	// КЫРГЫЗСТАН
	Кыргызстан = Справочники.СтраныМира.Киргизия;	
	Если НЕ Кыргызстан.УчастникЕАЭС Тогда
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Кыргызстан, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В элементе ""%1"" должен быть установлен признак ""Участник ЕАЭС"".'"),
											Кыргызстан.Наименование) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 1;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Кыргызстан;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В элементе ""%1"" должен быть установлен признак ""Участник ЕАЭС"".'"),
											Кыргызстан.Наименование) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;	
	КонецЕсли;
	
	// РОССИЯ
	Россия = Справочники.СтраныМира.Россия;
	Если НЕ Россия.УчастникЕАЭС Тогда
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Россия, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В элементе ""%1"" должен быть установлен признак ""Участник ЕАЭС"".'"),
											Россия.Наименование) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 1;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Россия;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В элементе ""%1"" должен быть установлен признак ""Участник ЕАЭС"".'"),
											Россия.Наименование) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
			  // КАЗАХСТАН			  БЕЛАРУСЬ			  	  АРМЕНИЯ
		Если (Выборка.Код = "398" ИЛИ Выборка.Код = "112" ИЛИ Выборка.Код = "051") И НЕ Выборка.УчастникЕАЭС Тогда

			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В элементе ""%1"" должен быть установлен признак ""Участник ЕАЭС"".'"),
												Выборка.Наименование) + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 1;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В элементе ""%1"" должен быть установлен признак ""Участник ЕАЭС"".'"),
												Выборка.Наименование) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
			КонецЕсли;
			
			                                 // КЫРГЫЗСТАН			 РОССИЯ                  КАЗАХСТАН			  	 БЕЛАРУСЬ			  	 АРМЕНИЯ
		ИначеЕсли Выборка.УчастникЕАЭС И НЕ (Выборка.Код = "417" ИЛИ Выборка.Код = "643" ИЛИ Выборка.Код = "398" ИЛИ Выборка.Код = "112" ИЛИ Выборка.Код = "051") Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В элементе ""%1"" НЕ должен быть установлен признак ""Участник ЕАЭС"".'"),
												Выборка.Наименование) + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 1;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В элементе ""%1"" НЕ должен быть установлен признак ""Участник ЕАЭС"".'"),
												Выборка.Наименование) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

// Проверяет признак страны контрагента.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаПризнакаСтраныКонтрагента(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтраныМира.Ссылка КАК Ссылка,
		|	СтраныМира.Наименование КАК Наименование,
		|	СтраныМира.Код КАК Код
		|ПОМЕСТИТЬ ВременнаяТаблицаСтраныМира
		|ИЗ
		|	Справочник.СтраныМира КАК СтраныМира
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Наименование КАК НаименованиеКонтрагента,
		|	Контрагенты.СтранаРезидентства КАК СтранаРезидентства,
		|	Контрагенты.ПризнакСтраны КАК ПризнакСтраны,
		|	ВременнаяТаблицаСтраныМира.Наименование КАК НаименованиеСтраны,
		|	ВременнаяТаблицаСтраныМира.Код КАК Код
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтраныМира КАК ВременнаяТаблицаСтраныМира
		|		ПО Контрагенты.СтранаРезидентства = ВременнаяТаблицаСтраныМира.Ссылка
		|ГДЕ
		|	НЕ Контрагенты.ЭтоГруппа";
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл
		
			 // КЫРГЫЗСТАН
		Если Выборка.Код = "417" Тогда

			Если Выборка.ПризнакСтраны <> Перечисления.ПризнакиСтраны.КР Тогда
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У контрагента ""%1"" с страной резидентства ""%2"" должен быть признак страны ""%3"".'"),
													Выборка.НаименованиеКонтрагента, Выборка.НаименованиеСтраны, Перечисления.ПризнакиСтраны.КР) + Символы.ПС;
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
				Иначе
					СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 2;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У контрагента ""%1"" с страной резидентства ""%2"" должен быть признак страны ""%3"".'"),
													Выборка.НаименованиеКонтрагента, Выборка.НаименованиеСтраны, Перечисления.ПризнакиСтраны.КР) + Символы.ПС;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
				КонецЕсли;
			
			КонецЕсли;	
				
			 	  // КАЗАХСТАН			  БЕЛАРУСЬ			  	  АРМЕНИЯ                 РОССИЯ
		ИначеЕсли Выборка.Код = "398" ИЛИ Выборка.Код = "112" ИЛИ Выборка.Код = "051" ИЛИ Выборка.Код = "643" Тогда
			
			Если Выборка.ПризнакСтраны <> Перечисления.ПризнакиСтраны.ЕАЭС Тогда
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У контрагента ""%1"" с страной резидентства ""%2"" должен быть признак страны ""%3"".'"),
													Выборка.НаименованиеКонтрагента, Выборка.НаименованиеСтраны, Перечисления.ПризнакиСтраны.ЕАЭС) + Символы.ПС;
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
				Иначе
					СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 2;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У контрагента ""%1"" с страной резидентства ""%2"" должен быть признак страны ""%3"".'"),
													Выборка.НаименованиеКонтрагента, Выборка.НаименованиеСтраны, Перечисления.ПризнакиСтраны.ЕАЭС) + Символы.ПС;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
				КонецЕсли;
			КонецЕсли;	
				
		ИначеЕсли ЗначениеЗаполнено(Выборка.СтранаРезидентства) Тогда
			
			Если Выборка.ПризнакСтраны <> Перечисления.ПризнакиСтраны.ИмпортЭкспорт Тогда
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У контрагента ""%1"" с страной резидентства ""%2"" должен быть признак страны ""%3"".'"),
													Выборка.НаименованиеКонтрагента, Выборка.НаименованиеСтраны, Перечисления.ПризнакиСтраны.ИмпортЭкспорт) + Символы.ПС;
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
				Иначе
					СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 2;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У контрагента ""%1"" с страной резидентства ""%2"" должен быть признак страны ""%3"".'"),
													Выборка.НаименованиеКонтрагента, Выборка.НаименованиеСтраны, Перечисления.ПризнакиСтраны.ИмпортЭкспорт) + Символы.ПС;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
				КонецЕсли;
			КонецЕсли;
				
		ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.СтранаРезидентства) Тогда
			
			Если Выборка.ПризнакСтраны <> Перечисления.ПризнакиСтраны.ПустаяСсылка() Тогда
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У контрагента ""%1"" не указана страна резидентства, поэтому признак страны тоже должен быть не указан.'"),
													Выборка.НаименованиеКонтрагента) + Символы.ПС;
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки); 
				Иначе
					СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 2;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У контрагента ""%1"" не указана страна резидентства, поэтому признак страны тоже должен быть не указан.'"),
													Выборка.НаименованиеКонтрагента) + Символы.ПС;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

// Проверяет наличие валюты и валютной суммы в проводке по валютному счету.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаЗаполненияВалютыИВалютнойСуммыПроводок(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Регистратор КАК Ссылка,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХозрасчетныйОбороты.Счет) КАК Счет,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХозрасчетныйОбороты.КорСчет) КАК КорСчет,
		|	СУММА(ХозрасчетныйОбороты.НомерСтроки) КАК НомерСтроки,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХозрасчетныйОбороты.Валюта) КАК Валюта,
		|	СУММА(ХозрасчетныйОбороты.ВалютнаяСуммаОборот) КАК ВалютнаяСуммаОборот,
		|	СУММА(ХозрасчетныйОбороты.СуммаОборот) КАК СуммаОборот
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(, , Авто, Счет.Валютный, , , , ) КАК ХозрасчетныйОбороты
		|ГДЕ
		|	(ХозрасчетныйОбороты.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ИЛИ ХозрасчетныйОбороты.ВалютнаяСуммаОборот = 0
		|				И (ХозрасчетныйОбороты.КорСчет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходыОтОперационныхКурсовыхРазниц)
		|					И ХозрасчетныйОбороты.КорСчет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиОтОперационныхКурсовыхРазниц)
		|					И ХозрасчетныйОбороты.КорСчет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходОтКурсовыхРазницПоОперациямВИностраннойВалюте)
		|					И ХозрасчетныйОбороты.КорСчет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.УбыткиОтКурсовыхРазницПоОперациямВИностраннойВалюте)))
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОбороты.Регистратор";
	Выборка = Запрос.Выполнить().Выбрать();		

	Пока Выборка.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Документ ""%1"" сформировал неверные проводки.'"),
												Выборка.Ссылка) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 1;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Документ ""%1"" сформировал неверные проводки.'"),
												Выборка.Ссылка) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

// Проверяет наличие валюты и валютной суммы в проводке по валютному счету.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаСальдоСчетов_1540_1549_3430(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет КАК Счет,
		|	ХозрасчетныйОстатки.Счет.Код КАК Код
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНаАвансы) ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению) ИЛИ Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСКОплате), , ) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСКОплате)
		|			ТОГДА (ХозрасчетныйОстатки.СуммаОстатокКт - ХозрасчетныйОстатки.СуммаОстатокДт) < 0
		|		ИНАЧЕ (ХозрасчетныйОстатки.СуммаОстатокДт - ХозрасчетныйОстатки.СуммаОстатокКт) < 0
		|	КОНЕЦ";
	Выборка = Запрос.Выполнить().Выбрать();		

	Пока Выборка.Следующий() Цикл 
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Счет, ПараметрыПроверки);
			
			Если Выборка.Счет = ПланыСчетов.Хозрасчетный.НДСКОплате Тогда
				Проблема.УточнениеПроблемы = НСтр("ru = 'Обнаружен отрицательный остаток по счету 3430.'") + Символы.ПС;
			Иначе
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Обнаружен отрицательный остаток по счету %1.'"),
													Выборка.Код) + Символы.ПС;
			КонецЕсли;
			
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 7;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Счет;
					
			Если Выборка.Счет = ПланыСчетов.Хозрасчетный.НДСКОплате Тогда
				СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'Обнаружен отрицательный остаток по счету 3430.'") + Символы.ПС;
			Иначе
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Обнаружен отрицательный остаток по счету %1.'"),
													Выборка.Код) + Символы.ПС;
			КонецЕсли;
			
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

// Проверяет измененные валюты по сравнению с классификатором.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаНаИзменениеВалютОтКлассификатора(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	КлассификаторВалют = Обработки.ЗагрузкаКурсовВалют.КлассификаторВалют();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(КлассификаторВалют.Code КАК Строка(3)) КАК Code,
	               |	ВЫРАЗИТЬ(КлассификаторВалют.CodeSymbol КАК Строка(10)) КАК CodeSymbol,
	               |	ВЫРАЗИТЬ(КлассификаторВалют.Name КАК Строка(50)) КАК Name,
	               |	КлассификаторВалют.Description КАК Description,
	               |	КлассификаторВалют.RBCLoading КАК RBCLoading,
	               |	КлассификаторВалют.NumerationItemOptions КАК NumerationItemOptions
	               |ПОМЕСТИТЬ КлассификаторВалют
	               |ИЗ
	               |	&КлассификаторВалют КАК КлассификаторВалют
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Валюты.Ссылка КАК Ссылка,
	               |	Валюты.Код КАК Код,
	               |	Валюты.Наименование КАК Наименование,
	               |	Валюты.НаименованиеПолное КАК НаименованиеПолное,
	               |	Валюты.ПараметрыПрописи КАК ПараметрыПрописи
	               |ПОМЕСТИТЬ Валюты
	               |ИЗ
	               |	Справочник.Валюты КАК Валюты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Валюты.Ссылка КАК Валюта,
	               |	Валюты.Код КАК Код,
	               |	Валюты.Наименование КАК Наименование,
	               |	ВЫБОР
	               |		КОГДА КлассификаторВалют.Code ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Модифицированность,
	               |	Валюты.НаименованиеПолное КАК НаименованиеПолное
	               |ИЗ
	               |	Валюты КАК Валюты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КлассификаторВалют КАК КлассификаторВалют
	               |		ПО Валюты.Код = КлассификаторВалют.Code
	               |			И Валюты.Наименование = КлассификаторВалют.CodeSymbol
	               |			И Валюты.НаименованиеПолное = КлассификаторВалют.Name";
	Запрос.УстановитьПараметр("КлассификаторВалют", КлассификаторВалют);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Модифицированность Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Валюта, ПараметрыПроверки);
				
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'По валюте %1 есть измененные реквизиты по сравнению с классификатором.'"),
					Выборка.Наименование) + Символы.ПС;
				
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 1;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Валюта;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'По валюте %1 есть измененные реквизиты по сравнению с классификатором.'"),
					Выборка.Наименование) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

// Проверяет владельца договора и контрагента указанных в проводках.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаСоответствияДоговоровПоКонтрагентам(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Регистратор КАК Документ,
		|	ХозрасчетныйОбороты.Субконто1 КАК Контрагент,
		|	ХозрасчетныйОбороты.Субконто2 КАК Договор,
		|	ХозрасчетныйОбороты.Счет КАК Счет,
		|	ХозрасчетныйОбороты.КорСчет КАК КорСчет
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(, , Авто, Счет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНаАвансы), &ВидыСубконто, , , ) КАК ХозрасчетныйОбороты";	
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Договор) Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Документ, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В документе %1 не указан договор для контрагента %2. Счет: %3 КорСчет: %4.'"),
													Выборка.Документ, Выборка.Контрагент, Выборка.Счет, Выборка.КорСчет) + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 2;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Документ;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В документе %1 не указан договор для контрагента %2. Счет: %3 КорСчет: %4.'"),
													Выборка.Документ, Выборка.Контрагент, Выборка.Счет, Выборка.КорСчет) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;					
			КонецЕсли;	
			
		ИначеЕсли Выборка.Договор.Владелец <> Выборка.Контрагент Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Документ, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В документе %1 указан договор %2 и контрагент %3, но владельцем договора является контрагент %4. Счет: %5 КорСчет: %6.'"),
													Выборка.Документ, Выборка.Договор, Выборка.Контрагент, Выборка.Договор.Владелец, Выборка.Счет, Выборка.КорСчет) + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 2;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Документ;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В документе %1 указан договор %2 и контрагент %3, но владельцем договора является контрагент %4. Счет: %5 КорСчет: %6.'"),
													Выборка.Документ, Выборка.Договор, Выборка.Контрагент, Выборка.Договор.Владелец, Выборка.Счет, Выборка.КорСчет) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;					
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

// Проверяет ИНН физических лиц.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаИННФизическихЛиц(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ФизическиеЛица.ИНН КАК ИНН,
		|	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
		|	ГражданствоФизическихЛицСрезПоследних.ФизЛицо КАК Ссылка
		|ИЗ
		|	РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(, Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.Киргизия)) КАК ГражданствоФизическихЛицСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО ГражданствоФизическихЛицСрезПоследних.ФизЛицо = ФизическиеЛица.Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();		

	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.ИНН) Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У физического лица %1 не заполнен ИНН.'"),
													Выборка.Ссылка) + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 3;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У физического лица %1 не заполнен ИНН.'"),
													Выборка.Ссылка) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
			КонецЕсли;	
			
		Иначе
			ПараметрыПроверкиИНН = БухгалтерскийУчетКлиентСервер.ШаблонПараметровПроверкиИНН();
			ПараметрыПроверкиИНН.ПроверитьИНН = Истина;
			ПараметрыПроверкиИНН.ИНН = Выборка.ИНН;
			ПараметрыПроверкиИНН.ДатаРождения = Выборка.ДатаРождения;
			СтруктураВозврата = БухгалтерскийУчетКлиентСервер.ПроверитьКорректностьИНН(ПараметрыПроверкиИНН);
			
			Если НЕ СтруктураВозврата.ИННВВеденКорректно Тогда
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Физическое лицо: %1. %2'"),
														Выборка.Ссылка, СтруктураВозврата.НадписьПоясненияНекорректногоИНН) + Символы.ПС;
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
				Иначе
					СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 3;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Физическое лицо: %1. %2'"),
														Выборка.Ссылка, СтруктураВозврата.НадписьПоясненияНекорректногоИНН) + Символы.ПС;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
				КонецЕсли;	
			КонецЕсли;
			
			ВыборкаДублей = Справочники.ФизическиеЛица.ПроверитьДублиИНН(СокрЛП(Выборка.ИНН), Выборка.Ссылка);
			
			Пока ВыборкаДублей.Следующий() Цикл
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'С таким ИНН %1 как у физического лица %2 есть другое физическое лицо %3'"),
														Выборка.ИНН, Выборка.Ссылка, ВыборкаДублей.Наименование) + Символы.ПС;
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);	
				Иначе
					СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 3;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'С таким ИНН %1 как у физического лица %2 есть другое физическое лицо %3'"),
														Выборка.ИНН, Выборка.Ссылка, ВыборкаДублей.Наименование) + Символы.ПС;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
				КонецЕсли;				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

// Проверяет номенклатуру с суммовым остатком, но без количественного остатка.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаСуммовыхОстатковПоНоменклатуреСНулевымКоличеством(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура"));	
	ВидыСубконто.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады"));
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1 КАК Номенклатура,
		|	ХозрасчетныйОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(, , &ВидыСубконто, ) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.СуммаОстаток <> 0
		|	И ХозрасчетныйОстатки.КоличествоОстаток = 0";
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	Выборка = Запрос.Выполнить().Выбрать();		

	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Номенклатура, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'По номенклатуре %1 есть суммовой остаток в размере %2, но нет количества.'"),
												Выборка.Номенклатура, Выборка.Сумма) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 4;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Номенклатура;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'По номенклатуре %1 есть суммовой остаток в размере %2, но нет количества.'"),
												Выборка.Номенклатура, Выборка.Сумма) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;					
		КонецЕсли;			
	КонецЦикла;	
КонецПроцедуры

// Проверяет заполнение валюты регламентированного учета.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаЗаполненияВалютыРегламентированногоУчета(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Если Константы.ВалютаРегламентированногоУчета.Получить() = Справочники.Валюты.ПустаяСсылка() Тогда
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Справочники.Валюты.ПустаяСсылка(), ПараметрыПроверки);
			Проблема.УточнениеПроблемы = НСтр("ru = 'Валюта регламентированного учета не заполнена.'") + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 2;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Справочники.Валюты.ПустаяСсылка();
			СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'Валюта регламентированного учета не заполнена.'") + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

// Проверяет равенство валютной и учетной сумм по валютным счетам где указана валюта KGS.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаВалютныхИУчетныхСумм(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	ВалютаKGS = Неопределено;
	
	ВалютаKGS = Справочники.Валюты.НайтиПоКоду(417);
	
	Если ВалютаKGS = Неопределено Тогда
		ВалютаKGS = Справочники.Валюты.НайтиПоНаименованию("KGS", Истина);	
	КонецЕсли;
	
	Если ВалютаKGS = Неопределено Тогда
		ВалютаKGS = Справочники.Валюты.НайтиПоРеквизиту("НаименованиеПолное", "Сом");	
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Счет
		|ПОМЕСТИТЬ ВременнаяТаблицаВалютныеСчета
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Валютный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Счет КАК Счет,
		|	ХозрасчетныйОбороты.КорСчет КАК КорСчет,
		|	ХозрасчетныйОбороты.Счет.Представление КАК ПредставлениеСчета,
		|	ХозрасчетныйОбороты.КорСчет.Представление КАК ПредставлениеКорСчета,
		|	ХозрасчетныйОбороты.Регистратор КАК Документ,
		|	ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаДт,
		|	ХозрасчетныйОбороты.ВалютнаяСуммаОборотДт КАК ВалютнаяСуммаДт,
		|	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаКт,
		|	ХозрасчетныйОбороты.ВалютнаяСуммаОборотКт КАК ВалютнаяСуммаКт,
		|	ХозрасчетныйОбороты.Счет.Валютный КАК СчетВалютный,
		|	ХозрасчетныйОбороты.КорСчет.Валютный КАК КорСчетВалютный
		|ПОМЕСТИТЬ ВременнаяТаблицаОбороты
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Счет В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаВалютныеСчета.Счет
		|				ИЗ
		|					ВременнаяТаблицаВалютныеСчета),
		|			,
		|			Валюта = &ВалютаKGS,
		|			,
		|			) КАК ХозрасчетныйОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаОбороты.Счет КАК Счет,
		|	ВременнаяТаблицаОбороты.ПредставлениеСчета КАК ПредставлениеСчета,
		|	ВременнаяТаблицаОбороты.Документ КАК Документ,
		|	ВременнаяТаблицаОбороты.СуммаДт КАК Сумма,
		|	ВременнаяТаблицаОбороты.ВалютнаяСуммаДт КАК ВалютнаяСумма
		|ИЗ
		|	ВременнаяТаблицаОбороты КАК ВременнаяТаблицаОбороты
		|ГДЕ
		|	ВременнаяТаблицаОбороты.СчетВалютный
		|	И ВременнаяТаблицаОбороты.СуммаДт <> ВременнаяТаблицаОбороты.ВалютнаяСуммаДт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаОбороты.Счет КАК Счет,
		|	ВременнаяТаблицаОбороты.ПредставлениеСчета КАК ПредставлениеСчета,
		|	ВременнаяТаблицаОбороты.Документ КАК Документ,
		|	ВременнаяТаблицаОбороты.СуммаКт КАК Сумма,
		|	ВременнаяТаблицаОбороты.ВалютнаяСуммаКт КАК ВалютнаяСумма
		|ИЗ
		|	ВременнаяТаблицаОбороты КАК ВременнаяТаблицаОбороты
		|ГДЕ
		|	ВременнаяТаблицаОбороты.КорСчетВалютный
		|	И ВременнаяТаблицаОбороты.СуммаКт <> ВременнаяТаблицаОбороты.ВалютнаяСуммаКт";
	Запрос.УстановитьПараметр("ВалютаKGS", ВалютаKGS);
	Выборка = Запрос.Выполнить().Выбрать();		

	Пока Выборка.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Документ, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У счета %1 учетная сумма %2 не равна валютной сумме %3.'"),
											Выборка.ПредставлениеСчета, Выборка.Сумма, Выборка.ВалютнаяСумма) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 8;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Документ;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У счета %1 учетная сумма %2 не равна валютной сумме %3.'"),
													Выборка.ПредставлениеСчета, Выборка.Сумма, Выборка.ВалютнаяСумма) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Проверяет валюту договора и валюту валютной суммы в проводке.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаВалютыДоговораИВалютыПроводки(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Счет
		|ПОМЕСТИТЬ ВременнаяТаблицаВалютныеСчета
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Валютный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
		|	ХозрасчетныйОбороты.Счет.Представление КАК ПредставлениеСчета,
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ДоговорыКонтрагентов).Представление КАК Договор,
		|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ДоговорыКонтрагентов).ВалютаРасчетов.Представление КАК ВалютаДоговора,
		|	ХозрасчетныйОбороты.Валюта.Представление КАК Валюта
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Счет В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаВалютныеСчета.Счет
		|				ИЗ
		|					ВременнаяТаблицаВалютныеСчета),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры),
		|			,
		|			,
		|			) КАК ХозрасчетныйОбороты
		|ГДЕ
		|	ХозрасчетныйОбороты.Валюта <> ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ДоговорыКонтрагентов).ВалютаРасчетов";
	Выборка = Запрос.Выполнить().Выбрать();		

	Пока Выборка.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Регистратор, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В проводке по счету %1 указан договор %2 с валютой %3, а у ваютной суммы указана валюта %4.'"),
											Выборка.ПредставлениеСчета, Выборка.Договор, Выборка.ВалютаДоговора, Выборка.Валюта) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 3;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Регистратор;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В проводке по счету %1 указан договор %2 с валютой %3, а у ваютной суммы указана валюта %4.'"),
											Выборка.ПредставлениеСчета, Выборка.Договор, Выборка.ВалютаДоговора, Выборка.Валюта) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Проверяет корректность указания пар счетов.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаКорректностиУказанияПарСчет(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Счет,
		|	Хозрасчетный.ПарныйСчет КАК ПарныйСчет,
		|	Хозрасчетный.Код КАК Код,
		|	Хозрасчетный.ПарныйСчет.Код КАК КодПарногоСчета
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.ПарныйСчет <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)";
	ТаблицаСчетов = Запрос.Выполнить().Выгрузить();		

	Для Каждого СтрокаТаблицы Из ТаблицаСчетов Цикл
		
		Если СтрокаТаблицы.Код >= "1000" И СтрокаТаблицы.Код <= "2999" Тогда
			
			НайденнаяСтрока = ТаблицаСчетов.Найти(СтрокаТаблицы.Счет, "ПарныйСчет");	
			
			Если НайденнаяСтрока = Неопределено Тогда
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(СтрокаТаблицы.Счет, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У счета %1 указан парный счет %2, но у счета %2 нет парного счета. Перезапишите счет %1.'"),
														СтрокаТаблицы.Код, СтрокаТаблицы.КодПарногоСчета) + Символы.ПС;
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);	
				Иначе
					СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 9;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = СтрокаТаблицы.Счет;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У счета %1 указан парный счет %2, но у счета %2 нет парного счета. Перезапишите счет %1.'"),
														СтрокаТаблицы.Код, СтрокаТаблицы.КодПарногоСчета) + Символы.ПС;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;				
	КонецЦикла;	
КонецПроцедуры

// Проверяет наличие вида начисления в методе расчета отпуска.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаВидаНачисленияВМетодеРасчетаОтпуска(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МетодыРасчетаОтпуска.Ссылка КАК Ссылка,
		|	МетодыРасчетаОтпуска.Представление КАК ПредставлениеМетода
		|ИЗ
		|	Справочник.МетодыРасчетаОтпуска КАК МетодыРасчетаОтпуска
		|ГДЕ
		|	МетодыРасчетаОтпуска.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНачислений.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();		

	Пока Выборка.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В методе расчета отпуска %1 не указан вид начисления отпуска.'"),
												Выборка.ПредставлениеМетода) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 4;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В методе расчета отпуска %1 не указан вид начисления отпуска.'"),
												Выборка.ПредставлениеМетода) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

// Проверяет пересечение вытесняющих видов расчета по месячно, по каждому сотруднику.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаПересеченияВытесняющихВидовРасчета(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыНачисленийВытесняющиеВидыРасчета.ВидРасчета КАК ВидРасчета
		|ПОМЕСТИТЬ ВременнаяТаблицаВытесняющиеВидыРасчета
		|ИЗ
		|	ПланВидовРасчета.ВидыНачислений.ВытесняющиеВидыРасчета КАК ВидыНачисленийВытесняющиеВидыРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.ФизЛицо КАК ФизЛицо,
		|	Начисления.ВидРасчета КАК ВидРасчета,
		|	Начисления.Регистратор КАК Регистратор,
		|	Начисления.ПериодРегистрации КАК ПериодРегистрации,
		|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец
		|ПОМЕСТИТЬ ВременнаяТаблицаОсновныеДанные
		|ИЗ
		|	РегистрРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.ВидРасчета В
		|			(ВЫБРАТЬ
		|				ВременнаяТаблицаВытесняющиеВидыРасчета.ВидРасчета
		|			ИЗ
		|				ВременнаяТаблицаВытесняющиеВидыРасчета)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаОсновныеДанные.ФизЛицо КАК ФизЛицо,
		|	ВременнаяТаблицаОсновныеДанные.ВидРасчета КАК ВидРасчета,
		|	ВременнаяТаблицаОсновныеДанные1.ВидРасчета КАК ВидРасчетаПересекающий,
		|	ВременнаяТаблицаОсновныеДанные.Регистратор КАК Регистратор,
		|	ВременнаяТаблицаОсновныеДанные1.Регистратор КАК РегистраторПересекающий,
		|	ВременнаяТаблицаОсновныеДанные.ПериодРегистрации КАК ПериодРегистрации
		|ИЗ
		|	ВременнаяТаблицаОсновныеДанные КАК ВременнаяТаблицаОсновныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОсновныеДанные КАК ВременнаяТаблицаОсновныеДанные1
		|		ПО ВременнаяТаблицаОсновныеДанные.ФизЛицо = ВременнаяТаблицаОсновныеДанные1.ФизЛицо
		|			И ВременнаяТаблицаОсновныеДанные.ПериодДействияНачало <> ВременнаяТаблицаОсновныеДанные1.ПериодДействияНачало
		|			И ВременнаяТаблицаОсновныеДанные.ПериодДействияКонец <> ВременнаяТаблицаОсновныеДанные1.ПериодДействияКонец
		|			И ВременнаяТаблицаОсновныеДанные.ПериодРегистрации = ВременнаяТаблицаОсновныеДанные1.ПериодРегистрации
		|			И (ВременнаяТаблицаОсновныеДанные.ПериодДействияНачало МЕЖДУ ВременнаяТаблицаОсновныеДанные1.ПериодДействияНачало И ВременнаяТаблицаОсновныеДанные1.ПериодДействияКонец
		|				ИЛИ ВременнаяТаблицаОсновныеДанные.ПериодДействияКонец МЕЖДУ ВременнаяТаблицаОсновныеДанные1.ПериодДействияНачало И ВременнаяТаблицаОсновныеДанные1.ПериодДействияКонец)";
	Выборка = Запрос.Выполнить().Выбрать();		

	МассивТиповДокументов = Новый Массив;
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.БольничныйЛист"));                                     
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.НачислениеЗарплаты")); 
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.НачислениеЗарплатыПоСреднемуЗаработку")); 
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.Неявка")); 
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.ОперацияБух"));	
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.Отпуск"));                                     
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.РаботаВВыходныеИПраздничныеДни")); 
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.РаботаСверхурочно")); 
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.ТрудовоеСоглашение"));
	МассивТиповДокументов.Добавить(Тип("ДокументСсылка.Увольнение"));
	
	ОписаниеТиповДокументов = Новый ОписаниеТипов(МассивТиповДокументов);
	
	КэшПроверок = Новый ТаблицаЗначений;
	КэшПроверок.Колонки.Добавить("ФизЛицо",        			Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	КэшПроверок.Колонки.Добавить("ВидРасчета",        		Новый ОписаниеТипов("ПланВидовРасчетаСсылка.ВидыНачислений"));
	КэшПроверок.Колонки.Добавить("ВидРасчетаПересекающий",  Новый ОписаниеТипов("ПланВидовРасчетаСсылка.ВидыНачислений"));
	КэшПроверок.Колонки.Добавить("Регистратор",        		ОписаниеТиповДокументов);
	КэшПроверок.Колонки.Добавить("РегистраторПересекающий", ОписаниеТиповДокументов);
	
	Отбор = Новый Структура();
	Отбор.Вставить("ФизЛицо", 					Неопределено);
	Отбор.Вставить("ВидРасчета", 			 	Неопределено);
	Отбор.Вставить("ВидРасчетаПересекающий", 	Неопределено);      
	Отбор.Вставить("Регистратор", 			 	Неопределено);
	Отбор.Вставить("РегистраторПересекающий", 	Неопределено);
	
	Пока Выборка.Следующий() Цикл
		Отбор.ФизЛицо 					= Выборка.ФизЛицо;
		Отбор.ВидРасчета 				= Выборка.ВидРасчетаПересекающий;
		Отбор.ВидРасчетаПересекающий 	= Выборка.ВидРасчета;
		Отбор.Регистратор 				= Выборка.РегистраторПересекающий;
		Отбор.РегистраторПересекающий 	= Выборка.Регистратор;
		
		Если КэшПроверок.НайтиСтроки(Отбор).Количество() = 0 Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.ФизЛицо, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'По сотруднику ""%1"" в месяце ""%2"" есть пересечение видов расчета ""%3"", из документа ""%4"", и ""%5"", из документа ""%6"".'"),
													Выборка.ФизЛицо, 
													Формат(Выборка.ПериодРегистрации, "ДФ='MMMM yyyy'"), 
													Выборка.ВидРасчета,
													Выборка.Регистратор,
													Выборка.ВидРасчетаПересекающий,
													Выборка.РегистраторПересекающий,) + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 1;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.ФизЛицо;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'По сотруднику ""%1"" в месяце ""%2"" есть пересечение видов расчета ""%3"", из документа ""%4"", и ""%5"", из документа ""%6"".'"),
													Выборка.ФизЛицо, 
													Формат(Выборка.ПериодРегистрации, "ДФ='MMMM yyyy'"), 
													Выборка.ВидРасчета,
													Выборка.Регистратор,
													Выборка.ВидРасчетаПересекающий,
													Выборка.РегистраторПересекающий,) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
			КонецЕсли;	
			
			СтрокаТаблицы = КэшПроверок.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
		КонецЕсли;			
	КонецЦикла;	
КонецПроцедуры

// Проверяет обороты по б/с и кассам, чтобы были только по одному счету чету.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаОборотовПоБанковскимСчетамИКассам(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.СчетДт КАК Счет,
		|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК БанкСчетКасса,
		|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВременнаяТаблицаОбороты
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, , Регистратор, , ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДенежныеСредства), , , ) КАК ХозрасчетныйОборотыДтКт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.СчетКт,
		|	ХозрасчетныйОборотыДтКт.СубконтоКт1,
		|	ХозрасчетныйОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, , Регистратор, , , , ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДенежныеСредства), ) КАК ХозрасчетныйОборотыДтКт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаОбороты.Счет КАК Счет,
		|	ВременнаяТаблицаОбороты.БанкСчетКасса КАК БанкСчетКасса,
		|	ВременнаяТаблицаОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВременнаяТаблицаИтоговыеДанные
		|ИЗ
		|	ВременнаяТаблицаОбороты КАК ВременнаяТаблицаОбороты
		|ГДЕ
		|	НЕ ВременнаяТаблицаОбороты.БанкСчетКасса = НЕОПРЕДЕЛЕНО
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаОбороты.Счет,
		|	ВременнаяТаблицаОбороты.БанкСчетКасса,
		|	ВременнаяТаблицаОбороты.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаИтоговыеДанные.Счет КАК Счет,
		|	ВременнаяТаблицаИтоговыеДанные.БанкСчетКасса КАК БанкСчетКасса,
		|	ВременнаяТаблицаИтоговыеДанные.Регистратор КАК Регистратор
		|ИЗ
		|	ВременнаяТаблицаИтоговыеДанные КАК ВременнаяТаблицаИтоговыеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаИтоговыеДанные КАК ВременнаяТаблицаИтоговыеДанные1
		|		ПО ВременнаяТаблицаИтоговыеДанные.БанкСчетКасса = ВременнаяТаблицаИтоговыеДанные1.БанкСчетКасса
		|			И (НЕ ВременнаяТаблицаИтоговыеДанные.Счет = ВременнаяТаблицаИтоговыеДанные1.Счет)
		|ИТОГИ ПО
		|	Регистратор,
		|	БанкСчетКасса";
	
	ПустыеЗначения = Новый Массив();
	ПустыеЗначения.Добавить(Справочники.БанковскиеСчета.ПустаяСсылка());
	ПустыеЗначения.Добавить(Справочники.Кассы.ПустаяСсылка());	
	Запрос.УстановитьПараметр("ПустыеЗначения", ПустыеЗначения);
	
	ВыборкаРегистратор = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		

	Пока ВыборкаРегистратор.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаРегистратор.Регистратор, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 2;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаРегистратор.Регистратор;	
		КонецЕсли;	
		
		ВыборкаБанкСчетКасса = ВыборкаРегистратор.Выбрать();
		
		Пока ВыборкаБанкСчетКасса.Следующий() Цикл
			ВыборкаДетальныеЗаписи = ВыборкаБанкСчетКасса.Выбрать();
			Счета = "";
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если Счета = "" Тогда
					Счета = Строка(ВыборкаДетальныеЗаписи.Счет);
				Иначе
					Счета = Счета + ", " + Строка(ВыборкаДетальныеЗаписи.Счет);	
				КонецЕсли;	
			КонецЦикла;
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда				
				Если ТипЗнч(ВыборкаБанкСчетКасса.БанкСчетКасса) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У банковского счета ""%1"" есть обороты по счетам учета %2.'"),
														ВыборкаБанкСчетКасса.БанкСчетКасса, Счета) + Символы.ПС;
				Иначе												
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У кассы ""%1"" есть обороты по счетам учета %2.'"),
														ВыборкаБанкСчетКасса.БанкСчетКасса, Счета) + Символы.ПС;	
				КонецЕсли;	
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
				
			Иначе
				Если ТипЗнч(ВыборкаБанкСчетКасса.БанкСчетКасса) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У банковского счета ""%1"" есть обороты по счетам учета %2.'"),
														ВыборкаБанкСчетКасса.БанкСчетКасса, Счета) + Символы.ПС;
				Иначе												
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У кассы ""%1"" есть обороты по счетам учета %2.'"),
														ВыборкаБанкСчетКасса.БанкСчетКасса, Счета) + Символы.ПС;	
				КонецЕсли;	
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры

// Проверяет при принятии к учету, что ликвидацонная стоимость меньше первоначальной.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаЛиквидационнойСтоимостиОСПриПринятии(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПараметрыУчетаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	ПараметрыУчетаОССрезПоследних.Регистратор КАК Регистратор,
		|	ПараметрыУчетаОССрезПоследних.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
		|	ПараметрыУчетаОССрезПоследних.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость
		|ИЗ
		|	РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
		|			,
		|			Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС
		|				ИЛИ Регистратор ССЫЛКА Документ.ВводНачальныхОстатков) КАК ПараметрыУчетаОССрезПоследних
		|ГДЕ
		|	ПараметрыУчетаОССрезПоследних.ЛиквидационнаяСтоимость >= ПараметрыУчетаОССрезПоследних.ПервоначальнаяСтоимость";	
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Регистратор, ПараметрыПроверки);
			
			Если Выборка.ЛиквидационнаяСтоимость = Выборка.ПервоначальнаяСтоимость Тогда
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У основного средства ""%1"" ликвидационная стоимость %2 равна первоначальной %3.'"),
											Выборка.ОсновноеСредство, Выборка.ЛиквидационнаяСтоимость, Выборка.ПервоначальнаяСтоимость) + Символы.ПС;	
			Иначе	
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У основного средства ""%1"" ликвидационная стоимость %2 больше, чем первоначальная %3.'"),
											Выборка.ОсновноеСредство, Выборка.ЛиквидационнаяСтоимость, Выборка.ПервоначальнаяСтоимость) + Символы.ПС;
			КонецЕсли;
			
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 2;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Регистратор;
			
			Если Выборка.ЛиквидационнаяСтоимость = Выборка.ПервоначальнаяСтоимость Тогда
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У основного средства ""%1"" ликвидационная стоимость %2 равна первоначальной %3.'"),
											Выборка.ОсновноеСредство, Выборка.ЛиквидационнаяСтоимость, Выборка.ПервоначальнаяСтоимость) + Символы.ПС;	
			Иначе	
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У основного средства ""%1"" ликвидационная стоимость %2 больше, чем первоначальная %3.'"),
											Выборка.ОсновноеСредство, Выборка.ЛиквидационнаяСтоимость, Выборка.ПервоначальнаяСтоимость) + Символы.ПС;
			КонецЕсли;
			
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

// Проверяет заполнение группы НИ для ОС.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаЗаполненияГруппыНИ_ОС(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетнаяПолитикаОрганизаций.Период КАК Период,
		|	УчетнаяПолитикаОрганизаций.Организация КАК Организация,
		|	УчетнаяПолитикаОрганизаций.ПлательщикНИ КАК ПлательщикНИ
		|ПОМЕСТИТЬ ВременнаяТаблицаУчетнаяПолитика
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыУчетаОССрезПоследних.Организация КАК Организация,
		|	ПараметрыУчетаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	ПараметрыУчетаОССрезПоследних.Регистратор КАК Регистратор,
		|	МАКСИМУМ(ВременнаяТаблицаУчетнаяПолитика.Период) КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаМаксПериод
		|ИЗ
		|	РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
		|			,
		|			СчетУчета В (&Счета)
		|				И НЕ ОсновноеСредство В
		|						(ВЫБРАТЬ
		|							СведенияОбИмуществе.ОсновноеСредство
		|						ИЗ
		|							РегистрСведений.СведенияОбИмуществе.СрезПоследних(, Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС
		|								ИЛИ Регистратор ССЫЛКА Документ.ВводНачальныхОстатков) КАК СведенияОбИмуществе
		|			
		|						ОБЪЕДИНИТЬ ВСЕ
		|			
		|						ВЫБРАТЬ
		|							СведенияОТранспорте.ОсновноеСредство
		|						ИЗ
		|							РегистрСведений.СведенияОТранспорте.СрезПоследних(, Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС
		|								ИЛИ Регистратор ССЫЛКА Документ.ВводНачальныхОстатков) КАК СведенияОТранспорте)
		|				И (Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС
		|					ИЛИ Регистратор ССЫЛКА Документ.ВводНачальныхОстатков)) КАК ПараметрыУчетаОССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО ПараметрыУчетаОССрезПоследних.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|			И ПараметрыУчетаОССрезПоследних.Период >= ВременнаяТаблицаУчетнаяПолитика.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ПараметрыУчетаОССрезПоследних.Организация,
		|	ПараметрыУчетаОССрезПоследних.ОсновноеСредство,
		|	ПараметрыУчетаОССрезПоследних.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаМаксПериод.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаМаксПериод.Регистратор КАК Регистратор
		|ИЗ
		|	ВременнаяТаблицаМаксПериод КАК ВременнаяТаблицаМаксПериод
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО ВременнаяТаблицаМаксПериод.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|			И ВременнаяТаблицаМаксПериод.Период = ВременнаяТаблицаУчетнаяПолитика.Период
		|			И ВременнаяТаблицаУчетнаяПолитика.ПлательщикНИ";
	
	Счета = Новый Массив();
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ЗданияСооружения);
	Счета.Добавить(ПланыСчетов.Хозрасчетный.ТранспортныеСредстваЖДТранспорта);
	
	Запрос.УстановитьПараметр("Счета", Счета);
	
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Регистратор, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У основного средства ""%1"" не заполнена группа НИ.'"), 
											Выборка.ОсновноеСредство) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 3;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Регистратор;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У основного средства ""%1"" не заполнена группа НИ.'"), 
											Выборка.ОсновноеСредство) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

// Проверяет наличие документ Ввод начальных остатков с видом операции "Налоговый учет".
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаДанныхПоНалоговомуУчетуОС(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетнаяПолитикаОрганизаций.Период КАК Период,
		|	УчетнаяПолитикаОрганизаций.Организация КАК Организация,
		|	УчетнаяПолитикаОрганизаций.ПлательщикНП КАК ПлательщикНП
		|ПОМЕСТИТЬ ВременнаяТаблицаУчетнаяПолитика
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалоговаяАмортизация.ОсновноеСредство КАК ОсновноеСредство,
		|	НалоговаяАмортизация.ГруппаНУ КАК ГруппаНУ,
		|	НалоговаяАмортизация.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВременнаяТаблицаНалоговаяАмортизация
		|ИЗ
		|	РегистрСведений.НалоговаяАмортизация КАК НалоговаяАмортизация
		|ГДЕ
		|	НалоговаяАмортизация.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыУчетаОССрезПоследних.Организация КАК Организация,
		|	ПараметрыУчетаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	ПараметрыУчетаОССрезПоследних.Регистратор КАК Регистратор,
		|	ПараметрыУчетаОССрезПоследних.ГруппаНУ КАК ГруппаНУ,
		|	НЕОПРЕДЕЛЕНО КАК ГруппаНУНалоговогоУчета,
		|	МАКСИМУМ(ВременнаяТаблицаУчетнаяПолитика.Период) КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаМаксПериод
		|ИЗ
		|	РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
		|			,
		|			НЕ ОсновноеСредство В
		|						(ВЫБРАТЬ
		|							ВременнаяТаблицаНалоговаяАмортизация.ОсновноеСредство
		|						ИЗ
		|							ВременнаяТаблицаНалоговаяАмортизация КАК ВременнаяТаблицаНалоговаяАмортизация)
		|				И Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
		|				И ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.Группа5)) КАК ПараметрыУчетаОССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО ПараметрыУчетаОССрезПоследних.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|			И ПараметрыУчетаОССрезПоследних.Период >= ВременнаяТаблицаУчетнаяПолитика.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ПараметрыУчетаОССрезПоследних.Организация,
		|	ПараметрыУчетаОССрезПоследних.ОсновноеСредство,
		|	ПараметрыУчетаОССрезПоследних.Регистратор,
		|	ПараметрыУчетаОССрезПоследних.ГруппаНУ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПараметрыУчетаОССрезПоследних.Организация,
		|	ПараметрыУчетаОССрезПоследних.ОсновноеСредство,
		|	ПараметрыУчетаОССрезПоследних.Регистратор,
		|	ПараметрыУчетаОССрезПоследних.ГруппаНУ,
		|	ЕСТЬNULL(ВременнаяТаблицаНалоговаяАмортизация.ГруппаНУ, НЕОПРЕДЕЛЕНО),
		|	МАКСИМУМ(ВременнаяТаблицаУчетнаяПолитика.Период)
		|ИЗ
		|	РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
		|			,
		|			Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
		|				И (ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.Группа1)
		|					ИЛИ ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.Группа2)
		|					ИЛИ ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.Группа3)
		|					ИЛИ ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.Группа4)
		|					ИЛИ ГруппаНУ = ЗНАЧЕНИЕ(Справочник.ГруппыНалоговогоУчетаОС.Группа6))) КАК ПараметрыУчетаОССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНалоговаяАмортизация КАК ВременнаяТаблицаНалоговаяАмортизация
		|		ПО ПараметрыУчетаОССрезПоследних.ГруппаНУ = ВременнаяТаблицаНалоговаяАмортизация.ГруппаНУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО ПараметрыУчетаОССрезПоследних.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|			И ПараметрыУчетаОССрезПоследних.Период >= ВременнаяТаблицаУчетнаяПолитика.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ПараметрыУчетаОССрезПоследних.Организация,
		|	ПараметрыУчетаОССрезПоследних.ОсновноеСредство,
		|	ПараметрыУчетаОССрезПоследних.Регистратор,
		|	ПараметрыУчетаОССрезПоследних.ГруппаНУ,
		|	ЕСТЬNULL(ВременнаяТаблицаНалоговаяАмортизация.ГруппаНУ, НЕОПРЕДЕЛЕНО)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаМаксПериод.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаМаксПериод.Регистратор КАК Регистратор,
		|	ВременнаяТаблицаМаксПериод.ГруппаНУ КАК ГруппаНУ,
		|	ВременнаяТаблицаМаксПериод.ГруппаНУНалоговогоУчета КАК ГруппаНУНалоговогоУчета
		|ИЗ
		|	ВременнаяТаблицаМаксПериод КАК ВременнаяТаблицаМаксПериод
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО ВременнаяТаблицаМаксПериод.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|			И ВременнаяТаблицаМаксПериод.Период = ВременнаяТаблицаУчетнаяПолитика.Период
		|			И (ВременнаяТаблицаУчетнаяПолитика.ПлательщикНП)";	
	Выборка = Запрос.Выполнить().Выбрать();		
	
	КэшГрупп = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ГруппаНУ = Справочники.ГруппыНалоговогоУчетаОС.Группа5 Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Регистратор, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У основного средства ""%1"" нет данных по налоговому учету.'"), 
												Выборка.ОсновноеСредство) + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 4;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Регистратор;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У основного средства ""%1"" нет данных по налоговому учету.'"), 
												Выборка.ОсновноеСредство) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
			КонецЕсли;	
			
		ИначеЕсли Выборка.ГруппаНУНалоговогоУчета = Неопределено
			И КэшГрупп.Найти(Выборка.ГруппаНУ) = Неопределено Тогда
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Регистратор, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'По группе НУ ""%1"" нет данных по налоговому учету.'"), 
												Выборка.ГруппаНУ) + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 4;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Регистратор;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'По группе НУ ""%1"" нет данных по налоговому учету.'"), 
												Выборка.ГруппаНУ) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
			КонецЕсли;	
			
			КэшГрупп.Добавить(Выборка.ГруппаНУ);
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

// Проверяет последовательность дат документов.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаХронологическойПоследовательностиДокументов(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
		|	ПоступлениеТоваровУслуг.Дата КАК Дата
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеРасходы.Ссылка КАК Ссылка,
		|	ДополнительныеРасходы.Дата КАК Дата,
		|	ДополнительныеРасходы.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.ДополнительныеРасходы КАК ДополнительныеРасходы
		|ГДЕ
		|	ДополнительныеРасходы.ДокументОснование ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГТДПоИмпортуТовары.Ссылка КАК Ссылка,
		|	ГТДПоИмпортуТовары.Ссылка.Дата КАК Дата,
		|	ГТДПоИмпортуТовары.ДокументПоступления КАК ДокументОснование
		|ИЗ
		|	Документ.ГТДПоИмпорту.Товары КАК ГТДПоИмпортуТовары
		|ГДЕ
		|	ГТДПоИмпортуТовары.ДокументПоступления ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГТДПоИмпортуОС.Ссылка,
		|	ГТДПоИмпортуОС.Ссылка.Дата,
		|	ГТДПоИмпортуОС.ДокументПоступления
		|ИЗ
		|	Документ.ГТДПоИмпорту.ОС КАК ГТДПоИмпортуОС
		|ГДЕ
		|	ГТДПоИмпортуОС.ДокументПоступления ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГТДПоИмпортуДопРасходы.Ссылка,
		|	ГТДПоИмпортуДопРасходы.Ссылка.Дата,
		|	ГТДПоИмпортуДопРасходы.ДокументДопРасходов
		|ИЗ
		|	Документ.ГТДПоИмпорту.ДопРасходы КАК ГТДПоИмпортуДопРасходы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.Ссылка КАК Ссылка,
		|	ВозвратТоваровПоставщику.Дата КАК Дата,
		|	ВозвратТоваровПоставщику.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Дата КАК Дата
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателя.Ссылка КАК Ссылка,
		|	ВозвратТоваровОтПокупателя.Дата КАК Дата,
		|	ВозвратТоваровОтПокупателя.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя";		
	Результаты = Запрос.ВыполнитьПакет();	
		
	ВыборкаПоступления 				= Результаты[0].Выбрать();
	ВыборкаДопРасходы 				= Результаты[1].Выбрать();
	ВыборкаГТДПоИмпорту 			= Результаты[2].Выбрать();
	ВыборкаВозвратыПоставщикам 		= Результаты[3].Выбрать();
	ВыборкаРеализации 				= Результаты[4].Выбрать();
	ВыборкаВозвратыОтПокупателей 	= Результаты[5].Выбрать();
	
	Отбор = Новый Структура();
	Отбор.Вставить("ДокументОснование", Неопределено);
	
	// Поступление - Доп. расходы - ГТД по импорту
	// Поступление - Возврат поставщику
	Пока ВыборкаПоступления.Следующий() Цикл		
		Отбор.ДокументОснование = ВыборкаПоступления.Ссылка;
		
		Пока ВыборкаДопРасходы.НайтиСледующий(Отбор) Цикл			
			Если ВыборкаДопРасходы.Дата < ВыборкаПоступления.Дата Тогда
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаДопРасходы.Ссылка, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Дата документа ""%1"" раньше, чем у его основания ""%2"".'"), 
													ВыборкаДопРасходы.Ссылка, ВыборкаПоступления.Ссылка) + Символы.ПС;
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
				Иначе
					СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 1;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаДопРасходы.Ссылка;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Дата документа ""%1"" раньше, чем у его основания ""%2"".'"), 
													ВыборкаДопРасходы.Ссылка, ВыборкаПоступления.Ссылка) + Символы.ПС;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;					
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		ВыборкаДопРасходы.Сбросить();
		
		Пока ВыборкаГТДПоИмпорту.НайтиСледующий(Отбор) Цикл			
			Если ВыборкаГТДПоИмпорту.Дата < ВыборкаПоступления.Дата Тогда
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаГТДПоИмпорту.Ссылка, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Дата документа ""%1"" раньше, чем у его основания ""%2"".'"), 
													ВыборкаГТДПоИмпорту.Ссылка, ВыборкаПоступления.Ссылка) + Символы.ПС;
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
				Иначе
					СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 1;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаГТДПоИмпорту.Ссылка;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Дата документа ""%1"" раньше, чем у его основания ""%2"".'"), 
													ВыборкаГТДПоИмпорту.Ссылка, ВыборкаПоступления.Ссылка) + Символы.ПС;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
				КонецЕсли;					
			КонецЕсли;	
		КонецЦикла;
		ВыборкаГТДПоИмпорту.Сбросить();
		
		Пока ВыборкаВозвратыПоставщикам.НайтиСледующий(Отбор) Цикл			
			Если ВыборкаВозвратыПоставщикам.Дата < ВыборкаПоступления.Дата Тогда
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаВозвратыПоставщикам.Ссылка, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Дата документа ""%1"" раньше, чем у его основания ""%2"".'"), 
													ВыборкаВозвратыПоставщикам.Ссылка, ВыборкаПоступления.Ссылка) + Символы.ПС;
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
				Иначе
					СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 1;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаВозвратыПоставщикам.Ссылка;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Дата документа ""%1"" раньше, чем у его основания ""%2"".'"), 
													ВыборкаВозвратыПоставщикам.Ссылка, ВыборкаПоступления.Ссылка) + Символы.ПС;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		ВыборкаВозвратыПоставщикам.Сбросить();
	КонецЦикла;
	
	// Доп. расходы - ГТД по импорту
	Пока ВыборкаДопРасходы.Следующий() Цикл		
		Отбор.ДокументОснование = ВыборкаДопРасходы.Ссылка;
				
		Пока ВыборкаГТДПоИмпорту.НайтиСледующий(Отбор) Цикл			
			Если ВыборкаГТДПоИмпорту.Дата < ВыборкаДопРасходы.Дата Тогда
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаГТДПоИмпорту.Ссылка, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Дата документа ""%1"" раньше, чем у его основания ""%2"".'"), 
													ВыборкаГТДПоИмпорту.Ссылка, ВыборкаДопРасходы.Ссылка) + Символы.ПС;
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);	
				Иначе
					СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 1;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаГТДПоИмпорту.Ссылка;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Дата документа ""%1"" раньше, чем у его основания ""%2"".'"), 
													ВыборкаГТДПоИмпорту.Ссылка, ВыборкаДопРасходы.Ссылка) + Символы.ПС;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		ВыборкаГТДПоИмпорту.Сбросить();
	КонецЦикла;
	
	// Реализаци - Возврат от покупателя
	Пока ВыборкаРеализации.Следующий() Цикл		
		Отбор.ДокументОснование = ВыборкаРеализации.Ссылка;
				
		Пока ВыборкаВозвратыОтПокупателей.НайтиСледующий(Отбор) Цикл			
			Если ВыборкаВозвратыОтПокупателей.Дата < ВыборкаРеализации.Дата Тогда
				
				Если ДанныеАвторскогоНадзора = Неопределено Тогда
					Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ВыборкаВозвратыОтПокупателей.Ссылка, ПараметрыПроверки);
					Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Дата документа ""%1"" раньше, чем у его основания ""%2"".'"), 
													ВыборкаВозвратыОтПокупателей.Ссылка, ВыборкаРеализации.Ссылка) + Символы.ПС;
					КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
				Иначе
					СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
					СтрокаТабличнойЧасти.НомерПроверки = 1;
					СтрокаТабличнойЧасти.ПроблемныйОбъект = ВыборкаВозвратыОтПокупателей.Ссылка;
					СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Дата документа ""%1"" раньше, чем у его основания ""%2"".'"), 
													ВыборкаВозвратыОтПокупателей.Ссылка, ВыборкаРеализации.Ссылка) + Символы.ПС;
															
					ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		ВыборкаВозвратыОтПокупателей.Сбросить();
	КонецЦикла;
КонецПроцедуры

// Проверяет заполнение ставки НСП в документах РТУ и Возвратах от покупателей.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаСтавкиНСПВРеализацияхИВозвратах(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетнаяПолитикаОрганизаций.Период КАК Период,
		|	УчетнаяПолитикаОрганизаций.Организация КАК Организация,
		|	УчетнаяПолитикаОрганизаций.ПлательщикНСП КАК ПлательщикНСП
		|ПОМЕСТИТЬ ВременнаяТаблицаУчетнаяПолитика
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация,
		|	МАКСИМУМ(ВременнаяТаблицаУчетнаяПолитика.Период) КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаМаксПериод
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО РеализацияТоваровУслугТовары.Ссылка.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|			И РеализацияТоваровУслугТовары.Ссылка.Дата >= ВременнаяТаблицаУчетнаяПолитика.Период
		|ГДЕ
		|	НЕ РеализацияТоваровУслугТовары.Ссылка.БезналичныйРасчет
		|	И РеализацияТоваровУслугТовары.СтавкаНСП = &ПустаяСтавкаНСП
		|	И РеализацияТоваровУслугТовары.Ссылка.Контрагент.ПризнакСтраны = &ПризнакСтраны
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	РеализацияТоваровУслугТовары.Ссылка.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугУслуги.Ссылка,
		|	РеализацияТоваровУслугУслуги.Ссылка.Организация,
		|	МАКСИМУМ(ВременнаяТаблицаУчетнаяПолитика.Период)
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО РеализацияТоваровУслугУслуги.Ссылка.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|			И РеализацияТоваровУслугУслуги.Ссылка.Дата >= ВременнаяТаблицаУчетнаяПолитика.Период
		|ГДЕ
		|	НЕ РеализацияТоваровУслугУслуги.Ссылка.БезналичныйРасчет
		|	И РеализацияТоваровУслугУслуги.СтавкаНСП = &ПустаяСтавкаНСП
		|	И РеализацияТоваровУслугУслуги.Ссылка.Контрагент.ПризнакСтраны = &ПризнакСтраны
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугУслуги.Ссылка,
		|	РеализацияТоваровУслугУслуги.Ссылка.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугОС.Ссылка,
		|	РеализацияТоваровУслугОС.Ссылка.Организация,
		|	МАКСИМУМ(ВременнаяТаблицаУчетнаяПолитика.Период)
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ОС КАК РеализацияТоваровУслугОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО РеализацияТоваровУслугОС.Ссылка.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|			И РеализацияТоваровУслугОС.Ссылка.Дата >= ВременнаяТаблицаУчетнаяПолитика.Период
		|ГДЕ
		|	НЕ РеализацияТоваровУслугОС.Ссылка.БезналичныйРасчет
		|	И РеализацияТоваровУслугОС.СтавкаНСП = &ПустаяСтавкаНСП
		|	И РеализацияТоваровУслугОС.Ссылка.Контрагент.ПризнакСтраны = &ПризнакСтраны
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугОС.Ссылка,
		|	РеализацияТоваровУслугОС.Ссылка.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателяТовары.Ссылка,
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.Организация,
		|	МАКСИМУМ(ВременнаяТаблицаУчетнаяПолитика.Период)
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|			И ВозвратТоваровОтПокупателяТовары.Ссылка.Дата >= ВременнаяТаблицаУчетнаяПолитика.Период
		|ГДЕ
		|	НЕ ВозвратТоваровОтПокупателяТовары.Ссылка.БезналичныйРасчет
		|	И ВозвратТоваровОтПокупателяТовары.СтавкаНСП = &ПустаяСтавкаНСП
		|	И ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент.ПризнакСтраны = &ПризнакСтраны
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратТоваровОтПокупателяТовары.Ссылка,
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателяУслуги.Ссылка,
		|	ВозвратТоваровОтПокупателяУслуги.Ссылка.Организация,
		|	МАКСИМУМ(ВременнаяТаблицаУчетнаяПолитика.Период)
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Услуги КАК ВозвратТоваровОтПокупателяУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО ВозвратТоваровОтПокупателяУслуги.Ссылка.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|			И ВозвратТоваровОтПокупателяУслуги.Ссылка.Дата >= ВременнаяТаблицаУчетнаяПолитика.Период
		|ГДЕ
		|	НЕ ВозвратТоваровОтПокупателяУслуги.Ссылка.БезналичныйРасчет
		|	И ВозвратТоваровОтПокупателяУслуги.СтавкаНСП = &ПустаяСтавкаНСП
		|	И ВозвратТоваровОтПокупателяУслуги.Ссылка.Контрагент.ПризнакСтраны = &ПризнакСтраны
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратТоваровОтПокупателяУслуги.Ссылка,
		|	ВозвратТоваровОтПокупателяУслуги.Ссылка.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателяОС.Ссылка,
		|	ВозвратТоваровОтПокупателяОС.Ссылка.Организация,
		|	МАКСИМУМ(ВременнаяТаблицаУчетнаяПолитика.Период)
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.ОС КАК ВозвратТоваровОтПокупателяОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО ВозвратТоваровОтПокупателяОС.Ссылка.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|			И ВозвратТоваровОтПокупателяОС.Ссылка.Дата >= ВременнаяТаблицаУчетнаяПолитика.Период
		|ГДЕ
		|	НЕ ВозвратТоваровОтПокупателяОС.Ссылка.БезналичныйРасчет
		|	И ВозвратТоваровОтПокупателяОС.СтавкаНСП = &ПустаяСтавкаНСП
		|	И ВозвратТоваровОтПокупателяОС.Ссылка.Контрагент.ПризнакСтраны = &ПризнакСтраны
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратТоваровОтПокупателяОС.Ссылка,
		|	ВозвратТоваровОтПокупателяОС.Ссылка.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблицаМаксПериод.Ссылка КАК Ссылка
		|ИЗ
		|	ВременнаяТаблицаМаксПериод КАК ВременнаяТаблицаМаксПериод
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаУчетнаяПолитика КАК ВременнаяТаблицаУчетнаяПолитика
		|		ПО ВременнаяТаблицаМаксПериод.Организация = ВременнаяТаблицаУчетнаяПолитика.Организация
		|			И ВременнаяТаблицаМаксПериод.Период = ВременнаяТаблицаУчетнаяПолитика.Период
		|			И (ВременнаяТаблицаУчетнаяПолитика.ПлательщикНСП)";
	Запрос.УстановитьПараметр("ПустаяСтавкаНСП", Справочники.СтавкиНСП.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПризнакСтраны", Перечисления.ПризнакиСтраны.КР);
	
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл	
			
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В документе ""%1"" не указаны ставки НСП.'"), 
											Выборка.Ссылка) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 3;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В документе ""%1"" не указаны ставки НСП.'"), 
											Выборка.Ссылка) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Проверяет заполнение ТНВЭД или ГКЭД.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаЗаполненияТНВЭДГКЭД(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Если НЕ Константы.ФункциональнаяОпцияЭСФ.Получить() Тогда
		Возврат;		
	КонецЕсли;	
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Услуга КАК Услуга
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	(Номенклатура.Услуга
		|				И Номенклатура.КодГКЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторГКЭД.ПустаяСсылка)
		|			ИЛИ НЕ Номенклатура.Услуга
		|				И Номенклатура.КодТНВЭД = ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка))";
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У номенклатуры ""%1"" не заполнен код %2.'"), 
											Выборка.Ссылка, ?(Выборка.Услуга, "ГКЭД", "ТНВЭД")) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 5;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У номенклатуры ""%1"" не заполнен код %2.'"), 
											Выборка.Ссылка, ?(Выборка.Услуга, "ГКЭД", "ТНВЭД")) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

// Проверяет подчинение счета.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаПодчинениеСчета(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Ссылка,
		|	Хозрасчетный.Родитель КАК Родитель,
		|	Хозрасчетный.Код КАК Код,
		|	Хозрасчетный.Родитель.Код КАК РодительКод
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	НЕ Хозрасчетный.Ссылка = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Вспомогательный)";
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл		
		Ошибка = Ложь;
		
		// у счета Х000 не должно быть родителя
		Если Сред(Выборка.Код, 2, 3) = "000" 
			И ЗначениеЗаполнено(Выборка.Родитель) Тогда
			Ошибка = Истина;	
		КонецЕсли;	
			
		// у счетов ХХ00 и далее должен быть родитель
		Если НЕ Сред(Выборка.Код, 3, 2) = "00" 
			И НЕ ЗначениеЗаполнено(Выборка.Родитель) Тогда
			Ошибка = Истина;	
		КонецЕсли;	
			
		// Х000, если сам счет имеет на конце ХХ00, где Х <> 0
		Если НЕ Сред(Выборка.Код, 1, 1) = "0"
			И НЕ Сред(Выборка.Код, 2, 1) = "0"
			И Сред(Выборка.Код, 3, 2) = "00"
			И НЕ Выборка.РодительКод = Лев(Выборка.Код, 1) + "000" Тогда
			Ошибка = Истина;
		КонецЕсли;
		
		// ХХ00, если сам счет имеет вид "ХХХZ", где Х <> 0, Z - любое
		Если НЕ Сред(Выборка.Код, 1, 1) = "0"
			И НЕ Сред(Выборка.Код, 2, 1) = "0"
			И НЕ Сред(Выборка.Код, 3, 1) = "0"
			И НЕ Выборка.РодительКод = Лев(Выборка.Код, 2) + "00"
			И НЕ Выборка.РодительКод = Лев(Выборка.Код, 3) + "0" Тогда
			Ошибка = Истина;
		КонецЕсли;
			
		Если Ошибка Тогда	
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Обнаружен счет %1 с неправильным подчинением счету %2.'"), 
												Выборка.Ссылка, Выборка.Родитель) + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
			Иначе
				СтрокаТабличнойЧасти =  ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 10;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Обнаружен счет %1 с неправильным подчинением счету %2.'"), 
												Выборка.Ссылка, Выборка.Родитель) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

// Проверяет остатки по уволенным сотрудникам.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаОстатковПоУволеннымСотрудникам(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиСрезПоследних.Организация КАК Организация,
		|	СотрудникиСрезПоследних.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВременнаяТаблицаУволенныеСотрудники
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних КАК СотрудникиСрезПоследних
		|ГДЕ
		|	СотрудникиСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаУволенныеСотрудники.ФизЛицо КАК ФизЛицо,
		|	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	ВременнаяТаблицаУволенныеСотрудники КАК ВременнаяТаблицаУволенныеСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НачисленнаяЗаработнаяПлата), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СотрудникиОрганизаций), ) КАК ХозрасчетныйОстатки
		|		ПО ВременнаяТаблицаУволенныеСотрудники.Организация = ХозрасчетныйОстатки.Организация
		|			И ВременнаяТаблицаУволенныеСотрудники.ФизЛицо = ХозрасчетныйОстатки.Субконто1";
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.ФизЛицо, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'У уволенного сотрудника есть остаток %2.'"), 
											Выборка.СуммаОстаток) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 2;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.ФизЛицо;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'У уволенного сотрудника есть остаток %2.'"), 
											Выборка.СуммаОстаток) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

// Проверяет указанный способ отражения зарплаты в документах.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаСпособаОтраженияЗарплаты(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СпособыОтраженияЗаработнойПлаты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВременнаяТаблицаПустыеСпособыОтраженияЗП
		|ИЗ
		|	Справочник.СпособыОтраженияЗаработнойПлаты КАК СпособыОтраженияЗаработнойПлаты
		|ГДЕ
		|	СпособыОтраженияЗаработнойПлаты.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	И СпособыОтраженияЗаработнойПлаты.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВидыНачислений.ПустаяСсылка)
		|	И СпособыОтраженияЗаработнойПлаты.СчетЗатрат = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
		|	И СпособыОтраженияЗаработнойПлаты.СчетЗатратСФ = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Начисления.Регистратор КАК Регистратор,
		|	ВременнаяТаблицаПустыеСпособыОтраженияЗП.Ссылка КАК СпособОтражения
		|ИЗ
		|	РегистрРасчета.Начисления КАК Начисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаПустыеСпособыОтраженияЗП КАК ВременнаяТаблицаПустыеСпособыОтраженияЗП
		|		ПО Начисления.СпособОтражения = ВременнаяТаблицаПустыеСпособыОтраженияЗП.Ссылка
		|ГДЕ
		|	(Начисления.Регистратор ССЫЛКА Документ.БольничныйЛист
		|			ИЛИ Начисления.Регистратор ССЫЛКА Документ.Отпуск
		|			ИЛИ Начисления.Регистратор ССЫЛКА Документ.НачислениеЗарплаты)
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СпособОтражения)
		|ПО
		|	Регистратор";
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
	
	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Регистратор, ПараметрыПроверки);
			
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
			ТекстПроблемы = НСтр("ru = 'В документе указаны незаполненные способы отражения зарплаты:'");
			ПервыйСпособОтражения = Истина;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ПервыйСпособОтражения Тогда
					ТекстПроблемы = СтрШаблон(НСтр("ru = '%1 %2'"), ТекстПроблемы, ВыборкаДетальныеЗаписи.СпособОтражения);
				Иначе
					ТекстПроблемы = СтрШаблон(НСтр("ru = '%1, %2'"), ТекстПроблемы, ВыборкаДетальныеЗаписи.СпособОтражения);	
				КонецЕсли;	
				
				ПервыйСпособОтражения = Ложь;
			КонецЦикла;	
			
			Проблема.УточнениеПроблемы = ТекстПроблемы + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 3;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Регистратор;
			
			ВыборкаДетальныеЗаписи = Выборка.Выбрать();
			ТекстПроблемы = НСтр("ru = 'В документе указаны незаполненные способы отражения зарплаты:'");
			ПервыйСпособОтражения = Истина;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ПервыйСпособОтражения Тогда
					ТекстПроблемы = СтрШаблон(НСтр("ru = '%1 %2'"), ТекстПроблемы, ВыборкаДетальныеЗаписи.СпособОтражения);
				Иначе
					ТекстПроблемы = СтрШаблон(НСтр("ru = '%1, %2'"), ТекстПроблемы, ВыборкаДетальныеЗаписи.СпособОтражения);	
				КонецЕсли;	
				
				ПервыйСпособОтражения = Ложь;
			КонецЦикла;
			
			СтрокаТабличнойЧасти.ОписаниеПроблемы = ТекстПроблемы + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

// Проверяет заполнения графиков работ.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаЗаполненияГрафиковРабот(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ГрафикиРаботы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВременнаяТаблицаГрафикиРабот
		|ИЗ
		|	Справочник.ГрафикиРаботы КАК ГрафикиРаботы
		|ГДЕ
		|	НЕ ГрафикиРаботы.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КалендариГрафиковРабот.ГрафикРаботы КАК ГрафикРаботы
		|ПОМЕСТИТЬ ВременнаяТаблицаКалендари
		|ИЗ
		|	РегистрСведений.КалендариГрафиковРабот КАК КалендариГрафиковРабот
		|ГДЕ
		|	КалендариГрафиковРабот.Год = &Год
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаГрафикиРабот.Ссылка КАК Ссылка
		|ИЗ
		|	ВременнаяТаблицаГрафикиРабот КАК ВременнаяТаблицаГрафикиРабот
		|ГДЕ
		|	НЕ ВременнаяТаблицаГрафикиРабот.Ссылка В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаКалендари.ГрафикРаботы
		|				ИЗ
		|					ВременнаяТаблицаКалендари)";
	Запрос.УстановитьПараметр("Год", Год(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = НСтр("ru = 'График работ не заполнен на текущий год.'") + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 4;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'График работ не заполнен на текущий год.'") + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Проверяет установку настройки "Зачет отработанного времени" в виде начисления.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаЗачетаОтработанногоВремениВВидеНачисления(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыНачислений.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовРасчета.ВидыНачислений КАК ВидыНачислений
		|ГДЕ
		|	НЕ ВидыНачислений.ЗачетОтработанногоВремени
		|	И (ВидыНачислений.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаНачислений.ПоМесячнойСтавкеПоДням)
		|			ИЛИ ВидыНачислений.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаНачислений.ПоДневнойСтавке)
		|			ИЛИ ВидыНачислений.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаНачислений.ПоМесячнойСтавкеПоЧасам)
		|			ИЛИ ВидыНачислений.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаНачислений.ПоЧасовойСтавке))";
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Ссылка, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = НСтр("ru = 'В виде начисления не установлена настройка ""Зачет отработанного времени"".'") + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 5;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Ссылка;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'В виде начисления не установлена настройка ""Зачет отработанного времени"".'") + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Проверяет ставки налогов в спр. "Статутсы" по определенным категориям.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаСтавокНалоговПоКатегории(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтавкиНалоговЗаработнойПлаты.Период КАК Период,
		|	СтавкиНалоговЗаработнойПлаты.Статус КАК Статус,
		|	СтавкиНалоговЗаработнойПлаты.Статус.Категория КАК Категория,
		|	СтавкиНалоговЗаработнойПлаты.СтавкаПФР КАК СтавкаПФР,
		|	СтавкиНалоговЗаработнойПлаты.СтавкаГНПФР КАК СтавкаГНПФР,
		|	СтавкиНалоговЗаработнойПлаты.СтавкаПН КАК СтавкаПН,
		|	СтавкиНалоговЗаработнойПлаты.Вычеты КАК Вычеты,
		|	СтавкиНалоговЗаработнойПлаты.СтавкаПФФ КАК СтавкаПФФ,
		|	СтавкиНалоговЗаработнойПлаты.СтавкаМСФ КАК СтавкаМСФ,
		|	СтавкиНалоговЗаработнойПлаты.СтавкаФОТФ КАК СтавкаФОТФ,
		|	СтавкиНалоговЗаработнойПлаты.НеВычитатьПФ КАК НеВычитатьПФ,
		|	СтавкиНалоговЗаработнойПлаты.СтавкаМСР КАК СтавкаМСР
		|ИЗ
		|	РегистрСведений.СтавкиНалоговЗаработнойПлаты КАК СтавкиНалоговЗаработнойПлаты
		|ГДЕ
		|	СтавкиНалоговЗаработнойПлаты.Статус.Категория В (&Категории)";
	
	Категории = Новый Массив();
	Категории.Добавить(Справочники.КатегорииСотрудников.Сотрудники);
	Категории.Добавить(Справочники.КатегорииСотрудников.СотрудникиДо64_69);
	Категории.Добавить(Справочники.КатегорииСотрудников.Пенсионеры);
	Категории.Добавить(Справочники.КатегорииСотрудников.ИностранныеГраждане);
	Категории.Добавить(Справочники.КатегорииСотрудников.ТрудовыеМигранты);
	Категории.Добавить(Справочники.КатегорииСотрудников.Инвалиды1_2гр);
	Категории.Добавить(Справочники.КатегорииСотрудников.ИнвалидыВОВ1_2гр);
	Категории.Добавить(Справочники.КатегорииСотрудников.ИнвалидыВОВ3гр);
	Категории.Добавить(Справочники.КатегорииСотрудников.МОП);
	Категории.Добавить(Справочники.КатегорииСотрудников.МОПДо64_69);
	Категории.Добавить(Справочники.КатегорииСотрудников.РаботающиеПенсионерыМОП);
	
	Запрос.УстановитьПараметр("Категории", Категории);
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл		
		Ошибка = Ложь;
		
		Если Выборка.Категория = Справочники.КатегорииСотрудников.Сотрудники Тогда //001			
			Если НЕ (Выборка.СтавкаПФР = 8 
				И Выборка.СтавкаГНПФР = 2
				И Выборка.СтавкаПН = 10
				И Выборка.Вычеты = 6.5
				И Выборка.СтавкаПФФ = 15
				И Выборка.СтавкаМСФ = 2
				И Выборка.СтавкаФОТФ = 0.25) Тогда
				Ошибка = Истина;	
			КонецЕсли;	
			
		ИначеЕсли Выборка.Категория = Справочники.КатегорииСотрудников.СотрудникиДо64_69 Тогда //001-64/69	
			Если НЕ (Выборка.СтавкаПФР = 10 
				И Выборка.СтавкаГНПФР = 0
				И Выборка.СтавкаПН = 10
				И Выборка.Вычеты = 6.5
				И Выборка.СтавкаПФФ = 15
				И Выборка.СтавкаМСФ = 2
				И Выборка.СтавкаФОТФ = 0.25) Тогда
				Ошибка = Истина;	
			КонецЕсли;
			
		ИначеЕсли Выборка.Категория = Справочники.КатегорииСотрудников.Пенсионеры Тогда //003
			Если НЕ (Выборка.СтавкаПФР = 8 
				И Выборка.СтавкаГНПФР = 0
				И Выборка.СтавкаПН = 10
				И Выборка.Вычеты = 6.5
				И Выборка.СтавкаПФФ = 15
				И Выборка.СтавкаМСФ = 2
				И Выборка.СтавкаФОТФ = 0.25) Тогда
				Ошибка = Истина;	
			КонецЕсли;
			
		ИначеЕсли Выборка.Категория = Справочники.КатегорииСотрудников.ИностранныеГраждане
			ИЛИ Выборка.Категория = Справочники.КатегорииСотрудников.ТрудовыеМигранты Тогда //010, 020
			Если НЕ (Выборка.СтавкаПФР = 0 
				И Выборка.СтавкаГНПФР = 0
				И Выборка.СтавкаПН = 10
				И Выборка.Вычеты = 0
				И Выборка.СтавкаПФФ = 3
				И Выборка.СтавкаМСФ = 0
				И Выборка.СтавкаФОТФ = 0) Тогда
				Ошибка = Истина;	
			КонецЕсли;
			
		ИначеЕсли Выборка.Категория = Справочники.КатегорииСотрудников.Инвалиды1_2гр Тогда //100
			Если НЕ (Выборка.СтавкаПФР = 8 
				И Выборка.СтавкаГНПФР = 2
				И Выборка.СтавкаПН = 10
				И Выборка.Вычеты = 6.5
				И Выборка.СтавкаПФФ = 15
				И Выборка.СтавкаМСФ = 2
				И Выборка.СтавкаФОТФ = 0.25) Тогда
				Ошибка = Истина;	
			КонецЕсли;
			
		ИначеЕсли Выборка.Категория = Справочники.КатегорииСотрудников.ИнвалидыВОВ1_2гр Тогда //101
			Если НЕ (Выборка.СтавкаПФР = 2 
				И Выборка.СтавкаГНПФР = 0
				И Выборка.СтавкаПН = 0
				И Выборка.Вычеты = 0
				И Выборка.СтавкаПФФ = 15
				И Выборка.СтавкаМСФ = 0
				И Выборка.СтавкаФОТФ = 0) Тогда
				Ошибка = Истина;	
			КонецЕсли;
			
		ИначеЕсли Выборка.Категория = Справочники.КатегорииСотрудников.ИнвалидыВОВ3гр Тогда //102
			Если НЕ (Выборка.СтавкаПФР = 0 
				И Выборка.СтавкаГНПФР = 0
				И Выборка.СтавкаПН = 0
				И Выборка.Вычеты = 0
				И Выборка.СтавкаПФФ = 15
				И Выборка.СтавкаМСФ = 2
				И Выборка.СтавкаФОТФ = 0.25) Тогда
				Ошибка = Истина;	
			КонецЕсли;
			
		ИначеЕсли Выборка.Категория = Справочники.КатегорииСотрудников.МОП Тогда //106
			Если НЕ (Выборка.СтавкаПФР = 8 
				И Выборка.СтавкаГНПФР = 2
				И Выборка.СтавкаПН = 10
				И Выборка.Вычеты = 6.5
				И Выборка.СтавкаПФФ = 15
				И Выборка.СтавкаМСФ = 2
				И Выборка.СтавкаФОТФ = 0.25) Тогда
				Ошибка = Истина;	
			КонецЕсли;
			
		ИначеЕсли Выборка.Категория = Справочники.КатегорииСотрудников.МОПДо64_69 Тогда //106-64/69
			Если НЕ (Выборка.СтавкаПФР = 10 
				И Выборка.СтавкаГНПФР = 0
				И Выборка.СтавкаПН = 10
				И Выборка.Вычеты = 6.5
				И Выборка.СтавкаПФФ = 15
				И Выборка.СтавкаМСФ = 2
				И Выборка.СтавкаФОТФ = 0.25) Тогда
				Ошибка = Истина;	
			КонецЕсли;
			
		ИначеЕсли Выборка.Категория = Справочники.КатегорииСотрудников.РаботающиеПенсионерыМОП Тогда //107	
			Если НЕ (Выборка.СтавкаПФР = 8 
				И Выборка.СтавкаГНПФР = 0
				И Выборка.СтавкаПН = 10
				И Выборка.Вычеты = 6.5
				И Выборка.СтавкаПФФ = 15
				И Выборка.СтавкаМСФ = 2
				И Выборка.СтавкаФОТФ = 0.25) Тогда
				Ошибка = Истина;	
			КонецЕсли;	
		КонецЕсли;	
		
		Если Ошибка Тогда 
			
			Если ДанныеАвторскогоНадзора = Неопределено Тогда
				Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Статус, ПараметрыПроверки);
				Проблема.УточнениеПроблемы = НСтр("ru = 'В статусе не правильно указаны ставки налогов.'") + Символы.ПС;
				КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);	
			Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 6;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Статус;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'В статусе не правильно указаны ставки налогов.'") + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

// Проверяет настройку "Расчет ПН без накопления" в учетной политике по персоналу.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаРачетаПНБезНакопления(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетнаяПолитикаПоПерсоналу.Период КАК Период,
		|	УчетнаяПолитикаПоПерсоналу.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаПоПерсоналу КАК УчетнаяПолитикаПоПерсоналу
		|ГДЕ
		|	НЕ УчетнаяПолитикаПоПерсоналу.РасчетПНБезНакопления";
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл		
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Организация, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В учетной политике, по указанной организации, за период %1 не включена настройка ""Расчет ПН без накопления"".'"),
											Формат(Выборка.Период, "ДФ=dd.MM.yyyy")) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
				СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
				СтрокаТабличнойЧасти.НомерПроверки = 7;
				СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Организация;
				СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В учетной политике, по указанной организации, за период %1 не включена настройка ""Расчет ПН без накопления"".'"),
											Формат(Выборка.Период, "ДФ=dd.MM.yyyy")) + Символы.ПС;
														
				ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
			КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Проверяет наличие счетов налогов в документах "Операции введенныеВручную.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаСчетовНалоговВОперацияхВведеныхВручную(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ХозрасчетныйОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(, , Регистратор, Счет В (&СчетаНалогов), , , , ) КАК ХозрасчетныйОбороты
		|ГДЕ
		|	ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ОперацияБух";
	СчетаНалогов = Новый Массив();
	СчетаНалогов.Добавить(ПланыСчетов.Хозрасчетный.НалогНаПрибыль);
	СчетаНалогов.Добавить(ПланыСчетов.Хозрасчетный.ПодоходныйНалогНаДоходыСотрудников);
	СчетаНалогов.Добавить(ПланыСчетов.Хозрасчетный.НДСКОплате);
	СчетаНалогов.Добавить(ПланыСчетов.Хозрасчетный.Акцизы);
	СчетаНалогов.Добавить(ПланыСчетов.Хозрасчетный.ЗемельныйНалог);
	СчетаНалогов.Добавить(ПланыСчетов.Хозрасчетный.НалогСПродаж);
	СчетаНалогов.Добавить(ПланыСчетов.Хозрасчетный.СборНаВывозМусора);
	СчетаНалогов.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеНалоги);
	СчетаНалогов.Добавить(ПланыСчетов.Хозрасчетный.НалогНаИмущество);
	СчетаНалогов.Добавить(ПланыСчетов.Хозрасчетный.НалогНаТранспортныеСредства);
	
	Запрос.УстановитьПараметр("СчетаНалогов", СчетаНалогов);
	
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Регистратор, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = НСтр("ru = 'В документе ""Операции введенные вручную"" использованы счета по налогам.'") + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 2;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Регистратор;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'В документе ""Операции введенные вручную"" использованы счета по налогам.'") + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

// Проверяет актуальность курсов валют (наличие курсов по валютам на текущую дату).
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаАктуальностиКурсовВалют(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Валюта
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
		|		ПО КурсыВалютСрезПоследних.Валюта = Валюты.Ссылка
		|ГДЕ
		|	НЕ Валюты.ПометкаУдаления
		|	И НЕ ЕСТЬNULL(КурсыВалютСрезПоследних.Период, ДАТАВРЕМЯ(1,1,1)) = &ТекущаяДата
		|	И НЕ Валюты.Ссылка = &ВалютаРегламентированногоУчета";
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));	
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Валюта, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Для валюты %1 устарел курс.'"), Выборка.Валюта) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 4;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Валюта;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'Для валюты %1 устарел курс.'"), Выборка.Валюта) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Проверяет что валютная и сомовая суммы не равны.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаВалютнойИСомовойСуммы(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВременнаяТаблицаДокументы
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, , Регистратор, СчетДт.Валютный, , , , НЕ ВалютаДт = &ВалютаРегламентированногоУчета) КАК ХозрасчетныйОборотыДтКт
		|ГДЕ
		|	ХозрасчетныйОборотыДтКт.СуммаОборот = ХозрасчетныйОборотыДтКт.ВалютнаяСуммаОборотДт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, , Регистратор, , , СчетКт.Валютный, , НЕ ВалютаКт = &ВалютаРегламентированногоУчета) КАК ХозрасчетныйОборотыДтКт
		|ГДЕ
		|	ХозрасчетныйОборотыДтКт.СуммаОборот = ХозрасчетныйОборотыДтКт.ВалютнаяСуммаОборотКт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблицаДокументы.Регистратор КАК Регистратор
		|ИЗ
		|	ВременнаяТаблицаДокументы КАК ВременнаяТаблицаДокументы";
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Регистратор, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'В проводках документа %1 валютная сумма равна сомовой.'"), 
											Выборка.Регистратор) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 5;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Регистратор;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'В проводках документа %1 валютная сумма равна сомовой.'"), 
											Выборка.Регистратор) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Проверяет наличие отрицательных остатков по счетам денежных средств.
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаОтрицательныхОстатковДенежныхСредств(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет КАК Счет,
		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(,, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДенежныеСредства)) КАК ХозрасчетныйОстатки
		|ГДЕ
		|	ХозрасчетныйОстатки.СуммаОстаток < 0";	
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Счет, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'По счету %1 и кассе(банковскому счету) ""%2"" отрицательный остаток в размере %3.'"), 
											Выборка.Счет, Выборка.Субконто1, Выборка.СуммаОстаток) + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 3;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Счет;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = СтрШаблон(НСтр("ru = 'По счету %1 и кассе(банковскому счету) ""%2"" отрицательный остаток в размере %3.'"), 
											Выборка.Счет, Выборка.Субконто1, Выборка.СуммаОстаток) + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

// Проверяет счетов денежных средств без указания субконто в док. "Операции введенные вручную".
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаСчетовДСВОперацияхВведенныхВручную(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВременнаяТаблицаДокументы
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, , Регистратор, , &ВидыСубконто, , , ) КАК ХозрасчетныйОборотыДтКт
		|ГДЕ
		|	ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ОперацияБух
		|	И (ХозрасчетныйОборотыДтКт.СубконтоДт1 = НЕОПРЕДЕЛЕНО
		|	ИЛИ ХозрасчетныйОборотыДтКт.СубконтоДт2 = &ПустаяСтатья)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.Регистратор
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, , Регистратор, , , , &ВидыСубконто, ) КАК ХозрасчетныйОборотыДтКт
		|ГДЕ
		|	ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ОперацияБух
		|	И (ХозрасчетныйОборотыДтКт.СубконтоКт1 = НЕОПРЕДЕЛЕНО
		|	ИЛИ ХозрасчетныйОборотыДтКт.СубконтоКт2 = &ПустаяСтатья)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблицаДокументы.Регистратор КАК Регистратор
		|ИЗ
		|	ВременнаяТаблицаДокументы КАК ВременнаяТаблицаДокументы";
	ВидыСубконто = Новый Массив();
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДенежныеСредства);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиДвиженияДенежныхСредств);
	
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("ПустаяСтатья", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();		
	
	Пока Выборка.Следующий() Цикл	
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(Выборка.Регистратор, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = НСтр("ru = 'В документе использованы счета учета денежных средств без указания субконто.'") + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 4;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = Выборка.Регистратор;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'В документе использованы счета учета денежных средств без указания субконто.'") + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

// Проверяет субконто у счетов 1ххх-4ххх в док. "Операции введенные вручную".
//
// Параметры:
//   Проверка          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на правило проверки, которая выполнялась.
//   ПараметрыПроверки - Структура - Сформированная алгоритмом проверки структура проблемы.
//      * Идентификатор                     - Строка - Строковый идентификатор проверки.
//      * Представление                     - Строка - Пользовательское представление проверки.
//      * ИдентификаторРегламентногоЗадания - Строка - Строковый идентификатор регламентного задания,
//                                            соответствующего проверке.
//      * ДатаНачалаПроверки                - Дата - Пороговая дата, обозначающая границу проверяемых
//                                            объектов (только для объектов с датой). Объекты, дата которых
//                                            меньше указанной, не следует проверять. По умолчанию не 
//                                            заполнено (т.е. проверять все).
//      * ЛимитПроблем                      - Число - Количество проверяемых объектов.
//                                            По умолчанию 1000. Если указано 0, то следует проверить все объекты.
//      * ИтерацияПроверки                  - Число - Очередная итерация проверки. Используется совместно с параметром
//                                            ЛимитПроблем для определения предельного количества итераций.
//      * Проверка                          - СправочникСсылка.ПравилаПроверкиУчета - Ссылка на
//                                            выполненную проверку.
//      * ВидПроверки                       - СправочникСсылка.ВидыПроверок - Ссылка на вид проверки, к
//                                            которому относится выполненная проверка.
//      * ВажностьПроблемы                  - ПеречислениеСсылка.ВажностьПроблемыУчета - Важность проблемы учета
//                                            "Информация", "Предупреждение", "Ошибка" и "ПолезныйСовет".
//
Процедура ПроверкаУказанияСубконтоПоСчетам1ххх_4ххх(Проверка, ПараметрыПроверки, ДанныеАвторскогоНадзора = Неопределено) Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор,
		|	ХозрасчетныйОборотыДтКт.СчетДт КАК Счет,
		|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК Субконто1,
		|	ХозрасчетныйОборотыДтКт.СубконтоДт2 КАК Субконто2,
		|	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК Субконто3
		|ПОМЕСТИТЬ ВременнаяТаблицаДокументы
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|			,
		|			,
		|			Регистратор,
		|			ПОДСТРОКА(СчетДт.Код, 0, 1) = ""1""
		|				ИЛИ ПОДСТРОКА(СчетДт.Код, 0, 1) = ""2""
		|				ИЛИ ПОДСТРОКА(СчетДт.Код, 0, 1) = ""3""
		|				ИЛИ ПОДСТРОКА(СчетДт.Код, 0, 1) = ""4"",
		|			,
		|			,
		|			,
		|			) КАК ХозрасчетныйОборотыДтКт
		|ГДЕ
		|	ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ОперацияБух
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.Регистратор,
		|	ХозрасчетныйОборотыДтКт.СчетКт,
		|	ХозрасчетныйОборотыДтКт.СубконтоКт1,
		|	ХозрасчетныйОборотыДтКт.СубконтоКт2,
		|	ХозрасчетныйОборотыДтКт.СубконтоКт3
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
		|			,
		|			,
		|			Регистратор,
		|			,
		|			,
		|			ПОДСТРОКА(СчетКт.Код, 0, 1) = ""1""
		|				ИЛИ ПОДСТРОКА(СчетКт.Код, 0, 1) = ""2""
		|				ИЛИ ПОДСТРОКА(СчетКт.Код, 0, 1) = ""3""
		|				ИЛИ ПОДСТРОКА(СчетКт.Код, 0, 1) = ""4"",
		|			,
		|			) КАК ХозрасчетныйОборотыДтКт
		|ГДЕ
		|	ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ОперацияБух
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВременнаяТаблицаДокументы.Регистратор КАК Регистратор,
		|	ВременнаяТаблицаДокументы.Счет КАК Счет,
		|	ВременнаяТаблицаДокументы.Субконто1 КАК Субконто1,
		|	ВременнаяТаблицаДокументы.Субконто2 КАК Субконто2,
		|	ВременнаяТаблицаДокументы.Субконто3 КАК Субконто3
		|ИЗ
		|	ВременнаяТаблицаДокументы КАК ВременнаяТаблицаДокументы";	
	Выборка = Запрос.Выполнить().Выбрать();		
	
	ДокументыСОшибками = Новый Массив();
	КэшСчета = Новый Соответствие();
	
	Пока Выборка.Следующий() Цикл
		
		КоличествоСубконто = КэшСчета.Получить(Выборка.Счет);
		
		Если КоличествоСубконто = Неопределено Тогда
			КоличествоСубконто = Выборка.Счет.ВидыСубконто.Количество();
			КэшСчета.Вставить(Выборка.Счет, КоличествоСубконто);			
		КонецЕсли;	
		
		Ошибка = Ложь;
		
		Если КоличествоСубконто > 0 И НЕ ЗначениеЗаполнено(Выборка.Субконто1) Тогда
			Ошибка = Истина;	
		КонецЕсли;
		
		Если КоличествоСубконто > 1 И НЕ ЗначениеЗаполнено(Выборка.Субконто2) Тогда
			Ошибка = Истина;	
		КонецЕсли;
		
		Если КоличествоСубконто > 2 И НЕ ЗначениеЗаполнено(Выборка.Субконто3) Тогда
			Ошибка = Истина;	
		КонецЕсли;
		
		Если Ошибка И ДокументыСОшибками.Найти(Выборка.Регистратор) = Неопределено Тогда
			ДокументыСОшибками.Добавить(Выборка.Регистратор);
		КонецЕсли;				
	КонецЦикла;
	
	Для Каждого ДокументСОшибкой Из ДокументыСОшибками Цикл
		
		Если ДанныеАвторскогоНадзора = Неопределено Тогда
			Проблема = КонтрольВеденияУчетаСлужебный.ОписаниеПроблемы(ДокументСОшибкой, ПараметрыПроверки);
			Проблема.УточнениеПроблемы = НСтр("ru = 'В документе указаны счета без заполнения субконто.'") + Символы.ПС;
			КонтрольВеденияУчетаСлужебный.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		Иначе
			СтрокаТабличнойЧасти = ДанныеАвторскогоНадзора.ВременныеДанныеПроверок.Добавить();		
			СтрокаТабличнойЧасти.НомерПроверки = 3;
			СтрокаТабличнойЧасти.ПроблемныйОбъект = ДокументСОшибкой;
			СтрокаТабличнойЧасти.ОписаниеПроблемы = НСтр("ru = 'В документе указаны счета без заполнения субконто.'") + Символы.ПС;
													
			ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее = ДанныеАвторскогоНадзора.ДанныеПечати.ИтогоОбщее + 1;	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти
