
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток;
	Драйвер.ИмяДрайвера  = "ДрайверГексагонПринтераЭтикеток";
	Драйвер.Наименование = НСтр("ru = 'Гексагон:Принтера этикеток Zebra,Proton,Toshiba-TEC,Datamax-O neil'");
	Драйвер.ИдентификаторОбъекта = "HexagonLabelPrinterDriver"; 
	Драйвер.ВерсияДрайвера = "3.3.1"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток;
	Драйвер.ИмяДрайвера  = "ДрайверСканситиПринтераЭтикеток";
	Драйвер.Наименование = НСтр("ru = 'Скансити:Принтер печати этикеток TSC'");
	Драйвер.ИдентификаторОбъекта = "ScanCityTSC1C"; 
	Драйвер.ВерсияДрайвера = "1.0.0.42"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток;
	Драйвер.ИмяДрайвера  = "ДрайверСканкодПринтераЭтикетокGodexEZPL8Native";
	Драйвер.Наименование = НСтр("ru = 'Сканкод:Принтера этикетокGodexEZPL8 (NativeAPI)'");
	Драйвер.ИдентификаторОбъекта = "GodexEZPL8"; 
	Драйвер.ВерсияДрайвера = "1.0.0.46"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток;
	Драйвер.ИмяДрайвера  = "ДрайверАтолПринтераЭтикеток";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:Принтера этикеток'");
	Драйвер.ИдентификаторОбъекта = "lp_atol1c8x3n"; 
	Драйвер.ВерсияДрайвера = "1.1.6.38"; 
	
КонецПроцедуры

#КонецОбласти
