#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УникальныйИдентификаторФормыВладельца = Параметры.УникальныйИдентификаторФормыВладельца;
	
	Организация = Параметры.Организация;
	ЭтоВозврат = Параметры.ЭтоВозврат;
	ЭтоУслуги = Параметры.ЭтоУслуги;
	Контрагент = Параметры.Контрагент;
	ДоговорКонтрагента = Параметры.ДоговорКонтрагента;
	КодПоставкиНДС = Параметры.КодПоставкиНДС;
	Курс = Параметры.Курс;
	ФормаОплаты = Параметры.ФормаОплаты;
	КодПричиныКорректировки = Параметры.КодПричиныКорректировки;
	РеализацияСДоначислениемНДС = Параметры.РеализацияСДоначислениемНДС;
	ПоступлениеОтНерезидента = Параметры.ПоступлениеОтНерезидента;
	
	НачалоПериода = Параметры.НачалоПериода;
	КонецПериода = Параметры.КонецПериода;
	
	ЗаполнитьТаблицуДокументов();
	
	// РаботаСФормами
	РаботаСФормамиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец РаботаСФормами	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", НачалоПериода, КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтаФорма, РезультатВыбора, "НачалоПериода,КонецПериода");

	ЗаполнитьТаблицуДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключаяПодчиненныеКонтрагентыПриИзменении(Элемент)
	ЗаполнитьТаблицуДокументов();
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	
	МассивСсылок = Новый Массив();
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл		
		Если СтрокаТаблицы.Подобрать Тогда
			МассивСсылок.Добавить(СтрокаТаблицы.Документ);	
		КонецЕсли;	
	КонецЦикла;	
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("МассивСсылок", МассивСсылок);  
	Оповестить("ПодборДокументовЭСФ", СтруктураВозврата, УникальныйИдентификаторФормыВладельца);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
		СтрокаТаблицы.Подобрать = Истина;		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокументов Цикл
		СтрокаТаблицы.Подобрать = Ложь;		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	ЗаполнитьТаблицуДокументов();
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	ЗаполнитьТаблицуДокументов();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	МассивСсылок = Новый Массив();
	
	Для Каждого СтрокаМассива Из Значение Цикл
		МассивСсылок.Добавить(ТаблицаДокументов.Получить(СтрокаМассива).Документ);	
	КонецЦикла;	
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("МассивСсылок", МассивСсылок);  
	Оповестить("ПодборДокументовЭСФ", СтруктураВозврата, УникальныйИдентификаторФормыВладельца);
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуДокументов()

	ТекстыЗапроса = Новый Массив;

	// Данные ТЧ "Товары" документа "Реализация товаров и услуг".
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Документ
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ТаблицаДокумента
		|		ПО РеализацияТоваровУслугТовары.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И НЕ РеализацияТоваровУслугТовары.НомерСтроки ЕСТЬ NULL
		|	И НЕ &ЭтоВозврат
		|	И НЕ &ЭтоУслуги
		|	И ТаблицаДокумента.Организация = &Организация
		|	И ТаблицаДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТаблицаДокумента.Контрагент В(&Контрагенты)
		|	И ТаблицаДокумента.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И ТаблицаДокумента.КодПоставкиНДС = &КодПоставкиНДС
		|	И ТаблицаДокумента.Курс = &Курс
		|	И ТаблицаДокумента.РеализацияСДоначислениемНДС = &РеализацияСДоначислениемНДС
		|	И ВЫБОР
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.БезвозмезднаяПоставка)
		|				ТОГДА ТаблицаДокумента.БезвозмезднаяПоставка
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				ТОГДА НЕ ТаблицаДокумента.БезвозмезднаяПоставка
		|						И ТаблицаДокумента.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|				ТОГДА НЕ ТаблицаДокумента.БезвозмезднаяПоставка
		|						И НЕ ТаблицаДокумента.БезналичныйРасчет
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// Данные ТЧ "ОС" документа "Реализация товаров и услуг".
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Документ
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ОС КАК РеализацияТоваровУслугОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ТаблицаДокумента
		|		ПО РеализацияТоваровУслугОС.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И НЕ РеализацияТоваровУслугОС.НомерСтроки ЕСТЬ NULL
		|	И НЕ &ЭтоВозврат
		|	И НЕ &ЭтоУслуги
		|	И ТаблицаДокумента.Организация = &Организация
		|	И ТаблицаДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТаблицаДокумента.Контрагент В(&Контрагенты)
		|	И ТаблицаДокумента.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И ТаблицаДокумента.КодПоставкиНДС = &КодПоставкиНДС
		|	И ТаблицаДокумента.Курс = &Курс
		|	И ВЫБОР
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.БезвозмезднаяПоставка)
		|				ТОГДА ТаблицаДокумента.БезвозмезднаяПоставка
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				ТОГДА НЕ ТаблицаДокумента.БезвозмезднаяПоставка
		|						И ТаблицаДокумента.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|				ТОГДА НЕ ТаблицаДокумента.БезвозмезднаяПоставка
		|						И НЕ ТаблицаДокумента.БезналичныйРасчет
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// Данные ТЧ "Услуги" документа "Реализация товаров и услуг".
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Документ
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ТаблицаДокумента
		|		ПО РеализацияТоваровУслугУслуги.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И НЕ РеализацияТоваровУслугУслуги.НомерСтроки ЕСТЬ NULL
		|	И НЕ &ЭтоВозврат
		|	И &ЭтоУслуги
		|	И ТаблицаДокумента.Организация = &Организация
		|	И ТаблицаДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТаблицаДокумента.Контрагент В(&Контрагенты)
		|	И ТаблицаДокумента.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И ТаблицаДокумента.КодПоставкиНДС = &КодПоставкиНДС
		|	И ТаблицаДокумента.Курс = &Курс
		|	И ВЫБОР
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.БезвозмезднаяПоставка)
		|				ТОГДА ТаблицаДокумента.БезвозмезднаяПоставка
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				ТОГДА НЕ ТаблицаДокумента.БезвозмезднаяПоставка
		|						И ТаблицаДокумента.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|				ТОГДА НЕ ТаблицаДокумента.БезвозмезднаяПоставка
		|						И НЕ ТаблицаДокумента.БезналичныйРасчет
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// Данные ТЧ "Товары" документа "Возврат товаров от покупателя".
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Документ
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ТаблицаДокумента
		|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И НЕ ВозвратТоваровОтПокупателяТовары.НомерСтроки ЕСТЬ NULL
		|	И &ЭтоВозврат
		|	И НЕ &ЭтоУслуги
		|	И ТаблицаДокумента.Организация = &Организация
		|	И ТаблицаДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТаблицаДокумента.Контрагент В(&Контрагенты)
		|	И ТаблицаДокумента.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И ТаблицаДокумента.КодПоставкиНДС = &КодПоставкиНДС
		|	И ТаблицаДокумента.Курс = &Курс
		|	И ВЫБОР
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.БезвозмезднаяПоставка)
		|				ТОГДА ТаблицаДокумента.БезвозмезднаяПоставка
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				ТОГДА НЕ ТаблицаДокумента.БезвозмезднаяПоставка
		|						И ТаблицаДокумента.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|				ТОГДА НЕ ТаблицаДокумента.БезвозмезднаяПоставка
		|						И НЕ ТаблицаДокумента.БезналичныйРасчет
		|		КОНЕЦ
		|	И НЕ &КодПричиныКорректировки = 30
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// Данные ТЧ "ОС" документа "Возврат товаров от покупателя".
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Документ
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.ОС КАК ВозвратТоваровОтПокупателяОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ТаблицаДокумента
		|		ПО ВозвратТоваровОтПокупателяОС.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И НЕ ВозвратТоваровОтПокупателяОС.НомерСтроки ЕСТЬ NULL
		|	И &ЭтоВозврат
		|	И НЕ &ЭтоУслуги
		|	И ТаблицаДокумента.Организация = &Организация
		|	И ТаблицаДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТаблицаДокумента.Контрагент В(&Контрагенты)
		|	И ТаблицаДокумента.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И ТаблицаДокумента.КодПоставкиНДС = &КодПоставкиНДС
		|	И ТаблицаДокумента.Курс = &Курс
		|	И ВЫБОР
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.БезвозмезднаяПоставка)
		|				ТОГДА ТаблицаДокумента.БезвозмезднаяПоставка
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				ТОГДА НЕ ТаблицаДокумента.БезвозмезднаяПоставка
		|						И ТаблицаДокумента.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|				ТОГДА НЕ ТаблицаДокумента.БезвозмезднаяПоставка
		|						И НЕ ТаблицаДокумента.БезналичныйРасчет
		|		КОНЕЦ
		|	И НЕ &КодПричиныКорректировки = 30
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// Данные ТЧ "Услуги" документа "Возврат товаров от покупателя".
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Документ
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Услуги КАК ВозвратТоваровОтПокупателяУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ТаблицаДокумента
		|		ПО ВозвратТоваровОтПокупателяУслуги.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И НЕ ВозвратТоваровОтПокупателяУслуги.НомерСтроки ЕСТЬ NULL
		|	И &ЭтоВозврат
		|	И &ЭтоУслуги
		|	И ТаблицаДокумента.Организация = &Организация
		|	И ТаблицаДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТаблицаДокумента.Контрагент В(&Контрагенты)
		|	И ТаблицаДокумента.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И ТаблицаДокумента.КодПоставкиНДС = &КодПоставкиНДС
		|	И ТаблицаДокумента.Курс = &Курс
		|	И ВЫБОР
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.БезвозмезднаяПоставка)
		|				ТОГДА ТаблицаДокумента.БезвозмезднаяПоставка
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				ТОГДА НЕ ТаблицаДокумента.БезвозмезднаяПоставка
		|						И ТаблицаДокумента.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|				ТОГДА НЕ ТаблицаДокумента.БезвозмезднаяПоставка
		|						И НЕ ТаблицаДокумента.БезналичныйРасчет
		|		КОНЕЦ
		|	И НЕ &КодПричиныКорректировки = 30
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// Данные ТЧ "Товары" документа "Корректировка стоимости реализации".
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Документ
		|ИЗ
		|	Документ.КорректировкаСтоимостиРеализации.Товары КАК КорректировкаСтоимостиРеализацииТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиРеализации КАК ТаблицаДокумента
		|		ПО КорректировкаСтоимостиРеализацииТовары.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И НЕ КорректировкаСтоимостиРеализацииТовары.НомерСтроки ЕСТЬ NULL
		|	И &ЭтоВозврат
		|	И НЕ &ЭтоУслуги
		|	И ТаблицаДокумента.Организация = &Организация
		|	И ТаблицаДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТаблицаДокумента.Контрагент В(&Контрагенты)
		|	И ТаблицаДокумента.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И ТаблицаДокумента.КодПоставкиНДС = &КодПоставкиНДС
		|	И ТаблицаДокумента.Курс = &Курс
		|	И ВЫБОР
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.БезвозмезднаяПоставка)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА ТаблицаДокумента.ДокументОснование.БезвозмезднаяПоставка
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА НЕ ТаблицаДокумента.ДокументОснование.БезвозмезднаяПоставка
		|						И ТаблицаДокумента.ДокументОснование.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияУслугПоПереработке
		|				ТОГДА ТаблицаДокумента.ДокументОснование.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА НЕ ТаблицаДокумента.ДокументОснование.БезвозмезднаяПоставка
		|						И НЕ ТаблицаДокумента.ДокументОснование.БезналичныйРасчет	
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияУслугПоПереработке
		|				ТОГДА НЕ ТаблицаДокумента.ДокументОснование.БезналичныйРасчет
		|		КОНЕЦ
		|	И &КодПричиныКорректировки = 30
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// Данные ТЧ "ОС" документа "Корректировка стоимости реализации".
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Документ
		|ИЗ
		|	Документ.КорректировкаСтоимостиРеализации.ОС КАК КорректировкаСтоимостиРеализацииОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиРеализации КАК ТаблицаДокумента
		|		ПО КорректировкаСтоимостиРеализацииОС.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И НЕ КорректировкаСтоимостиРеализацииОС.НомерСтроки ЕСТЬ NULL
		|	И &ЭтоВозврат
		|	И НЕ &ЭтоУслуги
		|	И ТаблицаДокумента.Организация = &Организация
		|	И ТаблицаДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТаблицаДокумента.Контрагент В(&Контрагенты)
		|	И ТаблицаДокумента.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И ТаблицаДокумента.КодПоставкиНДС = &КодПоставкиНДС
		|	И ТаблицаДокумента.Курс = &Курс
		|	И ВЫБОР
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.БезвозмезднаяПоставка)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА ТаблицаДокумента.ДокументОснование.БезвозмезднаяПоставка
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА НЕ ТаблицаДокумента.ДокументОснование.БезвозмезднаяПоставка
		|						И ТаблицаДокумента.ДокументОснование.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияУслугПоПереработке
		|				ТОГДА ТаблицаДокумента.ДокументОснование.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА НЕ ТаблицаДокумента.ДокументОснование.БезвозмезднаяПоставка
		|						И НЕ ТаблицаДокумента.ДокументОснование.БезналичныйРасчет	
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияУслугПоПереработке
		|				ТОГДА НЕ ТаблицаДокумента.ДокументОснование.БезналичныйРасчет
		|		КОНЕЦ
		|	И &КодПричиныКорректировки = 30
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// Данные ТЧ "Услуги" документа "Корректировка стоимости реализации".
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Документ
		|ИЗ
		|	Документ.КорректировкаСтоимостиРеализации.Услуги КАК КорректировкаСтоимостиРеализацииУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаСтоимостиРеализации КАК ТаблицаДокумента
		|		ПО КорректировкаСтоимостиРеализацииУслуги.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И НЕ КорректировкаСтоимостиРеализацииУслуги.НомерСтроки ЕСТЬ NULL
		|	И &ЭтоВозврат
		|	И &ЭтоУслуги
		|	И ТаблицаДокумента.Организация = &Организация
		|	И ТаблицаДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТаблицаДокумента.Контрагент В(&Контрагенты)
		|	И ТаблицаДокумента.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И ТаблицаДокумента.КодПоставкиНДС = &КодПоставкиНДС
		|	И ТаблицаДокумента.Курс = &Курс
		|	И ВЫБОР
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.БезвозмезднаяПоставка)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА ТаблицаДокумента.ДокументОснование.БезвозмезднаяПоставка
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА НЕ ТаблицаДокумента.ДокументОснование.БезвозмезднаяПоставка
		|						И ТаблицаДокумента.ДокументОснование.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияУслугПоПереработке
		|				ТОГДА ТаблицаДокумента.ДокументОснование.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА НЕ ТаблицаДокумента.ДокументОснование.БезвозмезднаяПоставка
		|						И НЕ ТаблицаДокумента.ДокументОснование.БезналичныйРасчет	
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.РеализацияУслугПоПереработке
		|				ТОГДА НЕ ТаблицаДокумента.ДокументОснование.БезналичныйРасчет
		|		КОНЕЦ
		|	И &КодПричиныКорректировки = 30
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
		
	// Данные ТЧ "Услуги" документа "Поступление товаров и услуг".
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Документ
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ТаблицаДокумента
		|		ПО ПоступлениеТоваровУслугУслуги.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И НЕ ПоступлениеТоваровУслугУслуги.НомерСтроки ЕСТЬ NULL
		|	И НЕ &ЭтоВозврат
		|	И &ЭтоУслуги
		|	И ТаблицаДокумента.Организация = &Организация
		|	И ТаблицаДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ТаблицаДокумента.Контрагент В(&Контрагенты)
		|	И НЕ ТаблицаДокумента.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|	И ТаблицаДокумента.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И ТаблицаДокумента.Курс = &Курс
		|	И ТаблицаДокумента.ПоступлениеОтНерезидента
		|	И НЕ ТаблицаДокумента.ЭтоПоступлениеБезНДС
		|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Услуги)
		|	И &ПоступлениеОтНерезидента
		|	И ВЫБОР
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				ТОГДА ТаблицаДокумента.БезналичныйРасчет
		|			КОГДА &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|				ТОГДА НЕ ТаблицаДокумента.БезналичныйРасчет
		|		КОНЕЦ
		|	И ТаблицаДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Услуги)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДокумента.Ссылка";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
		
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, Символы.ПС + " ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС);

	Если ВключаяФилиалы Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаДокумента.ДоговорКонтрагента = &ДоговорКонтрагента", "Истина");
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЭтоВозврат", ЭтоВозврат);
	Запрос.УстановитьПараметр("ЭтоУслуги", ЭтоУслуги);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("КодПоставкиНДС", КодПоставкиНДС);
	Запрос.УстановитьПараметр("Курс", Курс);
	Запрос.УстановитьПараметр("ФормаОплаты", ФормаОплаты);
	Запрос.УстановитьПараметр("КодПричиныКорректировки", КодПричиныКорректировки);
	Запрос.УстановитьПараметр("РеализацияСДоначислениемНДС", РеализацияСДоначислениемНДС);
	Запрос.УстановитьПараметр("ПоступлениеОтНерезидента", ПоступлениеОтНерезидента);
	
	Контрагенты = Новый Массив;
	Контрагенты.Добавить(Контрагент);
	// Добавление подчиненных контрагентов.
	Если ВключаяФилиалы Тогда 
		ПодчиненныеКонтрагенты = Справочники.Контрагенты.ПодчиненныеКонтрагенты(Контрагент);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Контрагенты, ПодчиненныеКонтрагенты); 
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	
	ТаблицаДокументов.Загрузить(Запрос.Выполнить().Выгрузить());	
КонецПроцедуры

#КонецОбласти
