#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//@skip-warning
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Функция формирует табличный документ с печатной формой ЕНД
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьОсновнойФормы(МассивОбъектов, ОбъектыПечати)	
	
	// Переносятся только итоговые строки.
	// Прописываются коды строк непосредственно в запросе.
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода,
		|	ЕдинаяНалоговаяДекларация.СтрокиОтчета.(
		|		КодСтроки КАК КодСтроки,
		|		Сумма КАК Сумма
		|	) КАК СтрокиОтчета
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)
		|	И (ЕдинаяНалоговаяДекларация.СтрокиОтчета.КодСтроки = ""199""
		|			ИЛИ ЕдинаяНалоговаяДекларация.СтрокиОтчета.КодСтроки = ""299""
		|			ИЛИ ЕдинаяНалоговаяДекларация.СтрокиОтчета.КодСтроки = ""499""
		|			ИЛИ ЕдинаяНалоговаяДекларация.СтрокиОтчета.КодСтроки = ""963""
		|			ИЛИ ЕдинаяНалоговаяДекларация.СтрокиОтчета.КодСтроки = ""062"")";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_ОсновнаяФорма";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_ОсновнаяФорма_STI_101");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		
		ДанныеПечати.Вставить("Яч050", 0);
		ДанныеПечати.Вставить("Яч051", 0);
		ДанныеПечати.Вставить("Яч053", 0);
		ДанныеПечати.Вставить("Яч054", 0);
		ДанныеПечати.Вставить("Яч055", 0);
		ДанныеПечати.Вставить("Яч056", 0);
		ДанныеПечати.Вставить("Яч057", 0);
		ДанныеПечати.Вставить("Яч058", 0);
		ДанныеПечати.Вставить("Яч059", 0);
		ДанныеПечати.Вставить("Яч060", 0);
		ДанныеПечати.Вставить("Яч061", 0);
		ДанныеПечати.Вставить("Яч062", 0);
		ДанныеПечати.Вставить("Яч063", 0);
		ДанныеПечати.Вставить("Яч064", 0);
		ДанныеПечати.Вставить("Яч065", 0);
		ДанныеПечати.Вставить("Яч066", 0);
		ДанныеПечати.Вставить("Яч067", 0);
		ДанныеПечати.Вставить("Яч068", 0);
		
		ВыборкаСтрокиОтчета = Шапка.СтрокиОтчета.Выбрать();
		Пока ВыборкаСтрокиОтчета.Следующий() Цикл
			Если ВыборкаСтрокиОтчета.КодСтроки = "199" Тогда
				ДанныеПечати.Яч050 = ВыборкаСтрокиОтчета.Сумма;
			ИначеЕсли ВыборкаСтрокиОтчета.КодСтроки = "299" Тогда
				ДанныеПечати.Яч051 = ВыборкаСтрокиОтчета.Сумма;							
			ИначеЕсли ВыборкаСтрокиОтчета.КодСтроки = "499" Тогда
				ДанныеПечати.Яч053 = ВыборкаСтрокиОтчета.Сумма;
			ИначеЕсли ВыборкаСтрокиОтчета.КодСтроки = "963" Тогда
				ДанныеПечати.Яч054 = ВыборкаСтрокиОтчета.Сумма;
			ИначеЕсли ВыборкаСтрокиОтчета.КодСтроки = "062" Тогда
				ДанныеПечати.Яч062 = ВыборкаСтрокиОтчета.Сумма;
			КонецЕсли;				
		КонецЦикла;
		
		ДанныеПечати.Вставить("Яч052", ДанныеПечати.Яч050 - ДанныеПечати.Яч051);
		Если ДанныеПечати.Яч052 < 0 Тогда
			ДанныеПечати.Вставить("ЗнакЯч052", "-");
		КонецЕсли;
		
		// 056 УБЫТОК, ПОДЛЕЖАЩИЙ ПЕРЕНОСУ
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УбыткиПрошлыхЛетОбороты.СуммаРасход КАК СуммаРасход
		|ИЗ
		|	РегистрНакопления.УбыткиПрошлыхЛет.Обороты(&НачалоПериода, &КонецПериода, , Организация = &Организация) КАК УбыткиПрошлыхЛетОбороты";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Шапка.НачалоПериода));		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(Шапка.КонецПериода));
		Запрос.УстановитьПараметр("Организация", Шапка.Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
			ДанныеПечати.Яч056 = ВыборкаДетальныеЗаписи.СуммаРасход;
		КонецЕсли;

		СтавкаНалогаНаПрибыль = БухгалтерскийУчетСервер.ПолучитьДанныеУчетнойПолитикиОрганизаций(Шапка.КонецПериода, Шапка.Организация).СтавкаНалогаНаПрибыль;
		ДанныеПечати.Яч060 = СтавкаНалогаНаПрибыль;
		
		ДанныеПечати.Яч058 = ДанныеПечати.Яч052 - ДанныеПечати.Яч053 - ДанныеПечати.Яч054 - ДанныеПечати.Яч056;
		
		// 064 Расходы на ККМ
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.СуммаРасходовНаККМ КАК СуммаРасходовНаККМ
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	ЗакрытиеМесяца.Проведен
		|	И КОНЕЦПЕРИОДА(ЗакрытиеМесяца.Дата, МЕСЯЦ) = &Период
		|	И ЗакрытиеМесяца.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Период", КонецМесяца(Шапка.КонецПериода));
		Запрос.УстановитьПараметр("Организация", Шапка.Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
			ДанныеПечати.Яч064 = ВыборкаДетальныеЗаписи.СуммаРасходовНаККМ;
		КонецЕсли;
		Если ДанныеПечати.Яч058 < 0 Тогда
			ДанныеПечати.Яч059 = ДанныеПечати.Яч058;
		Иначе
			ДанныеПечати.Яч061 = (ДанныеПечати.Яч058 * ДанныеПечати.Яч060) / 100;
			
			//// Заполнение предварительно начисленной суммы.
			//// Документ ТекущийРасчетНалогаНаПрибыль должен быть оформлен за 3 квартала
			//// Только в этом случае берется сумма.
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//	"ВЫБРАТЬ
			//	|	ПлатежиПоНалогуНаПрибыльСрезПоследних.Сумма КАК Сумма
			//	|ИЗ
			//	|	РегистрСведений.ПлатежиПоНалогуНаПрибыль.СрезПоследних(
			//	|			&Период,
			//	|			Организация = &Организация
			//	|				И ГОД(Период) = &ТекущийГод) КАК ПлатежиПоНалогуНаПрибыльСрезПоследних";
			//
			//Запрос.УстановитьПараметр("Период", Шапка.КонецПериода);
			//Запрос.УстановитьПараметр("Организация", Шапка.Организация);
			//Запрос.УстановитьПараметр("ТекущийГод", Год(Шапка.КонецПериода));
			//
			//РезультатЗапроса = Запрос.Выполнить();
			//
			//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			//
			//Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
			//	ДанныеПечати.Яч062 = ВыборкаДетальныеЗаписи.Сумма;
			//КонецЕсли;
		КонецЕсли;
	
		ДанныеПечати.Яч066 = ДанныеПечати.Яч061 - ДанныеПечати.Яч062 - ДанныеПечати.Яч063 - ДанныеПечати.Яч064 + ДанныеПечати.Яч065;
		Если ДанныеПечати.Яч066 < 0 Тогда 
			ДанныеПечати.Яч067 = ДанныеПечати.Яч066;
		Иначе 
			ДанныеПечати.Яч068 = ДанныеПечати.Яч066;
		КонецЕсли;			
				
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение1ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения1(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода,
		|	ЕдинаяНалоговаяДекларация.СтрокиОтчета.(
		|		""Яч"" + КодСтроки КАК КодСтроки,
		|		Сумма КАК Сумма
		|	) КАК СтрокиОтчета
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение1";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение1");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		
		ВыборкаСтрокиОтчета = Шапка.СтрокиОтчета.Выбрать();
		Пока ВыборкаСтрокиОтчета.Следующий() Цикл
			ДанныеПечати.Вставить(ВыборкаСтрокиОтчета.КодСтроки, ВыборкаСтрокиОтчета.Сумма);			
		КонецЦикла;
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение2ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения2(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода,
		|	ЕдинаяНалоговаяДекларация.СтрокиОтчета.(
		|		""Яч"" + ЕдинаяНалоговаяДекларация.СтрокиОтчета.КодСтроки КАК КодСтроки,
		|		ВЫБОР
		|			КОГДА ЕдинаяНалоговаяДекларация.СтрокиОтчета.Сумма < 0
		|				ТОГДА -ЕдинаяНалоговаяДекларация.СтрокиОтчета.Сумма
		|			ИНАЧЕ ЕдинаяНалоговаяДекларация.СтрокиОтчета.Сумма
		|		КОНЕЦ КАК Сумма
		|	) КАК СтрокиОтчета
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение2";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение2");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		
		ДанныеПечати.Вставить("Яч250", 0);
		
		ВыборкаСтрокиОтчета = Шапка.СтрокиОтчета.Выбрать();
		Пока ВыборкаСтрокиОтчета.Следующий() Цикл
			
			Если ВыборкаСтрокиОтчета.КодСтроки = "Яч250" ИЛИ ВыборкаСтрокиОтчета.КодСтроки = "Яч250а" Тогда
				ДанныеПечати.Яч250 = ДанныеПечати.Яч250 + ВыборкаСтрокиОтчета.Сумма;
			КонецЕсли;	
			
			ДанныеПечати.Вставить(ВыборкаСтрокиОтчета.КодСтроки, ВыборкаСтрокиОтчета.Сумма);			
		КонецЦикла;
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение3ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения3(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение3";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение3");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение4ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения4(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение4";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение4");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение5ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения5(МассивОбъектов, ОбъектыПечати)	
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение5";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение5");

	Для каждого  ТекущийДокумент Из МассивОбъектов Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				
		Запрос = Новый Запрос;		
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЗакрытиеМесяцаНедвижимость.ОсновноеСредство КАК ОсновноеСредство,
		|	ЗакрытиеМесяцаНедвижимость.ГруппаИмущества КАК ГруппаИмущества,
		|	ЗакрытиеМесяцаНедвижимость.СуммаНалога КАК СуммаНалога,
		|	ЗакрытиеМесяцаНедвижимость.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВременнтаяТаблицаНедвижимость
		|ИЗ
		|	Документ.ЗакрытиеМесяца.Недвижимость КАК ЗакрытиеМесяцаНедвижимость
		|ГДЕ
		|	НЕ ЗакрытиеМесяцаНедвижимость.Ссылка.ПометкаУдаления
		|	И ЗакрытиеМесяцаНедвижимость.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗакрытиеМесяцаНедвижимость.Ссылка.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВременнтаяТаблицаНедвижимость.СуммаНалога) КАК СуммаНалога2,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнтаяТаблицаНедвижимость.ОсновноеСредство) КАК Количество2,
		|	0 КАК СуммаНалога3,
		|	0 КАК Количество3,
		|	0 КАК СуммаНалога4,
		|	0 КАК Количество4
		|ПОМЕСТИТЬ ВременнаяТаблицаСвод
		|ИЗ
		|	ВременнтаяТаблицаНедвижимость КАК ВременнтаяТаблицаНедвижимость
		|ГДЕ
		|	ВременнтаяТаблицаНедвижимость.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ2)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	СУММА(ВременнтаяТаблицаНедвижимость.СуммаНалога),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнтаяТаблицаНедвижимость.ОсновноеСредство),
		|	0,
		|	0
		|ИЗ
		|	ВременнтаяТаблицаНедвижимость КАК ВременнтаяТаблицаНедвижимость
		|ГДЕ
		|	ВременнтаяТаблицаНедвижимость.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ3)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	0,
		|	0,
		|	СУММА(ЗакрытиеМесяцаТранспорт.СуммаНалога),
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗакрытиеМесяцаТранспорт.ОсновноеСредство)
		|ИЗ
		|	Документ.ЗакрытиеМесяца.Транспорт КАК ЗакрытиеМесяцаТранспорт
		|ГДЕ
		|	НЕ ЗакрытиеМесяцаТранспорт.Ссылка.ПометкаУдаления
		|	И ЗакрытиеМесяцаТранспорт.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗакрытиеМесяцаТранспорт.Ссылка.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВременнаяТаблицаСвод.СуммаНалога2) КАК СуммаНалога2,
		|	СУММА(ВременнаяТаблицаСвод.Количество2) КАК Количество2,
		|	СУММА(ВременнаяТаблицаСвод.СуммаНалога3) КАК СуммаНалога3,
		|	СУММА(ВременнаяТаблицаСвод.Количество3) КАК Количество3,
		|	СУММА(ВременнаяТаблицаСвод.СуммаНалога4) КАК СуммаНалога4,
		|	СУММА(ВременнаяТаблицаСвод.Количество4) КАК Количество4
		|ИЗ
		|	ВременнаяТаблицаСвод КАК ВременнаяТаблицаСвод";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		ДанныеПечати = Новый Структура();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", ТекущийДокумент.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", ТекущийДокумент.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", ТекущийДокумент.КонецПериода);

		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		
		СтруктураИтоги = Новый Структура();
		СтруктураИтоги.Вставить("ИтогоСуммаНалога", Выборка.СуммаНалога2 + Выборка.СуммаНалога3 + Выборка.СуммаНалога4 );
		ОбластьМакета.Параметры.Заполнить(СтруктураИтоги);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение5_01ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения5_01(МассивОбъектов, ОбъектыПечати)	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение5_01";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение5_01");
	
	Для каждого  ТекущийДокумент Из МассивОбъектов Цикл
		
		Запрос = Новый Запрос;		
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка КАК Ссылка,
		|	ЗакрытиеМесяца.Организация КАК Организация,
		|	ЗакрытиеМесяца.Дата КАК Дата,
		|	ЗакрытиеМесяца.Недвижимость.(
		|		НомерСтроки КАК НомерСтроки,
		|		ОсновноеСредство КАК ОсновноеСредство,
		|		ГруппаИмущества КАК ГруппаИмущества,
		|		ОсновноеСредство.ИдентификационныйНомерИмущества КАК ИдентификационныйКодИмущества,
		|		СуммаНалога КАК СуммаНалога,
		|		ЖилаяПлощадь КАК ЖилаяПлощадь
		|	) КАК Недвижимость
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	НЕ ЗакрытиеМесяца.ПометкаУдаления
		|	И ЗакрытиеМесяца.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗакрытиеМесяца.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОбИмуществеСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	СведенияОбИмуществеСрезПоследних.КодИмущества.Код КАК КодВидаИмущества,
		|	СведенияОбИмуществеСрезПоследних.КодПользователяИмущества.Код КАК КодПользователяИмущества
		|ИЗ
		|	РегистрСведений.СведенияОбИмуществе.СрезПоследних(&КонецПериода, ) КАК СведенияОбИмуществеСрезПоследних";
		
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		Шапка = МассивРезультатовЗапроса[0].Выбрать();
		СведенияОбИмуществе = МассивРезультатовЗапроса[1].Выбрать();
		СтруктураОтбора = Новый Структура;
		
		Если Шапка.Количество() > 0 Тогда 
			Пока Шапка.Следующий() Цикл
				Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;		
				НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				
				ДанныеПечати = Новый Структура();
				
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Заполнение шапки.
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Организация", ТекущийДокумент.Организация);
				СтруктураПараметров.Вставить("НачалоПериода", ТекущийДокумент.НачалоПериода);
				СтруктураПараметров.Вставить("КонецПериода", ТекущийДокумент.КонецПериода);
				
				ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ИтогиПоПриложению = Новый Структура();
				ИтогиПоПриложению.Вставить("СуммаНалога", 	0);
				
				// Детали
				ОбластьМакета = Макет.ПолучитьОбласть("Детали");
				ВыборкаНедвижимость = Шапка.Недвижимость.Выбрать();
				КоличествоСтрок = ВыборкаНедвижимость.Количество();
				Пока ВыборкаНедвижимость.Следующий() Цикл
					
					ОбластьМакета.Параметры.Заполнить(ВыборкаНедвижимость);
					ИтогиПоПриложению.СуммаНалога 	= ИтогиПоПриложению.СуммаНалога + ВыборкаНедвижимость.СуммаНалога; 
					
					СтруктураОтбора.Вставить("ОсновноеСредство", ВыборкаНедвижимость.ОсновноеСредство);
					Пока СведенияОбИмуществе.НайтиСледующий(СтруктураОтбора) Цикл
						ОбластьМакета.Параметры.Заполнить(СведенияОбИмуществе);
					КонецЦикла;
					СведенияОбИмуществе.Сбросить();
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
				КонецЦикла;
				
				ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
				Для Сч = 1 По 28 - КоличествоСтрок Цикл
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Итог");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,ИтогиПоПриложению);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
			КонецЦикла;
			
		Иначе // вывод пустого макета
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Заполнение шапки.
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
			Для Сч = 1 По 28 Цикл
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			ОбластьМакета = Макет.ПолучитьОбласть("Итог");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение5_02ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения5_02(МассивОбъектов, ОбъектыПечати)	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Приложение5_02";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение5_02");
	
	Для каждого  ТекущийДокумент Из МассивОбъектов Цикл
		
		Запрос = Новый Запрос;		
		Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка КАК Ссылка,
		|	ЗакрытиеМесяца.Организация КАК Организация,
		|	ЗакрытиеМесяца.Дата КАК Дата,
		|	ЗакрытиеМесяца.Транспорт.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ОсновноеСредство КАК ОсновноеСредство,
		|		ВидТранспорта.Код КАК КодВидаТранспорта,
		|		СуммаНалога КАК СуммаНалога
		|	) КАК Транспорт
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	НЕ ЗакрытиеМесяца.ПометкаУдаления
		|	И ЗакрытиеМесяца.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗакрытиеМесяца.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОТранспортеСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	СведенияОТранспортеСрезПоследних.МаркаТранспортногоСредства КАК МаркаТранспортногоСредства
		|ИЗ
		|	РегистрСведений.СведенияОТранспорте.СрезПоследних(&КонецПериода, ) КАК СведенияОТранспортеСрезПоследних";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		Шапка = МассивРезультатовЗапроса[0].Выбрать();
		СведенияОТранспорте = МассивРезультатовЗапроса[1].Выбрать();
		СтруктураОтбора = Новый Структура;
		
		Если Шапка.Количество() > 0 Тогда 
			Пока Шапка.Следующий() Цикл
				Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;		
				НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				
				ДанныеПечати = Новый Структура();
				
				ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Заполнение шапки.
				ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Организация", ТекущийДокумент.Организация);
				СтруктураПараметров.Вставить("НачалоПериода", ТекущийДокумент.НачалоПериода);
				СтруктураПараметров.Вставить("КонецПериода", ТекущийДокумент.КонецПериода);
				
				ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ИтогиПоПриложению = Новый Структура();
				ИтогиПоПриложению.Вставить("СуммаНалога", 	0);
				
				// Детали
				ОбластьМакета = Макет.ПолучитьОбласть("Детали");
				ВыборкаТранспорт = Шапка.Транспорт.Выбрать();
				КоличествоСтрок = ВыборкаТранспорт.Количество();
				Пока ВыборкаТранспорт.Следующий() Цикл
					
					ОбластьМакета.Параметры.Заполнить(ВыборкаТранспорт);
					ИтогиПоПриложению.СуммаНалога 	= ИтогиПоПриложению.СуммаНалога + ВыборкаТранспорт.СуммаНалога;
					
					СтруктураОтбора.Вставить("ОсновноеСредство", ВыборкаТранспорт.ОсновноеСредство);
					Пока СведенияОТранспорте.НайтиСледующий(СтруктураОтбора) Цикл
						ОбластьМакета.Параметры.Заполнить(СведенияОТранспорте);
					КонецЦикла;
					СведенияОТранспорте.Сбросить();
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
					
				КонецЦикла;
				
				ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
				Для Сч = 1 По 28 - КоличествоСтрок Цикл
					ТабличныйДокумент.Вывести(ОбластьМакета);
				КонецЦикла;
				
				ОбластьМакета = Макет.ПолучитьОбласть("Итог");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,ИтогиПоПриложению);
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
			КонецЦикла;
			
		Иначе 
			// вывод пустого макета
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Заполнение шапки.
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
			Для Сч = 1 По 28 Цикл
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			ОбластьМакета = Макет.ПолучитьОбласть("Итог");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение6ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения6(МассивОбъектов, ОбъектыПечати)	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение6";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение6");
	
	Для каждого  ТекущийДокумент Из МассивОбъектов Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗакрытиеМесяцаЗемельныйНалог.Ссылка КАК Ссылка,
		|	ЗакрытиеМесяцаЗемельныйНалог.ОсновноеСредство КАК ОсновноеСредство,
		|	ЗакрытиеМесяцаЗемельныйНалог.КатегорияЗемель КАК КатегорияЗемель,
		|	ЗакрытиеМесяцаЗемельныйНалог.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаЗМЗемельныйНалог
		|ИЗ
		|	Документ.ЗакрытиеМесяца.ЗемельныйНалог КАК ЗакрытиеМесяцаЗемельныйНалог
		|ГДЕ
		|	ЗакрытиеМесяцаЗемельныйНалог.Ссылка.Проведен
		|	И КОНЕЦПЕРИОДА(ЗакрытиеМесяцаЗемельныйНалог.Ссылка.Дата, МЕСЯЦ) = &Период
		|	И ЗакрытиеМесяцаЗемельныйНалог.Ссылка.Организация = &Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗемельныйНалог.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаЗемельныйНалог.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаЗемельныйНалог.КатегорияЗемель КАК КатегорияЗемель,
		|	ВременнаяТаблицаЗемельныйНалог.Сумма КАК Сумма,
		|	ЕСТЬNULL(ПараметрыУчетаОСЗемельныйНалогСрезПоследних.КатегорияОбъектаИмущества, ЗНАЧЕНИЕ(Справочник.КатегорияОбъектаИмущества.пустаяссылка)) КАК КатегорияОбъектаИмущества
		|ПОМЕСТИТЬ ВременнаяТаблицаЗемельныйНалог
		|ИЗ
		|	ВременнаяТаблицаЗМЗемельныйНалог КАК ВременнаяТаблицаЗемельныйНалог
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаОСЗемельныйНалог.СрезПоследних(&Период, Организация = &Организация) КАК ПараметрыУчетаОСЗемельныйНалогСрезПоследних
		|		ПО ВременнаяТаблицаЗемельныйНалог.ОсновноеСредство = ПараметрыУчетаОСЗемельныйНалогСрезПоследних.ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗемельныйНалог.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаЗемельныйНалог.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаЗемельныйНалог.КатегорияЗемель КАК КатегорияЗемель,
		|	ВременнаяТаблицаЗемельныйНалог.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаЗемельныйНалог.КатегорияОбъектаИмущества = ЗНАЧЕНИЕ(Справочник.КатегорияОбъектаИмущества.О)
		|				ИЛИ ВременнаяТаблицаЗемельныйНалог.КатегорияОбъектаИмущества = ЗНАЧЕНИЕ(Справочник.КатегорияОбъектаИмущества.пустаяссылка)
		|			ТОГДА 1
		|	КОНЕЦ КАК Облагаемый,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаЗемельныйНалог.КатегорияОбъектаИмущества = ЗНАЧЕНИЕ(Справочник.КатегорияОбъектаИмущества.НО)
		|			ТОГДА 1
		|	КОНЕЦ КАК Необлагаемый,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаЗемельныйНалог.КатегорияОбъектаИмущества = ЗНАЧЕНИЕ(Справочник.КатегорияОбъектаИмущества.ЛО)
		|			ТОГДА 1
		|	КОНЕЦ КАК Льготный
		|ПОМЕСТИТЬ ВременнаяТаблицаПредв
		|ИЗ
		|	ВременнаяТаблицаЗемельныйНалог КАК ВременнаяТаблицаЗемельныйНалог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнаяТаблицаПредв.ОсновноеСредство) КАК Количество1,
		|	СУММА(ВременнаяТаблицаПредв.Облагаемый) КАК КоличествоОблаг1,
		|	СУММА(ВременнаяТаблицаПредв.Необлагаемый) КАК КоличествоНеоблаг1,
		|	СУММА(ВременнаяТаблицаПредв.Льготный) КАК КоличествоОсв1,
		|	СУММА(ВременнаяТаблицаПредв.Сумма) КАК СуммаНалога1,
		|	0 КАК Количество2,
		|	0 КАК КоличествоОблаг2,
		|	0 КАК КоличествоНеоблаг2,
		|	0 КАК КоличествоОсв2,
		|	0 КАК СуммаНалога2,
		|	0 КАК Количество3,
		|	0 КАК КоличествоОблаг3,
		|	0 КАК КоличествоНеоблаг3,
		|	0 КАК КоличествоОсв3,
		|	0 КАК СуммаНалога3
		|ПОМЕСТИТЬ ВременнаяТаблицаСвод
		|ИЗ
		|	ВременнаяТаблицаПредв КАК ВременнаяТаблицаПредв
		|ГДЕ
		|	ВременнаяТаблицаПредв.КатегорияЗемель = ЗНАЧЕНИЕ(перечисление.КатегорииЗемель.Сельхозугодья)
		|
		|ДЛЯ ИЗМЕНЕНИЯ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнаяТаблицаПредв.ОсновноеСредство),
		|	СУММА(ВременнаяТаблицаПредв.Облагаемый),
		|	СУММА(ВременнаяТаблицаПредв.Необлагаемый),
		|	СУММА(ВременнаяТаблицаПредв.Льготный),
		|	СУММА(ВременнаяТаблицаПредв.Сумма),
		|	0,
		|	0,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаПредв КАК ВременнаяТаблицаПредв
		|ГДЕ
		|	ВременнаяТаблицаПредв.КатегорияЗемель = ЗНАЧЕНИЕ(перечисление.КатегорииЗемель.Несельскохозяйственные)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнаяТаблицаПредв.ОсновноеСредство),
		|	СУММА(ВременнаяТаблицаПредв.Облагаемый),
		|	СУММА(ВременнаяТаблицаПредв.Необлагаемый),
		|	СУММА(ВременнаяТаблицаПредв.Льготный),
		|	СУММА(ВременнаяТаблицаПредв.Сумма)
		|ИЗ
		|	ВременнаяТаблицаПредв КАК ВременнаяТаблицаПредв
		|ГДЕ
		|	ВременнаяТаблицаПредв.КатегорияЗемель = ЗНАЧЕНИЕ(перечисление.КатегорииЗемель.Приусадебные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВременнаяТаблицаСвод.Количество1) КАК Количество1,
		|	СУММА(ВременнаяТаблицаСвод.КоличествоОблаг1) КАК КоличествоОблаг1,
		|	СУММА(ВременнаяТаблицаСвод.КоличествоНеоблаг1) КАК КоличествоНеоблаг1,
		|	СУММА(ВременнаяТаблицаСвод.КоличествоОсв1) КАК КоличествоОсв1,
		|	СУММА(ВременнаяТаблицаСвод.СуммаНалога1) КАК СуммаНалога1,
		|	СУММА(ВременнаяТаблицаСвод.Количество2) КАК Количество2,
		|	СУММА(ВременнаяТаблицаСвод.КоличествоОблаг2) КАК КоличествоОблаг2,
		|	СУММА(ВременнаяТаблицаСвод.КоличествоНеоблаг2) КАК КоличествоНеоблаг2,
		|	СУММА(ВременнаяТаблицаСвод.КоличествоОсв2) КАК КоличествоОсв2,
		|	СУММА(ВременнаяТаблицаСвод.СуммаНалога2) КАК СуммаНалога2,
		|	СУММА(ВременнаяТаблицаСвод.Количество3) КАК Количество3,
		|	СУММА(ВременнаяТаблицаСвод.КоличествоОблаг3) КАК КоличествоОблаг3,
		|	СУММА(ВременнаяТаблицаСвод.КоличествоНеоблаг3) КАК КоличествоНеоблаг3,
		|	СУММА(ВременнаяТаблицаСвод.КоличествоОсв3) КАК КоличествоОсв3,
		|	СУММА(ВременнаяТаблицаСвод.СуммаНалога3) КАК СуммаНалога3
		|ИЗ
		|	ВременнаяТаблицаСвод КАК ВременнаяТаблицаСвод";
		
		Запрос.УстановитьПараметр("Период", КонецМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
		
		Шапка = Запрос.Выполнить().Выбрать();
		
		Если Шапка.Следующий() Тогда 
			Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;		
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			ДанныеПечати = Новый Структура();
			                                                                       
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Заполнение шапки.
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Организация", ТекущийДокумент.Организация);
			СтруктураПараметров.Вставить("НачалоПериода", ТекущийДокумент.НачалоПериода);
			СтруктураПараметров.Вставить("КонецПериода", ТекущийДокумент.КонецПериода);
			
			СтруктураИтоги = Новый Структура();
			СтруктураИтоги.Вставить("ИтогоСуммаНалога", 0);

			ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
			
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Заполнение ячеек.
			ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
			ОбластьМакета.Параметры.Заполнить(Шапка);			
			СтруктураИтоги.ИтогоСуммаНалога = Шапка.СуммаНалога1 + Шапка.СуммаНалога2 + Шапка.СуммаНалога3;
			ОбластьМакета.Параметры.Заполнить(СтруктураИтоги);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение6_01ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения6_01(МассивОбъектов, ОбъектыПечати)	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение6_01";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение6_01");
	
	Для каждого  ТекущийДокумент Из МассивОбъектов Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка КАК Ссылка,
		|	ЗакрытиеМесяца.НомерСтроки КАК НомерСтроки,
		|	ЗакрытиеМесяца.ОсновноеСредство КАК ОсновноеСредство,
		|	ЗакрытиеМесяца.КатегорияЗемель КАК КатегорияЗемель,
		|	ЗакрытиеМесяца.КатегорияЗемель.Порядок КАК КатегорияЗемельПорядок,
		|	ЗакрытиеМесяца.Площадь КАК Площадь,
		|	ЗакрытиеМесяца.Ставка КАК Ставка,
		|	ЗакрытиеМесяца.КоличествоМесяцевЭксплуатации КАК КоличествоМесяцевЭксплуатации,
		|	ЗакрытиеМесяца.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаЗМ
		|ИЗ
		|	Документ.ЗакрытиеМесяца.ЗемельныйНалог КАК ЗакрытиеМесяца
		|ГДЕ
		|	ЗакрытиеМесяца.Ссылка.Организация = &Организация
		|	И ЗакрытиеМесяца.Ссылка.Проведен
		|	И КОНЕЦПЕРИОДА(ЗакрытиеМесяца.Ссылка.Дата, МЕСЯЦ) = &Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗМ.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаЗМ.НомерСтроки КАК НомерСтроки,
		|	ВременнаяТаблицаЗМ.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаЗМ.КатегорияЗемель КАК КатегорияЗемель,
		|	ВременнаяТаблицаЗМ.КатегорияЗемельПорядок КАК КатегорияЗемельПорядок,
		|	ВременнаяТаблицаЗМ.Площадь КАК Площадь,
		|	ВременнаяТаблицаЗМ.Ставка КАК Ставка,
		|	ВременнаяТаблицаЗМ.КоличествоМесяцевЭксплуатации КАК КоличествоМесяцевЭксплуатации,
		|	ВременнаяТаблицаЗМ.Сумма КАК СуммаНалога,
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.ВидЗемельногоУчастка КАК ВидЗемельногоУчастка,
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.КатегорияОбъектаИмущества КАК КатегорияОбъекта,
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.КодПользователяИмущества КАК КодПользователя,
		|	ПараметрыРасчетаЗемельногоНалога.КадастровыйНомер КАК КадастровыйНомер,
		|	ПараметрыРасчетаЗемельногоНалога.ГНС.Код КАК ГНСКод
		|ИЗ
		|	ВременнаяТаблицаЗМ КАК ВременнаяТаблицаЗМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаОСЗемельныйНалог.СрезПоследних(&Период, Организация = &Организация) КАК ПараметрыУчетаОСЗемельныйНалогСрезПоследних
		|		ПО ВременнаяТаблицаЗМ.ОсновноеСредство = ПараметрыУчетаОСЗемельныйНалогСрезПоследних.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыРасчетаЗемельногоНалога КАК ПараметрыРасчетаЗемельногоНалога
		|		ПО ВременнаяТаблицаЗМ.ОсновноеСредство = ПараметрыРасчетаЗемельногоНалога.ОсновноеСредство
		|			И ВременнаяТаблицаЗМ.Ссылка.Организация = ПараметрыРасчетаЗемельногоНалога.Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	КатегорияЗемельПорядок";

		Запрос.УстановитьПараметр("Период", КонецМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
		
		
		ДанныеПечати = Новый Структура();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", ТекущийДокумент.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", ТекущийДокумент.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", ТекущийДокумент.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		СтруктураИтоги = Новый Структура();
		СтруктураИтоги.Вставить("СуммаНалога", 	0);
		
		// Детали
		ОбластьМакета = Макет.ПолучитьОбласть("Детали");
		
		Шапка = Запрос.Выполнить().Выбрать();
		КоличествоСтрок = Шапка.Количество();

		Пока Шапка.Следующий() цикл
			
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				ДанныеПечатиСтроки = Новый Структура();

				КатегорияЗемель = "";
				Если Шапка.КатегорияЗемель = Перечисления.КатегорииЗемель.Сельхозугодья Тогда
					КатегорияЗемель = "С/Х";
				ИначеЕсли Шапка.КатегорияЗемель = Перечисления.КатегорииЗемель.Несельскохозяйственные Тогда 
					КатегорияЗемель = "НС/Х";
				Иначе 
					КатегорияЗемель = "ПП/С";
				КонецЕсли;
				
				ВидЗемельногоУчастка = "";
				Если Шапка.ВидЗемельногоУчастка = Перечисления.ВидыЗемельныхУчастков.ПашняОрошаемая Тогда
					ВидЗемельногоУчастка = "01";
				ИначеЕсли Шапка.ВидЗемельногоУчастка = Перечисления.ВидыЗемельныхУчастков.ПашняБогарная Тогда
					ВидЗемельногоУчастка = "02";
				ИначеЕсли Шапка.ВидЗемельногоУчастка = Перечисления.ВидыЗемельныхУчастков.МноголетниеНасаждения Тогда 
					ВидЗемельногоУчастка = "03";
				ИначеЕсли Шапка.ВидЗемельногоУчастка = Перечисления.ВидыЗемельныхУчастков.Сенокосы Тогда
					ВидЗемельногоУчастка = "04";
				ИначеЕсли Шапка.ВидЗемельногоУчастка = Перечисления.ВидыЗемельныхУчастков.Пастбища Тогда 
					ВидЗемельногоУчастка = "05";
				КонецЕсли;
				
				КодПользователя = "";
				Если Шапка.КодПользователя = Справочники.КодыПользователейИмущества.Собственник Тогда
					КодПользователя = "С";
				ИначеЕсли Шапка.КодПользователя = Справочники.КодыПользователейИмущества.ДолевойСобственник Тогда 
					КодПользователя = "ДС";
				ИначеЕсли Шапка.КодПользователя = Справочники.КодыПользователейИмущества.НеСобственник Тогда 
					КодПользователя = "НС";
				КонецЕсли;
				
				КатегорияОбъекта = "";
				Если Шапка.КатегорияОбъекта = Справочники.КатегорияОбъектаИмущества.О Тогда
					КатегорияОбъекта = "О";
				ИначеЕсли Шапка.КатегорияОбъекта = Справочники.КатегорияОбъектаИмущества.НО Тогда 
					КатегорияОбъекта = "Н/О";
				ИначеЕсли Шапка.КатегорияОбъекта = Справочники.КатегорияОбъектаИмущества.ЛО Тогда 
					КатегорияОбъекта = "Л/О";
				КонецЕсли;
								
				ДанныеПечатиСтроки.Вставить("КатегорияЗемель", КатегорияЗемель);
				ДанныеПечатиСтроки.Вставить("ВидЗемельногоУчастка", ВидЗемельногоУчастка);
				ДанныеПечатиСтроки.Вставить("КодПользователя", КодПользователя);
				ДанныеПечатиСтроки.Вставить("КатегорияОбъекта", КатегорияОбъекта);
				
				ОбластьМакета.Параметры.Заполнить(ДанныеПечатиСтроки);

				СтруктураИтоги.СуммаНалога 	= СтруктураИтоги.СуммаНалога + Шапка.СуммаНалога;
				ТабличныйДокумент.Вывести(ОбластьМакета);			
			//КонецЦикла;
		
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
		Для Сч = 1 По 28 - КоличествоСтрок Цикл
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		ОбластьМакета.Параметры.Заполнить(СтруктураИтоги);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение7ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения7(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение7";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение7");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение8ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения8(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение8";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение8");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение9ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения9(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение9";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение9");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение9ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения10(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ЕдинаяНалоговаяДекларация.Ссылка КАК Ссылка,
		|	ЕдинаяНалоговаяДекларация.Организация КАК Организация,
		|	ЕдинаяНалоговаяДекларация.НачалоПериода КАК НачалоПериода,
		|	ЕдинаяНалоговаяДекларация.КонецПериода КАК КонецПериода
		|ИЗ
		|	Документ.ЕдинаяНалоговаяДекларация КАК ЕдинаяНалоговаяДекларация
		|ГДЕ
		|	ЕдинаяНалоговаяДекларация.Ссылка В(&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение10";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение10");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", Шапка.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", Шапка.КонецПериода);
		
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение ячеек.
		ОбластьМакета = Макет.ПолучитьОбласть("Ячейки");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение9ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения11(МассивОбъектов, ОбъектыПечати)	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение11";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение11");
	
	Для каждого  ТекущийДокумент Из МассивОбъектов Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка КАК Ссылка,
		|	ЗакрытиеМесяца.Дата КАК Дата,
		|	ЗакрытиеМесяца.Организация КАК Организация,
		|	ПРЕДСТАВЛЕНИЕ(ЗакрытиеМесяца.Организация.ГНС.Код) КАК КодРайона,
		|	ЗакрытиеМесяца.Недвижимость.(
		|		ОсновноеСредство КАК ОсновноеСредство,
		|		ОсновноеСредство.ИдентификационныйНомерИмущества КАК ИдентификационныйКодИмущества,
		//|		ВЫБОР
		//|			КОГДА ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.НаименованиеПолное = """"
		//|				ТОГДА ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.МестонахождениеИмущества + "" ("" + ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.Наименование + "")""
		//|			ИНАЧЕ ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.МестонахождениеИмущества + "" ("" + ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.НаименованиеПолное + "")""
		//|		КОНЕЦ КАК МестонахождениеИмущества,
		|		КоличествоМесяцевЭксплуатации КАК КоличествоМесяцевВладения,
		|		Ставка КАК СтавкаНалога,
		|		СуммаНалога КАК СуммаНалога,
		|		ОценочнаяСтоимость КАК ОценочнаяСтоимостьМетр,
		|		ЖилаяПлощадь КАК ЖилаяПлощадь,
		|		МатериалСтен.Код КАК КодМатериала,
		|		Кр КАК Кр,
		|		Кз КАК Кз,
		|		Ко КАК Ко,
		|		ЗемельныйНалог КАК СуммаЗемельногоНалога,
		|		ВЫБОР
		|			КОГДА ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.ДатаВыпускаНедвижимости <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ГОД(ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.ДатаВыпускаНедвижимости)
		|			ИНАЧЕ ГОД(ЗакрытиеМесяца.Недвижимость.ДатаВводаВЭксплуатацию)
		|		КОНЕЦ КАК ГодВводаВЭксплуатацию
		|	) КАК Недвижимость
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	НЕ ЗакрытиеМесяца.ПометкаУдаления
		|	И ЗакрытиеМесяца.Организация = &Организация
		|	И ЗакрытиеМесяца.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗакрытиеМесяца.Недвижимость.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ2)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтчетПоНалогуНаИмущество.Приложение.(
		|		ГруппаИмущества КАК ГруппаИмущества,
		|		Январь КАК СуммаЗаЯнварь,
		|		Февраль КАК СуммаЗаФевраль,
		|		Март КАК СуммаЗаМарт,
		|		Апрель КАК СуммаЗаАпрель,
		|		Май КАК СуммаЗаМай,
		|		Июнь КАК СуммаЗаИюнь,
		|		Июль КАК СуммаЗаИюль,
		|		Август КАК СуммаЗаАвгуст,
		|		Сентябрь КАК СуммаЗаСентябрь,
		|		Октябрь КАК СуммаЗаОктябрь,
		|		Ноябрь КАК СуммаЗаНоябрь,
		|		Декабрь КАК СуммаЗаДекабрь
		|	) КАК Приложение
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество КАК ОтчетПоНалогуНаИмущество
		|ГДЕ
		|	НЕ ОтчетПоНалогуНаИмущество.ПометкаУдаления
		|	И ОтчетПоНалогуНаИмущество.Организация = &Организация
		|	И ОтчетПоНалогуНаИмущество.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОтчетПоНалогуНаИмущество.Приложение.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ2)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОбИмуществеСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	СведенияОбИмуществеСрезПоследних.КодИмущества.Код КАК КодВидаИмущества,
		|	СведенияОбИмуществеСрезПоследних.КодПользователяИмущества.Наименование КАК КодПользователяИмущества,
		|	СведенияОбИмуществеСрезПоследних.КодНазначенияИмущества.Код КАК КодНазначенияИмущества
		|ИЗ
		|	РегистрСведений.СведенияОбИмуществе.СрезПоследних(&КонецПериода, ) КАК СведенияОбИмуществеСрезПоследних";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущийДокумент.КонецПериода)); 
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		Шапка = МассивРезультатовЗапроса[0].Выбрать();
		Шапка.Следующий();
		
		СведенияОбИмуществе = МассивРезультатовЗапроса[2].Выбрать();
		СтруктураОтбора = Новый Структура;
		
		ДанныеПечати = Новый Структура();
		
		СтруктураИтоги = Новый Структура();
		СтруктураИтоги.Вставить("ИтогоСуммаНалога", 			0);
		СтруктураИтоги.Вставить("ИтогоСуммаЗемельногоНалога", 	0);
		СтруктураИтоги.Вставить("СуммаНалогаКУплате", 			0);
				
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", ТекущийДокумент.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", ТекущийДокумент.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", ТекущийДокумент.КонецПериода);
				
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		КоличествоСтрок = 0;
		ОбластьМакета = Макет.ПолучитьОбласть("Детали");

		Если Шапка.Количество() > 0 Тогда 
			ВыборкаНедвижимость = Шапка.Недвижимость.Выбрать();
			
			КоличествоСтрок = ВыборкаНедвижимость.Количество();
			Пока ВыборкаНедвижимость.Следующий() Цикл
				ОбластьМакета.Параметры.Заполнить(Шапка);
				ОбластьМакета.Параметры.Заполнить(ВыборкаНедвижимость);
				
				СтруктураОтбора.Вставить("ОсновноеСредство", ВыборкаНедвижимость.ОсновноеСредство);
				Пока СведенияОбИмуществе.НайтиСледующий(СтруктураОтбора) Цикл
					ОбластьМакета.Параметры.Заполнить(СведенияОбИмуществе);
				КонецЦикла;
				СведенияОбИмуществе.Сбросить();
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				СтруктураИтоги.ИтогоСуммаНалога 			= СтруктураИтоги.ИтогоСуммаНалога 			+ ВыборкаНедвижимость.СуммаНалога;
				СтруктураИтоги.ИтогоСуммаЗемельногоНалога 	= СтруктураИтоги.ИтогоСуммаЗемельногоНалога + ВыборкаНедвижимость.СуммаЗемельногоНалога;
				СтруктураИтоги.СуммаНалогаКУплате 			= СтруктураИтоги.ИтогоСуммаНалога - СтруктураИтоги.ИтогоСуммаЗемельногоНалога;				
			КонецЦикла;		
		КонецЕсли;	

		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
		Для Сч = 1 По 9 - КоличествоСтрок Цикл
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		ОбластьМакета.Параметры.Заполнить(СтруктураИтоги);
		
		ВыборкаОтчетПоНалогуНаИмущество = МассивРезультатовЗапроса[1].Выбрать();
		
		Если ВыборкаОтчетПоНалогуНаИмущество.Следующий() Тогда
			ВыборкаПриложение = ВыборкаОтчетПоНалогуНаИмущество.Приложение.Выбрать();			
			Если ВыборкаПриложение.Следующий() Тогда 
				ОбластьМакета.Параметры.Заполнить(ВыборкаПриложение);
			КонецЕсли;	
			ТабличныйДокумент.Вывести(ОбластьМакета);					
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;	
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение9ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения12(МассивОбъектов, ОбъектыПечати)	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение12";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение12");
	
	Для каждого  ТекущийДокумент Из МассивОбъектов Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка КАК Ссылка,
		|	ЗакрытиеМесяца.Дата КАК Дата,
		|	ЗакрытиеМесяца.Организация КАК Организация,
		|	ПРЕДСТАВЛЕНИЕ(ЗакрытиеМесяца.Организация.ГНС.Код) КАК КодРайона,
		|	ЗакрытиеМесяца.Недвижимость.(
		|		ОсновноеСредство КАК ОсновноеСредство,
		|		ОсновноеСредство.ИдентификационныйНомерИмущества КАК ИдентификационныйКодИмущества,
		//|		ВЫБОР
		//|			КОГДА ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.НаименованиеПолное = """"
		//|				ТОГДА ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.МестонахождениеИмущества + "" ("" + ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.Наименование + "")""
		//|			ИНАЧЕ ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.МестонахождениеИмущества + "" ("" + ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.НаименованиеПолное + "")""
		//|		КОНЕЦ КАК МестонахождениеИмущества,
		|		КоличествоМесяцевЭксплуатации КАК КоличествоМесяцевВладения,
		|		Ставка КАК СтавкаНалога,
		|		СуммаНалога КАК СуммаНалога,
		|		ОценочнаяСтоимость КАК ОценочнаяСтоимостьМетр,
		|		ЖилаяПлощадь КАК ЖилаяПлощадь,
		|		МатериалСтен.Код КАК КодМатериала,
		|		Кр КАК Кр,
		|		Кз КАК Кз,
		|		Ко КАК Ко,
		|		ЗемельныйНалог КАК СуммаЗемельногоНалога,
		|		ВЫБОР
		|			КОГДА ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.ДатаВыпускаНедвижимости <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ГОД(ЗакрытиеМесяца.Недвижимость.ОсновноеСредство.ДатаВыпускаНедвижимости)
		|			ИНАЧЕ ГОД(ЗакрытиеМесяца.Недвижимость.ДатаВводаВЭксплуатацию)
		|		КОНЕЦ КАК ГодВводаВЭксплуатацию
		|	) КАК Недвижимость
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	НЕ ЗакрытиеМесяца.ПометкаУдаления
		|	И ЗакрытиеМесяца.Организация = &Организация
		|	И ЗакрытиеМесяца.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗакрытиеМесяца.Недвижимость.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ3)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтчетПоНалогуНаИмущество.Приложение.(
		|		ГруппаИмущества КАК ГруппаИмущества,
		|		Январь КАК СуммаЗаЯнварь,
		|		Февраль КАК СуммаЗаФевраль,
		|		Март КАК СуммаЗаМарт,
		|		Апрель КАК СуммаЗаАпрель,
		|		Май КАК СуммаЗаМай,
		|		Июнь КАК СуммаЗаИюнь,
		|		Июль КАК СуммаЗаИюль,
		|		Август КАК СуммаЗаАвгуст,
		|		Сентябрь КАК СуммаЗаСентябрь,
		|		Октябрь КАК СуммаЗаОктябрь,
		|		Ноябрь КАК СуммаЗаНоябрь,
		|		Декабрь КАК СуммаЗаДекабрь
		|	) КАК Приложение
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество КАК ОтчетПоНалогуНаИмущество
		|ГДЕ
		|	НЕ ОтчетПоНалогуНаИмущество.ПометкаУдаления
		|	И ОтчетПоНалогуНаИмущество.Организация = &Организация
		|	И ОтчетПоНалогуНаИмущество.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОтчетПоНалогуНаИмущество.Приложение.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ3)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОбИмуществеСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	СведенияОбИмуществеСрезПоследних.КодИмущества.Код КАК КодВидаИмущества,
		|	СведенияОбИмуществеСрезПоследних.КодПользователяИмущества.Наименование КАК КодПользователяИмущества,
		|	СведенияОбИмуществеСрезПоследних.КодНазначенияИмущества.Код КАК КодНазначенияИмущества
		|ИЗ
		|	РегистрСведений.СведенияОбИмуществе.СрезПоследних(&КонецПериода, ) КАК СведенияОбИмуществеСрезПоследних";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущийДокумент.КонецПериода)); 
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		Шапка = МассивРезультатовЗапроса[0].Выбрать();
		Шапка.Следующий();
		
		СведенияОбИмуществе = МассивРезультатовЗапроса[2].Выбрать();
		СтруктураОтбора = Новый Структура;
		
		ДанныеПечати = Новый Структура();
		
		СтруктураИтоги = Новый Структура();
		СтруктураИтоги.Вставить("ИтогоСуммаНалога", 			0);
		СтруктураИтоги.Вставить("ИтогоСуммаЗемельногоНалога", 	0);
		СтруктураИтоги.Вставить("СуммаНалогаКУплате", 			0);
				
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", ТекущийДокумент.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", ТекущийДокумент.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", ТекущийДокумент.КонецПериода);
				
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		КоличествоСтрок = 0;
		ОбластьМакета = Макет.ПолучитьОбласть("Детали");

		Если Шапка.Количество() > 0 Тогда 
			ВыборкаНедвижимость = Шапка.Недвижимость.Выбрать();
			
			КоличествоСтрок = ВыборкаНедвижимость.Количество();
			Пока ВыборкаНедвижимость.Следующий() Цикл
				ОбластьМакета.Параметры.Заполнить(Шапка);
				ОбластьМакета.Параметры.Заполнить(ВыборкаНедвижимость);
				
				СтруктураОтбора.Вставить("ОсновноеСредство", ВыборкаНедвижимость.ОсновноеСредство);
				Пока СведенияОбИмуществе.НайтиСледующий(СтруктураОтбора) Цикл
					ОбластьМакета.Параметры.Заполнить(СведенияОбИмуществе);
				КонецЦикла;
				СведенияОбИмуществе.Сбросить();
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				СтруктураИтоги.ИтогоСуммаНалога 			= СтруктураИтоги.ИтогоСуммаНалога 			+ ВыборкаНедвижимость.СуммаНалога;
				СтруктураИтоги.ИтогоСуммаЗемельногоНалога 	= СтруктураИтоги.ИтогоСуммаЗемельногоНалога + ВыборкаНедвижимость.СуммаЗемельногоНалога;
				СтруктураИтоги.СуммаНалогаКУплате 			= СтруктураИтоги.ИтогоСуммаНалога - СтруктураИтоги.ИтогоСуммаЗемельногоНалога;				
			КонецЦикла;		
		КонецЕсли;	

		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
		Для Сч = 1 По 9 - КоличествоСтрок Цикл
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		ОбластьМакета.Параметры.Заполнить(СтруктураИтоги);
		
		ВыборкаОтчетПоНалогуНаИмущество = МассивРезультатовЗапроса[1].Выбрать();
		
		Если ВыборкаОтчетПоНалогуНаИмущество.Следующий() Тогда
			ВыборкаПриложение = ВыборкаОтчетПоНалогуНаИмущество.Приложение.Выбрать();			
			Если ВыборкаПриложение.Следующий() Тогда 
				ОбластьМакета.Параметры.Заполнить(ВыборкаПриложение);
			КонецЕсли;	
			ТабличныйДокумент.Вывести(ОбластьМакета);					
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение9ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения13(МассивОбъектов, ОбъектыПечати)	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение13";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение13");
	
	Для каждого  ТекущийДокумент Из МассивОбъектов Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка КАК Ссылка,
		|	ЗакрытиеМесяца.Организация КАК Организация,
		|	ЗакрытиеМесяца.Дата КАК Дата,
		|	ЗакрытиеМесяца.Организация.ГНС.Код КАК КодРайона,
		|	ЗакрытиеМесяца.Транспорт.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ОсновноеСредство КАК ОсновноеСредство,
		|		ВидТранспортаКатегорияАБВ КАК АБВ,
		|		ВидТранспорта.Код КАК КодВидаТранспорта,
		|		ВЫБОР
		|			КОГДА ГОД(ЗакрытиеМесяца.Транспорт.ОсновноеСредство.ДатаВыпускаТранспортногоСредства) <> 1
		|				ТОГДА ГОД(ЗакрытиеМесяца.Транспорт.ОсновноеСредство.ДатаВыпускаТранспортногоСредства)
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ГодВыпуска,
		|		ВЫБОР
		|			КОГДА ЗакрытиеМесяца.Транспорт.ВидТранспорта = &НесамоходныеТС
		|					ИЛИ ЗакрытиеМесяца.Транспорт.ВидТранспорта = &ДругиеТС
		|				ТОГДА ЗакрытиеМесяца.Транспорт.БалансоваяСтоимость
		|			ИНАЧЕ ЗакрытиеМесяца.Транспорт.ОбъемДвигателя
		|		КОНЕЦ КАК ОбъемДвигателя,
		|		Ставка КАК СтавкаНалога,
		|		СуммаНалога КАК СуммаНалога
		|	) КАК Транспорт
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	НЕ ЗакрытиеМесяца.ПометкаУдаления
		|	И ЗакрытиеМесяца.Организация = &Организация
		|	И ЗакрытиеМесяца.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОТранспортеСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	СведенияОТранспортеСрезПоследних.МаркаТранспортногоСредства КАК МаркаТранспортногоСредства,
		|	СведенияОТранспортеСрезПоследних.ГосНомер КАК ГосНомер,
		|	СведенияОТранспортеСрезПоследних.КодПользователяИмущества.Код КАК КодПользователяИмущества
		|ИЗ
		|	РегистрСведений.СведенияОТранспорте.СрезПоследних(&КонецПериода, ) КАК СведенияОТранспортеСрезПоследних";
		
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
		Запрос.УстановитьПараметр("НесамоходныеТС", Справочники.ВидыТранспортаНалогНаИмущество.НайтиПоНаименованию("Несамоходные"));
		Запрос.УстановитьПараметр("ДругиеТС", 		Справочники.ВидыТранспортаНалогНаИмущество.НайтиПоНаименованию("Другие"));
		
		МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
		Шапка = МассивРезультатовЗапроса[0].Выбрать();
		СведенияОТранспорте = МассивРезультатовЗапроса[1].Выбрать();
		СтруктураОтбора = Новый Структура;
		Шапка.Следующий();
		
		ДанныеПечати = Новый Структура();
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", ТекущийДокумент.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", ТекущийДокумент.НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода", ТекущийДокумент.КонецПериода);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Заполнение шапки.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ИтогиПоПриложению = Новый Структура();
		ИтогиПоПриложению.Вставить("СуммаНалога", 	0);
		
		// Детали
		КоличествоСтрок = 0;
		ОбластьМакета = Макет.ПолучитьОбласть("Детали");
		
		Если Шапка.Количество() > 0 Тогда 
			ВыборкаТранспорт = Шапка.Транспорт.Выбрать();
			КоличествоСтрок = ВыборкаТранспорт.Количество();
			Пока ВыборкаТранспорт.Следующий() Цикл
				
				ОбластьМакета.Параметры.Заполнить(Шапка);
				ОбластьМакета.Параметры.Заполнить(ВыборкаТранспорт);
				ИтогиПоПриложению.СуммаНалога 	= ИтогиПоПриложению.СуммаНалога + ВыборкаТранспорт.СуммаНалога;
				
				СтруктураОтбора.Вставить("ОсновноеСредство", ВыборкаТранспорт.ОсновноеСредство);
				Пока СведенияОТранспорте.НайтиСледующий(СтруктураОтбора) Цикл
					ОбластьМакета.Параметры.Заполнить(СведенияОТранспорте);
				КонецЦикла;
				СведенияОТранспорте.Сбросить();
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
		Для Сч = 1 По 13 - КоличествоСтрок Цикл
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итог");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,ИтогиПоПриложению);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение9ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения14(МассивОбъектов, ОбъектыПечати)	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение14";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение14");
	
	Для каждого  ТекущийДокумент Из МассивОбъектов Цикл
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
				
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка КАК Ссылка,
		|	ЗакрытиеМесяца.НомерСтроки КАК НомерСтроки,
		|	ЗакрытиеМесяца.ОсновноеСредство КАК ОсновноеСредство,
		|	ЗакрытиеМесяца.КатегорияЗемель КАК КатегорияЗемель,
		|	ЗакрытиеМесяца.КатегорияЗемель.Порядок КАК КатегорияЗемельПорядок,
		|	ЗакрытиеМесяца.Площадь КАК Площадь,
		|	ЗакрытиеМесяца.Ставка КАК Ставка,
		|	ЗакрытиеМесяца.КоличествоМесяцевЭксплуатации КАК КоличествоМесяцевЭксплуатации,
		|	ЗакрытиеМесяца.Сумма КАК Сумма,
		|	ЗакрытиеМесяца.Ки КАК Ки
		|ПОМЕСТИТЬ ВременнаяТаблицаЗМ
		|ИЗ
		|	Документ.ЗакрытиеМесяца.ЗемельныйНалог КАК ЗакрытиеМесяца
		|ГДЕ
		|	ЗакрытиеМесяца.Ссылка.Организация = &Организация
		|	И ЗакрытиеМесяца.Ссылка.Проведен
		|	И КОНЕЦПЕРИОДА(ЗакрытиеМесяца.Ссылка.Дата, МЕСЯЦ) = &Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗМ.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаЗМ.НомерСтроки КАК НомерСтроки,
		|	ВременнаяТаблицаЗМ.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаЗМ.КатегорияЗемель КАК КатегорияЗемель,
		|	ВременнаяТаблицаЗМ.КатегорияЗемельПорядок КАК КатегорияЗемельПорядок,
		|	ВременнаяТаблицаЗМ.Площадь КАК Площадь,
		|	ВременнаяТаблицаЗМ.Ставка КАК Ставка,
		|	ВременнаяТаблицаЗМ.КоличествоМесяцевЭксплуатации КАК КоличествоМесяцевЭксплуатации,
		|	ВременнаяТаблицаЗМ.Ки КАК Ки,
		|	ВременнаяТаблицаЗМ.Сумма КАК СуммаНалога,
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.ВидЗемельногоУчастка КАК ВидЗемельногоУчастка,
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.КатегорияОбъектаИмущества КАК КатегорияОбъекта,
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.КодПользователяИмущества КАК КодПользователя,
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.Область КАК Область,
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.Район КАК Район,
		|	ПараметрыРасчетаЗемельногоНалога.КадастровыйНомер КАК КадастровыйНомер,
		|	ПараметрыРасчетаЗемельногоНалога.ГНС КАК ГНС,
		|	ПараметрыРасчетаЗемельногоНалога.ГНС.Код КАК ГНСКод
		|ИЗ
		|	ВременнаяТаблицаЗМ КАК ВременнаяТаблицаЗМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаОСЗемельныйНалог.СрезПоследних(&Период, Организация = &Организация) КАК ПараметрыУчетаОСЗемельныйНалогСрезПоследних
		|		ПО ВременнаяТаблицаЗМ.ОсновноеСредство = ПараметрыУчетаОСЗемельныйНалогСрезПоследних.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыРасчетаЗемельногоНалога КАК ПараметрыРасчетаЗемельногоНалога
		|		ПО ВременнаяТаблицаЗМ.ОсновноеСредство = ПараметрыРасчетаЗемельногоНалога.ОсновноеСредство
		|			И ВременнаяТаблицаЗМ.Ссылка.Организация = ПараметрыРасчетаЗемельногоНалога.Организация
		|ГДЕ
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.КатегорияЗемель = ЗНАЧЕНИЕ(Перечисление.КатегорииЗемель.Сельхозугодья)
		|ИТОГИ ПО
		|	ГНСКод";
		
		Запрос.УстановитьПараметр("Период", КонецМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаГНСКод = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаГНСКод.Следующий() Цикл
			Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			ДанныеПечати = Новый Структура();
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Заполнение шапки.
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Организация", ТекущийДокумент.Организация);
			СтруктураПараметров.Вставить("НачалоПериода", ТекущийДокумент.НачалоПериода);
			СтруктураПараметров.Вставить("КонецПериода", ТекущийДокумент.КонецПериода);
			// ГНС Основного средства 
			СтруктураПараметров.Вставить("ГНСКодОС", ВыборкаГНСКод.ГНСКод);
			
			ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
					
			СтруктураИтоги = Новый Структура();
			СтруктураИтоги.Вставить("СуммаНалога", 	0);
			
			// Детали
			ОбластьМакета = Макет.ПолучитьОбласть("Детали");
			
			Шапка = ВыборкаГНСКод.Выбрать();
			КоличествоСтрок = Шапка.Количество();

			Пока Шапка.Следующий() Цикл
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				ВидЗемельногоУчастка = "";
				Если Шапка.ВидЗемельногоУчастка = Перечисления.ВидыЗемельныхУчастков.ПашняОрошаемая Тогда
					ВидЗемельногоУчастка = "01";
				ИначеЕсли Шапка.ВидЗемельногоУчастка = Перечисления.ВидыЗемельныхУчастков.ПашняБогарная Тогда
					ВидЗемельногоУчастка = "02";
				ИначеЕсли Шапка.ВидЗемельногоУчастка = Перечисления.ВидыЗемельныхУчастков.МноголетниеНасаждения Тогда 
					ВидЗемельногоУчастка = "03";
				ИначеЕсли Шапка.ВидЗемельногоУчастка = Перечисления.ВидыЗемельныхУчастков.Сенокосы Тогда
					ВидЗемельногоУчастка = "04";
				ИначеЕсли Шапка.ВидЗемельногоУчастка = Перечисления.ВидыЗемельныхУчастков.Пастбища Тогда 
					ВидЗемельногоУчастка = "05";
				КонецЕсли;
				
				КодПользователя = "";
				Если Шапка.КодПользователя = Справочники.КодыПользователейИмущества.Собственник Тогда
					КодПользователя = "С";
				ИначеЕсли Шапка.КодПользователя = Справочники.КодыПользователейИмущества.ДолевойСобственник Тогда 
					КодПользователя = "ДС";
				ИначеЕсли Шапка.КодПользователя = Справочники.КодыПользователейИмущества.НеСобственник Тогда  
					КодПользователя = "НС";
				КонецЕсли;
				
				КатегорияОбъекта = "";
				Если Шапка.КатегорияОбъекта = Справочники.КатегорияОбъектаИмущества.О Тогда
					КатегорияОбъекта = "О";
					ДанныеПечати.Вставить("ПлощадьО", Шапка.Площадь);
				ИначеЕсли Шапка.КатегорияОбъекта = Справочники.КатегорияОбъектаИмущества.НО Тогда 
					КатегорияОбъекта = "Н/О"; 		
					ДанныеПечати.Вставить("ПлощадьНО", Шапка.Площадь);
				ИначеЕсли Шапка.КатегорияОбъекта = Справочники.КатегорияОбъектаИмущества.ЛО Тогда 
					КатегорияОбъекта = "Л/О";
					ДанныеПечати.Вставить("ПлощадьЛ", Шапка.Площадь);
				КонецЕсли;
				
				ДанныеПечати.Вставить("ВидЗемельногоУчастка", ВидЗемельногоУчастка);
				ДанныеПечати.Вставить("КодПользователя", КодПользователя);
				ДанныеПечати.Вставить("КатегорияОбъекта", КатегорияОбъекта);
				
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				
				СтруктураИтоги.СуммаНалога 	= СтруктураИтоги.СуммаНалога + Шапка.СуммаНалога;
				ТабличныйДокумент.Вывести(ОбластьМакета);			
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
			Для Сч = 1 По 10 - КоличествоСтрок Цикл
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			ОбластьМакета.Параметры.Заполнить(СтруктураИтоги);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);	
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой Приложение9ПоНП
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложения15(МассивОбъектов, ОбъектыПечати)	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "ЕдинаяНалоговаяДекларация_Приложение15";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение15");
	
	Для каждого  ТекущийДокумент Из МассивОбъектов Цикл
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
				
		"ВЫБРАТЬ
		|	ЗакрытиеМесяца.Ссылка КАК Ссылка,
		|	ЗакрытиеМесяца.НомерСтроки КАК НомерСтроки,
		|	ЗакрытиеМесяца.ОсновноеСредство КАК ОсновноеСредство,
		|	ЗакрытиеМесяца.КатегорияЗемель КАК КатегорияЗемель,
		|	ЗакрытиеМесяца.КатегорияЗемель.Порядок КАК КатегорияЗемельПорядок,
		|	ЗакрытиеМесяца.Площадь КАК Площадь,
		|	ЗакрытиеМесяца.Ставка КАК Ставка,
		|	ЗакрытиеМесяца.КоличествоМесяцевЭксплуатации КАК КоличествоМесяцевЭксплуатации,
		|	ЗакрытиеМесяца.Сумма КАК Сумма,
		|	ЗакрытиеМесяца.Ки КАК Ки,
		|	ЗакрытиеМесяца.Кз КАК Кз,
		|	ЗакрытиеМесяца.Кк КАК Кк		
		|ПОМЕСТИТЬ ВременнаяТаблицаЗМ
		|ИЗ
		|	Документ.ЗакрытиеМесяца.ЗемельныйНалог КАК ЗакрытиеМесяца
		|ГДЕ
		|	ЗакрытиеМесяца.Ссылка.Организация = &Организация
		|	И ЗакрытиеМесяца.Ссылка.Проведен
		|	И КОНЕЦПЕРИОДА(ЗакрытиеМесяца.Ссылка.Дата, МЕСЯЦ) = &Период
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗМ.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаЗМ.НомерСтроки КАК НомерСтроки,
		|	ВременнаяТаблицаЗМ.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаЗМ.КатегорияЗемель КАК КатегорияЗемель,
		|	ВременнаяТаблицаЗМ.КатегорияЗемельПорядок КАК КатегорияЗемельПорядок,
		|	ВременнаяТаблицаЗМ.Площадь КАК Площадь,
		|	ВременнаяТаблицаЗМ.Ставка КАК Ставка,
		|	ВременнаяТаблицаЗМ.КоличествоМесяцевЭксплуатации КАК КоличествоМесяцевЭксплуатации,
		|	ВременнаяТаблицаЗМ.Ки КАК Ки,
		|	ВременнаяТаблицаЗМ.Кз КАК Кз,
		|	ВременнаяТаблицаЗМ.Кк КАК Кк,
		|	ВременнаяТаблицаЗМ.Сумма КАК СуммаНалога,
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.КатегорияОбъектаИмущества КАК КатегорияОбъекта,
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.КодПользователяИмущества КАК КодПользователя,
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.Область КАК Область,
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.Район КАК Район,
		|	ПараметрыРасчетаЗемельногоНалога.КадастровыйНомер КАК КадастровыйНомер,
		|	ПараметрыРасчетаЗемельногоНалога.ГНС КАК ГНС,
		|	ПараметрыРасчетаЗемельногоНалога.ГНС.Код КАК ГНСКод
		|ИЗ
		|	ВременнаяТаблицаЗМ КАК ВременнаяТаблицаЗМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыУчетаОСЗемельныйНалог.СрезПоследних(&Период, Организация = &Организация) КАК ПараметрыУчетаОСЗемельныйНалогСрезПоследних
		|		ПО ВременнаяТаблицаЗМ.ОсновноеСредство = ПараметрыУчетаОСЗемельныйНалогСрезПоследних.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыРасчетаЗемельногоНалога КАК ПараметрыРасчетаЗемельногоНалога
		|		ПО ВременнаяТаблицаЗМ.ОсновноеСредство = ПараметрыРасчетаЗемельногоНалога.ОсновноеСредство
		|			И ВременнаяТаблицаЗМ.Ссылка.Организация = ПараметрыРасчетаЗемельногоНалога.Организация
		|ГДЕ
		|	ПараметрыУчетаОСЗемельныйНалогСрезПоследних.КатегорияЗемель = ЗНАЧЕНИЕ(Перечисление.КатегорииЗемель.Несельскохозяйственные)
		|ИТОГИ ПО
		|	ГНСКод";
		
		Запрос.УстановитьПараметр("Период", КонецМесяца(ТекущийДокумент.КонецПериода));
		Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаГНСКод = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаГНСКод.Следующий() Цикл
			Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			ДанныеПечати = Новый Структура();
			
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			// Заполнение шапки.
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("Организация", ТекущийДокумент.Организация);
			СтруктураПараметров.Вставить("НачалоПериода", ТекущийДокумент.НачалоПериода);
			СтруктураПараметров.Вставить("КонецПериода", ТекущийДокумент.КонецПериода);
			// ГНС Основного средства 
			СтруктураПараметров.Вставить("ГНСКодОС", ВыборкаГНСКод.ГНСКод);
			
			ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати);	
			ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабличныйДокумент.Вывести(ОбластьМакета);
					
			СтруктураИтоги = Новый Структура();
			СтруктураИтоги.Вставить("СуммаНалога", 	0);
			
			// Детали
			ОбластьМакета = Макет.ПолучитьОбласть("Детали");
			
			Шапка = ВыборкаГНСКод.Выбрать();
			КоличествоСтрок = Шапка.Количество();

			Пока Шапка.Следующий() Цикл
				ОбластьМакета.Параметры.Заполнить(Шапка);
				
				КодПользователя = "";
				Если Шапка.КодПользователя = Справочники.КодыПользователейИмущества.Собственник Тогда
					КодПользователя = "С";
				ИначеЕсли Шапка.КодПользователя = Справочники.КодыПользователейИмущества.ДолевойСобственник Тогда 
					КодПользователя = "ДС";
				ИначеЕсли Шапка.КодПользователя = Справочники.КодыПользователейИмущества.НеСобственник Тогда  
					КодПользователя = "НС";
				КонецЕсли;
				
				КатегорияОбъекта = "";
				Если Шапка.КатегорияОбъекта = Справочники.КатегорияОбъектаИмущества.О Тогда
					КатегорияОбъекта = "О";
					ДанныеПечати.Вставить("ПлощадьО", Шапка.Площадь);
				ИначеЕсли Шапка.КатегорияОбъекта = Справочники.КатегорияОбъектаИмущества.НО Тогда 
					КатегорияОбъекта = "Н/О"; 		
					ДанныеПечати.Вставить("ПлощадьНО", Шапка.Площадь);
				ИначеЕсли Шапка.КатегорияОбъекта = Справочники.КатегорияОбъектаИмущества.ЛО Тогда 
					КатегорияОбъекта = "Л/О";
					ДанныеПечати.Вставить("ПлощадьЛ", Шапка.Площадь);
				КонецЕсли;
				
				ДанныеПечати.Вставить("КодПользователя", КодПользователя);
				ДанныеПечати.Вставить("КатегорияОбъекта", КатегорияОбъекта);
				
				ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
				
				СтруктураИтоги.СуммаНалога 	= СтруктураИтоги.СуммаНалога + Шапка.СуммаНалога;
				ТабличныйДокумент.Вывести(ОбластьМакета);			
				
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("ДеталиПусто");
			Для Сч = 1 По 10 - КоличествоСтрок Цикл
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			ОбластьМакета.Параметры.Заполнить(СтруктураИтоги);
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);	
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОсновнаяФормаОтчета") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ОсновнаяФормаОтчета", 
		НСтр("ru = 'Основная форма'"), 
		ПечатьОсновнойФормы(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_ОсновнаяФорма_STI_101");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение1") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение1", 
		НСтр("ru = 'Приложение 1'"), 
		ПечатьПриложения1(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение1");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение2", 
		НСтр("ru = 'Приложение 2'"), 
		ПечатьПриложения2(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение2");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение3") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение3", 
		НСтр("ru = 'Приложение 3'"), 
		ПечатьПриложения3(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение3");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение4") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение4", 
		НСтр("ru = 'Приложение 4'"), 
		ПечатьПриложения4(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение4");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение5") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение5", 
		НСтр("ru = 'Приложение 5'"), 
		ПечатьПриложения5(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение5");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение5_01") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение5_01", 
		НСтр("ru = 'Приложение 5 - 01'"), 
		ПечатьПриложения5_01(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение5_01");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение5_02") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение5_02", 
		НСтр("ru = 'Приложение 5 - 02'"), 
		ПечатьПриложения5_02(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоНалогуНаИмущество.ПФ_MXL_ЕНД_Приложение5_02");
	КонецЕсли;	

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение6") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение6", 
		НСтр("ru = 'Приложение 6'"), 
		ПечатьПриложения6(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение6");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение6_01") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение6_01", 
		НСтр("ru = 'Приложение 6 - 01'"), 
		ПечатьПриложения6_01(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение6_01");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение7") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение7", 
		НСтр("ru = 'Приложение 7'"), 
		ПечатьПриложения7(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение7");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение8") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение8", 
		НСтр("ru = 'Приложение 8'"), 
		ПечатьПриложения8(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение8");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение9") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение9", 
		НСтр("ru = 'Приложение 9'"), 
		ПечатьПриложения9(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение9");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение10") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение10", 
		НСтр("ru = 'Приложение 10'"), 
		ПечатьПриложения10(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение10");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение11") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение11", 
		НСтр("ru = 'Приложение 11'"), 
		ПечатьПриложения11(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение11");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение12") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение12", 
		НСтр("ru = 'Приложение 12'"), 
		ПечатьПриложения12(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение12");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение13") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение13", 
		НСтр("ru = 'Приложение 13'"), 
		ПечатьПриложения13(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение13");
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение14") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение14", 
		НСтр("ru = 'Приложение 14'"), 
		ПечатьПриложения14(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение14");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение15") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Приложение15", 
		НСтр("ru = 'Приложение 15'"), 
		ПечатьПриложения15(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ЕдинаяНалоговаяДекларация.ПФ_MXL_ЕНД_Приложение15");
	КонецЕсли;
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОсновнаяФормаОтчета";
	КомандаПечати.Представление = НСтр("ru = 'Основная форма'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение1";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 1 (Совокупный годовой доход)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение2";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 2 (Расходы, подлежащие вычету)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 3;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение3";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 3 (Необлагаемые доходы и доходы, обложенные у источника выплаты)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 4;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение4";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 4 (Прибыль, освобожденная от налога)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 5;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение5,Приложение5_01,Приложение5_02";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 5 (Налог на имущество)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 6;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение6,Приложение6_01";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 6 (Земельный налог)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 7;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение7";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 7 (Специальные налоговые режимы)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 8;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение8";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 8 (Горнодобывающее или горноперерабатывающее предприятие)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 9;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение9";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 9 (Расшифровка отдельных показателей экономической деятельности)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение10";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 10 (Расчет налога на имущество 1 группы)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 11;
			
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение11";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 11. Расчет налога на имущество 2 группы'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 12;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение12";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 12. Расчет налога на имущество 3 группы'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 13;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение13";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 13. Расчет налога на имущество 4 группы'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 14;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение14";            
	КомандаПечати.Представление = НСтр("ru = 'Приложение 14 (Расчет земельного налога за пользование землями сельскохозяйственного назначения)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 15;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение15";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 15 (Расчет земельного налога за пользование землями несельскохозяйственного назначения)'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 16;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОсновнаяФормаОтчета,Приложение1,Приложение2,Приложение3,Приложение4,Приложение5,Приложение5_01,Приложение5_02,Приложение6,Приложение6_01,Приложение7,Приложение8,Приложение9,Приложение10,Приложение11,Приложение12,Приложение13,Приложение14,Приложение15";
	КомандаПечати.Представление = НСтр("ru = 'Комплект документов'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 17;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Дополнить данные печати
//
// Параметры:
//  ДанныеПечати	 - Структура - 
//
Процедура ДополнитьДанныеПечати(СтруктураПараметров, ДанныеПечати)

	КонтактныеДанные = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСведенияОбОрганизации(СтруктураПараметров.Организация, СтруктураПараметров.КонецПериода);

	ДанныеПечати.Вставить("ОрганизацияНаменованиеПолное", КонтактныеДанные.НаименованиеПолное);
	ДанныеПечати.Вставить("Налоговая", КонтактныеДанные.ГНСНаименование);
	ДанныеПечати.Вставить("АдресГород", КонтактныеДанные.Город);
	ДанныеПечати.Вставить("АдресУлица", КонтактныеДанные.Улица);
	ДанныеПечати.Вставить("Телефон", КонтактныеДанные.Тел);
	
	ОКПО = КонтактныеДанные.ОКПО;
	ДанныеПечати.Вставить("ОКПО1", Сред(ОКПО,1,1));
	ДанныеПечати.Вставить("ОКПО2", Сред(ОКПО,2,1));
	ДанныеПечати.Вставить("ОКПО3", Сред(ОКПО,3,1));
	ДанныеПечати.Вставить("ОКПО4", Сред(ОКПО,4,1));
	ДанныеПечати.Вставить("ОКПО5", Сред(ОКПО,5,1));
	ДанныеПечати.Вставить("ОКПО6", Сред(ОКПО,6,1));
	ДанныеПечати.Вставить("ОКПО7", Сред(ОКПО,7,1));
	ДанныеПечати.Вставить("ОКПО8", Сред(ОКПО,8,1));

	ИНН = КонтактныеДанные.ИНН;
	ДанныеПечати.Вставить("ИНН1", Сред(ИНН, 1, 1));
	ДанныеПечати.Вставить("ИНН2", Сред(ИНН, 2, 1));
	ДанныеПечати.Вставить("ИНН3", Сред(ИНН, 3, 1));                           
	ДанныеПечати.Вставить("ИНН4", Сред(ИНН, 4, 1));
	ДанныеПечати.Вставить("ИНН5", Сред(ИНН, 5, 1));
	ДанныеПечати.Вставить("ИНН6", Сред(ИНН, 6, 1));
	ДанныеПечати.Вставить("ИНН7", Сред(ИНН, 7, 1));
	ДанныеПечати.Вставить("ИНН8", Сред(ИНН, 8, 1));
	ДанныеПечати.Вставить("ИНН9", Сред(ИНН, 9, 1));
	ДанныеПечати.Вставить("ИНН10", Сред(ИНН, 10, 1));
	ДанныеПечати.Вставить("ИНН11", Сред(ИНН, 11, 1));
	ДанныеПечати.Вставить("ИНН12", Сред(ИНН, 12, 1));
	ДанныеПечати.Вставить("ИНН13", Сред(ИНН, 13, 1));
	ДанныеПечати.Вставить("ИНН14", Сред(ИНН, 14, 1));         
	
	КодГНС = КонтактныеДанные.ГНСКод;
	ДанныеПечати.Вставить("ГНС1", Сред(КодГНС, 1, 1));
	ДанныеПечати.Вставить("ГНС2", Сред(КодГНС, 2, 1));
	ДанныеПечати.Вставить("ГНС3", Сред(КодГНС, 3, 1));
	
	// ГНС Основного средства 
	Если СтруктураПараметров.Свойство("ГНСКодОС") Тогда 
		КодГНС = СтруктураПараметров.ГНСКодОС;
	КонецЕсли;
	ДанныеПечати.Вставить("КодРайона1", Сред(КодГНС, 1, 1));
	ДанныеПечати.Вставить("КодРайона2", Сред(КодГНС, 2, 1));
	ДанныеПечати.Вставить("КодРайона3", Сред(КодГНС, 3, 1));	

	НачалоПериода = СтруктураПараметров.НачалоПериода;
	ДанныеПечати.Вставить("ДатаН1", Сред(НачалоПериода, 1, 1));	
	ДанныеПечати.Вставить("ДатаН2", Сред(НачалоПериода, 2, 1));	
	ДанныеПечати.Вставить("ДатаН3", Сред(НачалоПериода, 4, 1));	
	ДанныеПечати.Вставить("ДатаН4", Сред(НачалоПериода, 5, 1));	
	ДанныеПечати.Вставить("ДатаН5", Сред(НачалоПериода, 7, 1));	
	ДанныеПечати.Вставить("ДатаН6", Сред(НачалоПериода, 8, 1));	
	ДанныеПечати.Вставить("ДатаН7", Сред(НачалоПериода, 9, 1));	
	ДанныеПечати.Вставить("ДатаН8", Сред(НачалоПериода, 10, 1));	
	
	КонецПериода = СтруктураПараметров.КонецПериода;		
	ДанныеПечати.Вставить("ДатаК1", Сред(КонецПериода, 1, 1));	
	ДанныеПечати.Вставить("ДатаК2", Сред(КонецПериода, 2, 1));	
	ДанныеПечати.Вставить("ДатаК3", Сред(КонецПериода, 4, 1));	
	ДанныеПечати.Вставить("ДатаК4", Сред(КонецПериода, 5, 1));	
	ДанныеПечати.Вставить("ДатаК5", Сред(КонецПериода, 7, 1));	
	ДанныеПечати.Вставить("ДатаК6", Сред(КонецПериода, 8, 1));	
	ДанныеПечати.Вставить("ДатаК7", Сред(КонецПериода, 9, 1));	
	ДанныеПечати.Вставить("ДатаК8", Сред(КонецПериода, 10, 1));
	
	ДанныеПечати.Вставить("Год1", ДанныеПечати.ДатаК5);	
	ДанныеПечати.Вставить("Год2", ДанныеПечати.ДатаК6);	
	ДанныеПечати.Вставить("Год3", ДанныеПечати.ДатаК7);	
	ДанныеПечати.Вставить("Год4", ДанныеПечати.ДатаК8);
	
	Индекс = КонтактныеДанные.Индекс;
	ДанныеПечати.Вставить("ИНД1", Сред(Индекс, 1, 1));	
	ДанныеПечати.Вставить("ИНД2", Сред(Индекс, 2, 1));	
	ДанныеПечати.Вставить("ИНД3", Сред(Индекс, 4, 1));	
	ДанныеПечати.Вставить("ИНД4", Сред(Индекс, 5, 1));	
	ДанныеПечати.Вставить("ИНД5", Сред(Индекс, 7, 1));	
	ДанныеПечати.Вставить("ИНД6", Сред(Индекс, 8, 1));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли