#Область ПрограммныйИнтерфейс

// Вызывается при создании формы обработки ПечатьЭтикетокИЦенниковБПО.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма обработки
//
Процедура ФормаПечатьЭтикетокИЦенниковПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Вызывается при создании формы элемента ШаблоныЭтикетокИЦенниковБПО.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма обработки
//
Процедура ФормаШаблоныЭтикетокИЦенниковБПОПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Возвращает данные для построения шаблонов и печатных форм.
// 
// Параметры:
//  ПараметрыПечати - Структура - ПоляДляЗаполнения - Массив -
//  ПоляДляЗаполнения - Массив Из Структура - Поля для заполнения
// 
// Возвращаемое значение:
//  Массив из Структура - Данные для формирования печатных форм
Функция ДанныеДляФормированияПечатныхФорм(ПараметрыПечати, ПоляДляЗаполнения) Экспорт
	
	
	
КонецФункции

// Возвращает Макет стандартный схемы компоновки данных для обработки и печати данных.
//  Параметры:
//   ТипЦенника - Строка
// 
// Возвращаемое значение:
//  СхемаКомпоновкиДанных.
Функция МакетСхемыКомпоновкиДанных(ТипЦенника = "") Экспорт
	
	
	
КонецФункции

// При определении переопределения подбора товаров.
// 
// Параметры:
//  Использовать - Булево - Использовать
Процедура ПриОпределенииПереопределенияПодбораТоваров(Использовать) Экспорт
	
	Использовать = Ложь;
	
КонецПроцедуры

// При определении переопределения подбора по штрихкоду.
// 
// Параметры:
//  Использовать - Булево - Использовать
Процедура ПриОпределенииПереопределенияПодбораПоШтрихкоду(Использовать) Экспорт
	
	Использовать = Ложь;
	
КонецПроцедуры

// При определении переопределения работы с ТСД.
// 
// Параметры:
//  Использовать - Булево - Использовать
Процедура ПриОпределенииПереопределенияВыгрузкиВТСД(Использовать) Экспорт
	
	Использовать = Ложь;
	
КонецПроцедуры

// При определении переопределения отбора товаров.
// 
// Параметры:
//  Использовать - Булево - Использовать
Процедура ПриОпределенииПереопределенияОтбора(Использовать) Экспорт
	
	Использовать = Истина;
	
КонецПроцедуры

// Вызывается при изменении вида цены на форме.
// 
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма обработки
Процедура ПриИзмененииВидаЦены(Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти
