#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// Выделение основного элемента.	
	БухгалтерскийУчетСервер.ВыделитьЖирнымОсновнойЭлемент(БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"), Список);
	Список.Параметры.УстановитьЗначениеПараметра("ОсновнаяОрганизация", БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));

КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти
