
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьПоУмолчанию() Экспорт 
	
	// Заполнение ставок земельного налога
	ПериодЗаполнения = Дата(2022,1,1);
	
	НаборЗаписей = РегистрыСведений.СтавкиЗемельногоНалога.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ПериодЗаполнения);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ПериодЗаполнения;
	Запись.КатегорияЗемель = Перечисления.КатегорииЗемель.Сельхозугодья;
	Запись.Ставка = 0.01;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ПериодЗаполнения;
	Запись.КатегорияЗемель = Перечисления.КатегорииЗемель.Несельскохозяйственные;
	Запись.Ставка = 1;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ПериодЗаполнения;
	Запись.КатегорияЗемель = Перечисления.КатегорииЗемель.Приусадебные;
	Запись.Ставка = 1;
	
	Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей,, Истина, Истина);
	Исключение
	КонецПопытки;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли	
	
