#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыПроведенияДокумента

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	//// Подготовка данных	
	//Запрос = Новый Запрос;
	//Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	//Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ВременнаяТаблицаШапка.Ссылка КАК Регистратор,
	//	|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
	//	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	//	|	&Содержание КАК Содержание,
	//	|	ВременнаяТаблицаШапка.Склад КАК Склад,
	//	|	Неопределено КАК Контрагент
	//	|ИЗ
	//	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	""Товары"" КАК ИмяСписка,
	//	|	&СинонимСписка КАК СинонимСписка,
	//	|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
	//	|	ВременнаяТаблицаТовары.НомерСтроки КАК НомерСтроки,
	//	|	ВременнаяТаблицаТовары.СчетУчета КАК СчетУчета,
	//	|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
	//	|	ВременнаяТаблицаШапка.Склад КАК Склад,
	//	|	ВременнаяТаблицаШапка.ДокументОснование КАК ДокументОприходования,
	//	|	0 КАК Себестоимость,
	//	|	ВременнаяТаблицаТовары.Количество КАК Количество,
	//	|	НЕОПРЕДЕЛЕНО КАК КорСчетСписания,
	//	|	НЕОПРЕДЕЛЕНО КАК КорСубконто1,
	//	|	НЕОПРЕДЕЛЕНО КАК КорСубконто2,
	//	|	НЕОПРЕДЕЛЕНО КАК КорСубконто3
	//	|ИЗ
	//	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
	//	|		ПО (ИСТИНА)
	//	|ГДЕ
	//	|	НЕ ВременнаяТаблицаТовары.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МБП)
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	НомерСтроки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	""Товары"" КАК ИмяСписка,
	//	|	&СинонимСписка КАК СинонимСписка,
	//	|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
	//	|	ВременнаяТаблицаТовары.НомерСтроки КАК НомерСтроки,
	//	|	ВременнаяТаблицаТовары.СчетУчета КАК СчетУчета,
	//	|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
	//	|	ВременнаяТаблицаШапка.Склад КАК Склад,
	//	|	ВременнаяТаблицаШапка.ДокументОснование КАК ДокументОприходования,
	//	|	0 КАК Себестоимость,
	//	|	ВременнаяТаблицаТовары.Количество КАК Количество,
	//	|	НЕОПРЕДЕЛЕНО КАК КорСчетСписания,
	//	|	НЕОПРЕДЕЛЕНО КАК КорСубконто1,
	//	|	НЕОПРЕДЕЛЕНО КАК КорСубконто2,
	//	|	НЕОПРЕДЕЛЕНО КАК КорСубконто3
	//	|ИЗ
	//	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
	//	|		ПО (ИСТИНА)
	//	|ГДЕ
	//	|	ВременнаяТаблицаТовары.СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МБП)
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	НомерСтроки";
	//Запрос.УстановитьПараметр("Содержание", 	НСтр("ru = 'Списание товаров'")); 
	//Запрос.УстановитьПараметр("СинонимСписка", 	НСтр("ru = 'Товары'"));
	//МассивРезультатов = Запрос.ВыполнитьПакет();
	//
	//ТаблицаРеквизиты = МассивРезультатов[0].Выгрузить();
	//ТаблицаТовары 	 = МассивРезультатов[1].Выгрузить();
	//ТаблицаМБП 		 = МассивРезультатов[2].Выгрузить();
	//
	//ТаблицаСписанныеТовары 	= УчетТоваров.ПодготовитьТаблицуСписанныеТовары(ТаблицаТовары, ТаблицаРеквизиты, Ложь);
	//ТаблицаСписанныеМБП 	= УчетМБП.ПодготовитьТаблицуСписанныеМБП(ТаблицаМБП, ТаблицаРеквизиты, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаТовары.СчетУчета КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА (ВременнаяТаблицаТовары.Сумма + ВременнаяТаблицаТовары.СуммаНСП) * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаТовары.Сумма + ВременнаяТаблицаТовары.СуммаНСП
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = &ВалютаРегламентированногоУчета
		|				ИЛИ ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаТовары.Сумма + ВременнаяТаблицаТовары.СуммаНСП
		|		ИНАЧЕ ВременнаяТаблицаТовары.Всего
		|	КОНЕЦ КАК СуммаВалютная,
		|	ВЫБОР
		|		КОГДА &УказыватьПризнакЗачетаНДС
		|				И ВременнаяТаблицаТовары.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|							И НЕ ВременнаяТаблицаШапка.ВалютаДокумента = &ВалютаРегламентированногоУчета
		|						ТОГДА ВременнаяТаблицаТовары.Всего * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность - (ВременнаяТаблицаТовары.Сумма + ВременнаяТаблицаТовары.СуммаНСП) * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|					ИНАЧЕ ВременнаяТаблицаТовары.СуммаНДС
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА &УказыватьПризнакЗачетаНДС
		|				И ВременнаяТаблицаТовары.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|			ТОГДА ВременнаяТаблицаТовары.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСВалютная,
		|	ВременнаяТаблицаТовары.Количество КАК Количество,
		//|	ЛОЖЬ КАК ЕстьОстатокПоКоличеству,
		|	ВременнаяТаблицаТовары.ЗачетНДС КАК ЗачетНДС
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ПО (ИСТИНА)";
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", СтруктураДополнительныеСвойства.ДляПроведения.ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("УказыватьПризнакЗачетаНДС", 		СтруктураДополнительныеСвойства.УчетнаяПолитика.УказыватьПризнакЗачетаНДСПриПоступлении);
	
	ТаблицаНоменклатура = Запрос.Выполнить().Выгрузить();	
	
	//// Таблица, которая будет заполнена данными, после распределения.
	//ТаблицаРаспределенныхДанных = ТаблицаНоменклатура.СкопироватьКолонки();
	//ТаблицаКЭШ = ТаблицаНоменклатура.СкопироватьКолонки("Номенклатура,СчетУчета,Количество");
	//
	//Отбор = Новый Структура();
	//Отбор.Вставить("Номенклатура", 	Неопределено);
	//Отбор.Вставить("СчетУчета", 	Неопределено);
	//
	//Для Каждого СтрокаНоменклатуры Из ТаблицаНоменклатура Цикл
	//	
	//	Отбор.Номенклатура 	= СтрокаНоменклатуры.Номенклатура;
	//	Отбор.СчетУчета 	= СтрокаНоменклатуры.СчетУчета;
	//	
	//	НайденныеСтроки = ТаблицаСписанныеТовары.НайтиСтроки(Отбор);
	//	
	//	Если НайденныеСтроки.Количество() = 0 Тогда
	//		НайденныеСтроки = ТаблицаСписанныеМБП.НайтиСтроки(Отбор);	
	//	КонецЕсли;	
	//	
	//	// Количество остатка данной номенклатуры = 0
	//	Если НайденныеСтроки.Количество() = 0 Тогда
	//		
	//		НоваяСтрокаТаблицы = ТаблицаРаспределенныхДанных.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаНоменклатуры);
	//			
	//	// Количество остатка имеется
	//	Иначе
	//		Если НайденныеСтроки.Количество() = 1 Тогда
	//			КоличествоОстатка = НайденныеСтроки[0].Количество;
	//			
	//		Иначе
	//			НайденныеСтрокиКЭШ = ТаблицаКЭШ.НайтиСтроки(Отбор);
	//			
	//			Если НайденныеСтрокиКЭШ.Количество() = 0 Тогда
	//				КоличествоОстатка = 0;
	//				
	//				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
	//					КоличествоОстатка = КоличествоОстатка + НайденнаяСтрока.Количество;		
	//				КонецЦикла;	
	//				
	//				НоваяСтрокаКЭШ = ТаблицаКЭШ.Добавить();
	//				ЗаполнитьЗначенияСвойств(НоваяСтрокаКЭШ, Отбор);
	//				НоваяСтрокаКЭШ.Количество = КоличествоОстатка - СтрокаНоменклатуры.Количество;
	//				
	//			Иначе
	//				НайденнаяСтрокаКЭШ = НайденныеСтрокиКЭШ[0];
	//				
	//				Если НайденнаяСтрокаКЭШ.Количество <= 0 Тогда
	//					НоваяСтрокаТаблицы = ТаблицаРаспределенныхДанных.Добавить();
	//					ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаНоменклатуры);
	//					Продолжить;
	//				Иначе
	//					КоличествоОстатка = НайденнаяСтрокаКЭШ.Количество;
	//					НайденнаяСтрокаКЭШ.Количество = НайденнаяСтрокаКЭШ.Количество - СтрокаНоменклатуры.Количество;	
	//				КонецЕсли;	
	//			КонецЕсли;	
	//		КонецЕсли;	
	//		
	//		Если КоличествоОстатка >= СтрокаНоменклатуры.Количество Тогда
	//			
	//			НоваяСтрокаТаблицы = ТаблицаРаспределенныхДанных.Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаНоменклатуры);	
	//			НоваяСтрокаТаблицы.ЕстьОстатокПоКоличеству = Истина;
	//			
	//		Иначе
	//			Коэффициенты = Новый Массив();		
	//			// Первый коэффициент - количество, которое есть в остатке.
	//			Коэффициенты.Добавить(КоличествоОстатка);
	//			// Второй коэффициент - количество, которого нет в остатке.
	//			Коэффициенты.Добавить(СтрокаНоменклатуры.Количество - КоличествоОстатка);
	//			
	//			Массив_Сумма 			= ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
	//										СтрокаНоменклатуры.Сумма, Коэффициенты);
	//			Массив_СуммаВалютная 	= ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
	//										СтрокаНоменклатуры.СуммаВалютная, Коэффициенты);
	//			Массив_СуммаНДС 		= ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
	//										СтрокаНоменклатуры.СуммаНДС, Коэффициенты);
	//			Массив_СуммаНДСВалютная = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
	//										СтрокаНоменклатуры.СуммаНДСВалютная, Коэффициенты);											
	//																											
	//			// Строка с суммами, по которым есть количество остатка.											
	//			НоваяСтрокаТаблицы = ТаблицаРаспределенныхДанных.Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаНоменклатуры);	
	//			НоваяСтрокаТаблицы.Сумма 			= ?(Массив_Сумма = Неопределено, 0, Массив_Сумма[0]);
	//			НоваяСтрокаТаблицы.СуммаВалютная 	= ?(Массив_СуммаВалютная = Неопределено, 0, Массив_СуммаВалютная[0]);
	//			НоваяСтрокаТаблицы.СуммаНДС 		= ?(Массив_СуммаНДС = Неопределено, 0, Массив_СуммаНДС[0]);
	//			НоваяСтрокаТаблицы.СуммаНДСВалютная = ?(Массив_СуммаНДСВалютная = Неопределено, 0, Массив_СуммаНДСВалютная[0]);
	//			НоваяСтрокаТаблицы.ЕстьОстатокПоКоличеству = Истина;
	//			
	//			// Строка с суммами, по которым нет количество остатка.											
	//			НоваяСтрокаТаблицы = ТаблицаРаспределенныхДанных.Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаНоменклатуры);	
	//			НоваяСтрокаТаблицы.Сумма 			= ?(Массив_Сумма = Неопределено, 0, Массив_Сумма[1]);
	//			НоваяСтрокаТаблицы.СуммаВалютная 	= ?(Массив_СуммаВалютная = Неопределено, 0, Массив_СуммаВалютная[1]);
	//			НоваяСтрокаТаблицы.СуммаНДС 		= ?(Массив_СуммаНДС = Неопределено, 0, Массив_СуммаНДС[1]);
	//			НоваяСтрокаТаблицы.СуммаНДСВалютная = ?(Массив_СуммаНДСВалютная = Неопределено, 0, Массив_СуммаНДСВалютная[1]);
	//		КонецЕсли;	
	//	КонецЕсли;	
	//КонецЦикла;	
	//
	ТекстыЗапроса = Новый Массив;
	
	// 1. Товары
	// 2. НДС товары (себестоимость)
	// 3. Услуги
	// 4. ОС
	// 5. НДС товары (НЕ себестоимости)
	// 6. НДС услуги
	// 7. НДС услуги (Признак страны ЕАЭС и НЕ плательщик НДС)
	// 8. НДС ОС
	// 9. НДС ОС (Признак страны ЕАЭС и НЕ плательщик НДС)
	
	// Товары 
	// и НДС товары (себестоимость)
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаРаспределенныхДанных.Номенклатура КАК Номенклатура,
		|	ТаблицаРаспределенныхДанных.СчетУчета КАК СчетУчета,
		|	ТаблицаРаспределенныхДанных.Сумма КАК Сумма,
		|	ТаблицаРаспределенныхДанных.СуммаВалютная КАК СуммаВалютная,
		|	ТаблицаРаспределенныхДанных.СуммаНДС КАК СуммаНДС,
		|	ТаблицаРаспределенныхДанных.СуммаНДСВалютная КАК СуммаНДСВалютная,
		//|	ТаблицаРаспределенныхДанных.ЕстьОстатокПоКоличеству КАК ЕстьОстатокПоКоличеству,
		|	ТаблицаРаспределенныхДанных.ЗачетНДС КАК ЗачетНДС
		|ПОМЕСТИТЬ ВременнаяТаблицаРаспределенныеДанные
		|ИЗ
		|	&ТаблицаРаспределенныхДанных КАК ТаблицаРаспределенныхДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Порядок,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетРасчетов КАК СчетДт,
		|	ВременнаяТаблицаТовары.СчетУчета КАК СчетКт,
		|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаТовары.Номенклатура КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.Склад КАК СубконтоКт2,
		|	ВЫБОР
		|		КОГДА &ПартионныйУчет
		|			ТОГДА ВременнаяТаблицаШапка.ДокументОснование
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СубконтоКт3,
		|	-ВременнаяТаблицаРаспределенныеДанные.Сумма КАК Сумма,
		|	ВременнаяТаблицаШапка.ВалютаДокумента КАК ВалютаДт,
		|	-ВременнаяТаблицаРаспределенныеДанные.СуммаВалютная КАК ВалютнаяСуммаДт,
		|	ВременнаяТаблицаШапка.ВалютаДокумента КАК ВалютаКт,
		|	-ВременнаяТаблицаРаспределенныеДанные.СуммаВалютная КАК ВалютнаяСуммаКт,
		|	&СодержаниеТовары КАК Содержание,
		|	0 КАК КоличествоДт,
		|	0 КАК КоличествоКт
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРаспределенныеДанные КАК ВременнаяТаблицаРаспределенныеДанные
		|		ПО ВременнаяТаблицаТовары.Номенклатура = ВременнаяТаблицаРаспределенныеДанные.Номенклатура
		|			И ВременнаяТаблицаТовары.СчетУчета = ВременнаяТаблицаРаспределенныеДанные.СчетУчета
		|			И ВременнаяТаблицаТовары.ЗачетНДС = ВременнаяТаблицаРаспределенныеДанные.ЗачетНДС
		//|			И (ВременнаяТаблицаРаспределенныеДанные.ЕстьОстатокПоКоличеству)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		//|ВЫБРАТЬ
		//|	1,
		//|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		//|	ВременнаяТаблицаШапка.Организация,
		//|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукции),
		//|	ВременнаяТаблицаТовары.СчетУчета,
		//|	ВременнаяТаблицаТовары.Номенклатура,
		//|	НЕОПРЕДЕЛЕНО,
		//|	НЕОПРЕДЕЛЕНО,
		//|	ВременнаяТаблицаТовары.Номенклатура,
		//|	ВременнаяТаблицаШапка.Склад,
		//|	ВЫБОР
		//|		КОГДА &ПартионныйУчет
		//|			ТОГДА ВременнаяТаблицаШапка.ДокументОснование
		//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		//|	КОНЕЦ,
		//|	-ВременнаяТаблицаРаспределенныеДанные.Сумма,
		//|	ВременнаяТаблицаШапка.ВалютаДокумента,
		//|	-ВременнаяТаблицаРаспределенныеДанные.СуммаВалютная,
		//|	ВременнаяТаблицаШапка.ВалютаДокумента,
		//|	-ВременнаяТаблицаРаспределенныеДанные.СуммаВалютная,
		//|	&СодержаниеТовары,
		//|	0,
		//|	0
		//|ИЗ
		//|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		//|		ПО (ИСТИНА)
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРаспределенныеДанные КАК ВременнаяТаблицаРаспределенныеДанные
		//|		ПО ВременнаяТаблицаТовары.Номенклатура = ВременнаяТаблицаРаспределенныеДанные.Номенклатура
		//|			И ВременнаяТаблицаТовары.СчетУчета = ВременнаяТаблицаРаспределенныеДанные.СчетУчета
		//|			И ВременнаяТаблицаТовары.ЗачетНДС = ВременнаяТаблицаРаспределенныеДанные.ЗачетНДС
		//|			И (НЕ ВременнаяТаблицаРаспределенныеДанные.ЕстьОстатокПоКоличеству)
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.СчетРасчетов,
		|	ВременнаяТаблицаТовары.СчетУчета,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаТовары.Номенклатура,
		|	ВременнаяТаблицаШапка.Склад,
		|	ВЫБОР
		|		КОГДА &ПартионныйУчет
		|			ТОГДА ВременнаяТаблицаШапка.ДокументОснование
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	-ВременнаяТаблицаРаспределенныеДанные.СуммаНДС,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	-ВременнаяТаблицаРаспределенныеДанные.СуммаНДСВалютная,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	-ВременнаяТаблицаРаспределенныеДанные.СуммаНДСВалютная,
		|	&СодержаниеНДСВСебестоимость,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРаспределенныеДанные КАК ВременнаяТаблицаРаспределенныеДанные
		|		ПО ВременнаяТаблицаТовары.Номенклатура = ВременнаяТаблицаРаспределенныеДанные.Номенклатура
		|			И ВременнаяТаблицаТовары.СчетУчета = ВременнаяТаблицаРаспределенныеДанные.СчетУчета
		|			И ВременнаяТаблицаТовары.ЗачетНДС = ВременнаяТаблицаРаспределенныеДанные.ЗачетНДС
		//|			И (ВременнаяТаблицаРаспределенныеДанные.ЕстьОстатокПоКоличеству)
		|ГДЕ
		|	НЕ ВременнаяТаблицаРаспределенныеДанные.СуммаНДС = 0";
		
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	2,
		//|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		//|	ВременнаяТаблицаШапка.Организация,
		//|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукции),
		//|	ВременнаяТаблицаТовары.СчетУчета,
		//|	ВременнаяТаблицаТовары.Номенклатура,
		//|	НЕОПРЕДЕЛЕНО,
		//|	НЕОПРЕДЕЛЕНО,
		//|	ВременнаяТаблицаТовары.Номенклатура,
		//|	ВременнаяТаблицаШапка.Склад,
		//|	ВЫБОР
		//|		КОГДА &ПартионныйУчет
		//|			ТОГДА ВременнаяТаблицаШапка.ДокументОснование
		//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		//|	КОНЕЦ,
		//|	-ВременнаяТаблицаРаспределенныеДанные.СуммаНДС,
		//|	ВременнаяТаблицаШапка.ВалютаДокумента,
		//|	-ВременнаяТаблицаРаспределенныеДанные.СуммаНДСВалютная,
		//|	ВременнаяТаблицаШапка.ВалютаДокумента,
		//|	-ВременнаяТаблицаРаспределенныеДанные.СуммаНДСВалютная,
		//|	&СодержаниеНДСВСебестоимость,
		//|	0,
		//|	0
		//|ИЗ
		//|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		//|		ПО (ИСТИНА)
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаРаспределенныеДанные КАК ВременнаяТаблицаРаспределенныеДанные
		//|		ПО ВременнаяТаблицаТовары.Номенклатура = ВременнаяТаблицаРаспределенныеДанные.Номенклатура
		//|			И ВременнаяТаблицаТовары.СчетУчета = ВременнаяТаблицаРаспределенныеДанные.СчетУчета
		//|			И ВременнаяТаблицаТовары.ЗачетНДС = ВременнаяТаблицаРаспределенныеДанные.ЗачетНДС
		//|			И (НЕ ВременнаяТаблицаРаспределенныеДанные.ЕстьОстатокПоКоличеству)
		//|ГДЕ
		//|	НЕ ВременнаяТаблицаРаспределенныеДанные.СуммаНДС = 0";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
		
	// Услуги.
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	3 КАК Порядок,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,		
		//|	ВременнаяТаблицаШапка.СчетРасчетов КАК СчетДт,
		//|	ВременнаяТаблицаУслуги.СчетРасходов КАК СчетКт,		
		//|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоДт1,
		//|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК СубконтоДт2,
		//|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,		
		//|	ВременнаяТаблицаУслуги.Субконто1 КАК СубконтоКт1,
		//|	ВременнаяТаблицаУслуги.Субконто2 КАК СубконтоКт2,
		//|	ВременнаяТаблицаУслуги.Субконто3 КАК СубконтоКт3,		
		|	ВременнаяТаблицаУслуги.СчетРасходов КАК СчетДт,	
		|	ВременнаяТаблицаШапка.СчетРасчетов КАК СчетКт,		
		|	ВременнаяТаблицаУслуги.Субконто1 КАК СубконтоДт1,
		|	ВременнаяТаблицаУслуги.Субконто2 КАК СубконтоДт2,
		|	ВременнаяТаблицаУслуги.Субконто3 КАК СубконтоДт3,	
		|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА (ВременнаяТаблицаУслуги.Сумма + ВременнаяТаблицаУслуги.СуммаНСП) * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность - ВременнаяТаблицаУслуги.СуммаАкциза
		|		ИНАЧЕ ВременнаяТаблицаУслуги.Сумма + ВременнаяТаблицаУслуги.СуммаНСП - ВременнаяТаблицаУслуги.СуммаАкциза
		|	КОНЕЦ КАК Сумма,	
		|	ВременнаяТаблицаШапка.ВалютаДокумента КАК ВалютаДт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = &ВалютаРегламентированногоУчета
		|			ИЛИ ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаУслуги.Сумма + ВременнаяТаблицаУслуги.СуммаНСП
		|		ИНАЧЕ ВременнаяТаблицаУслуги.Всего
		|	КОНЕЦ КАК ВалютнаяСуммаДт,
		|	ВременнаяТаблицаШапка.ВалютаДокумента КАК ВалютаКт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = &ВалютаРегламентированногоУчета
		|			ИЛИ ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаУслуги.Сумма + ВременнаяТаблицаУслуги.СуммаНСП
		|		ИНАЧЕ ВременнаяТаблицаУслуги.Всего
		|	КОНЕЦ КАК ВалютнаяСуммаКт,
		|	&СодержаниеУслуги КАК Содержание,
		|	0 КАК КоличествоДт,
		|	0 КАК КоличествоКт
		|ИЗ
		|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// ОС.
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	4 КАК Порядок,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.СчетРасчетов КАК СчетДт,
		|	ВременнаяТаблицаОС.СчетУчета КАК СчетКт,
		|	ВременнаяТаблицаШапка.Контрагент КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаОС.ОсновноеСредство КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	-ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА (ВременнаяТаблицаОС.Сумма + ВременнаяТаблицаОС.СуммаНСП) * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность - ВременнаяТаблицаОС.СуммаАкциза
		|		ИНАЧЕ ВременнаяТаблицаОС.Сумма + ВременнаяТаблицаОС.СуммаНСП - ВременнаяТаблицаОС.СуммаАкциза
		|	КОНЕЦ КАК Сумма,
		|	ВременнаяТаблицаШапка.ВалютаДокумента КАК ВалютаДт,
		|	-ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = &ВалютаРегламентированногоУчета
		|				ИЛИ ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаОС.Сумма + ВременнаяТаблицаОС.СуммаНСП
		|		ИНАЧЕ ВременнаяТаблицаОС.Всего
		|	КОНЕЦ КАК ВалютнаяСуммаДт,
		|	ВременнаяТаблицаШапка.ВалютаДокумента КАК ВалютаКт,
		|	-ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = &ВалютаРегламентированногоУчета
		|				ИЛИ ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаОС.Сумма + ВременнаяТаблицаОС.СуммаНСП
		|		ИНАЧЕ ВременнаяТаблицаОС.Всего
		|	КОНЕЦ КАК ВалютнаяСуммаКт,
		|	&СодержаниеОС КАК Содержание,
		|	0 КАК КоличествоДт,
		|	0 КАК КоличествоКт
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаОС.Сумма = 0
		|	И НЕ ВременнаяТаблицаОС.ОсновноеСредство В
		|				(ВЫБРАТЬ
		|					ВременнаяТаблицаСписанныеОС.ОсновноеСредство
		|				ИЗ
		|					ВременнаяТаблицаСписанныеОС)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Организация,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованнойПродукции),
		|	ВременнаяТаблицаОС.СчетУчета,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаОС.ОсновноеСредство,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	-ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА (ВременнаяТаблицаОС.Сумма + ВременнаяТаблицаОС.СуммаНСП) * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность - ВременнаяТаблицаОС.СуммаАкциза
		|		ИНАЧЕ ВременнаяТаблицаОС.Сумма + ВременнаяТаблицаОС.СуммаНСП - ВременнаяТаблицаОС.СуммаАкциза
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	-ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = &ВалютаРегламентированногоУчета
		|				ИЛИ ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаОС.Сумма + ВременнаяТаблицаОС.СуммаНСП
		|		ИНАЧЕ ВременнаяТаблицаОС.Всего
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.ВалютаДокумента,
		|	-ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ВалютаДокумента = &ВалютаРегламентированногоУчета
		|				ИЛИ ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаОС.Сумма + ВременнаяТаблицаОС.СуммаНСП
		|		ИНАЧЕ ВременнаяТаблицаОС.Всего
		|	КОНЕЦ,
		|	&СодержаниеОС,
		|	0,
		|	0
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	НЕ ВременнаяТаблицаОС.Сумма = 0
		|	И ВременнаяТаблицаОС.ОсновноеСредство В
		|			(ВЫБРАТЬ
		|				ВременнаяТаблицаСписанныеОС.ОсновноеСредство
		|			ИЗ
		|				ВременнаяТаблицаСписанныеОС)";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	                                                   
	// НДС товары.
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	5 КАК Порядок,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|	КОНЕЦ КАК СчетДт,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению) КАК СчетКт,		
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|	КОНЕЦ КАК СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|	КОНЕЦ КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	-СУММА(ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			И НЕ ВременнаяТаблицаШапка.ВалютаДокумента = &ВалютаРегламентированногоУчета
		|			ТОГДА (ВременнаяТаблицаТовары.Всего * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность) - ((ВременнаяТаблицаТовары.Сумма + ВременнаяТаблицаТовары.СуммаНСП) * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность)
		|		ИНАЧЕ ВременнаяТаблицаТовары.СуммаНДС
		|	КОНЕЦ) КАК Сумма,			
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ КАК ВалютаДт,
		|	-СУММА(ВременнаяТаблицаТовары.СуммаНДС) КАК ВалютнаяСуммаДт,		
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ КАК ВалютаКт,
		|	-СУММА(ВременнаяТаблицаТовары.СуммаНДС) КАК ВалютнаяСуммаКт,
		|	&СодержаниеНДС КАК Содержание,
		|	0 КАК КоличествоДт,
		|	0 КАК КоличествоКт
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					И ВременнаяТаблицаШапка.ПлательщикНДС
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВременнаяТаблицаШапка.ПлательщикНДС
		|		КОНЕЦ
		|	И НЕ ВременнаяТаблицаТовары.СуммаНДС = 0
		|	И ВЫБОР
		|			КОГДА &УказыватьПризнакЗачетаНДС
		|				ТОГДА НЕ ВременнаяТаблицаТовары.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению),
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА &ВалютаРегламентированногоУчета
		|		ИНАЧЕ ВременнаяТаблицаШапка.ВалютаДокумента
		|	КОНЕЦ,
		|	ВременнаяТаблицаТовары.ЗачетНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА &ВалютаРегламентированногоУчета
		|		ИНАЧЕ ВременнаяТаблицаШапка.ВалютаДокумента
		|	КОНЕЦ,		
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// НДС услуги.
	ТекстЗапроса =
		
		"ВЫБРАТЬ
		|	6 КАК Порядок,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		//|	ВЫБОР
		//|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		//|			ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		//|		ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		//|	КОНЕЦ КАК СчетДт,
		//|	ВЫБОР
		//|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		//|				И &УказыватьПризнакЗачетаНДС
		//|			ТОГДА ВременнаяТаблицаУслуги.СчетРасходов
		//|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению)
		//|	КОНЕЦ КАК СчетКт,
		//|	ВЫБОР
		//|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		//|			ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		//|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		//|	КОНЕЦ КАК СубконтоДт1,
		//|	ВЫБОР
		//|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		//|			ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		//|		ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		//|	КОНЕЦ КАК СубконтоДт2,
		//|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		//|	ВЫБОР
		//|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		//|				И &УказыватьПризнакЗачетаНДС
		//|			ТОГДА ВременнаяТаблицаУслуги.Субконто1
		//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		//|	КОНЕЦ КАК СубконтоКт1,
		//|	ВЫБОР
		//|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		//|				И &УказыватьПризнакЗачетаНДС
		//|			ТОГДА ВременнаяТаблицаУслуги.Субконто2
		//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		//|	КОНЕЦ КАК СубконтоКт2,
		//|	ВЫБОР
		//|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		//|				И &УказыватьПризнакЗачетаНДС
		//|			ТОГДА ВременнаяТаблицаУслуги.Субконто3
		//|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		//|	КОНЕЦ КАК СубконтоКт3,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаУслуги.СчетРасходов
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению)
		|	КОНЕЦ КАК СчетДт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|	КОНЕЦ КАК СчетКт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаУслуги.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаУслуги.Субконто2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СубконтоДт2,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаУслуги.Субконто3
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СубконтоДт3,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|	КОНЕЦ КАК СубконтоКт1,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|	КОНЕЦ КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,	
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|					И НЕ ВременнаяТаблицаШапка.ВалютаДокумента = &ВалютаРегламентированногоУчета
		|				ТОГДА ВременнаяТаблицаУслуги.Всего * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность - (ВременнаяТаблицаУслуги.Сумма + ВременнаяТаблицаУслуги.СуммаНСП) * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|			ИНАЧЕ ВременнаяТаблицаУслуги.СуммаНДС
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ КАК ВалютаДт,
		|	СУММА(ВременнаяТаблицаУслуги.СуммаНДС) КАК ВалютнаяСуммаДт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ КАК ВалютаКт,
		|	СУММА(ВременнаяТаблицаУслуги.СуммаНДС) КАК ВалютнаяСуммаКт,
		|	ВЫБОР
		|		КОГДА &УказыватьПризнакЗачетаНДС
		|				И ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|			ТОГДА &СодержаниеНДСВСебестоимость
		|		ИНАЧЕ &СодержаниеНДС
		|	КОНЕЦ КАК Содержание,
		|	0 КАК КоличествоДт,
		|	0 КАК КоличествоКт
		|ИЗ
		|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|					И ВременнаяТаблицаШапка.ПлательщикНДС
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВременнаяТаблицаШапка.ПлательщикНДС
		|		КОНЕЦ
		|	И НЕ ВременнаяТаблицаУслуги.СуммаНДС = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаУслуги.СчетРасходов
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА &ВалютаРегламентированногоУчета
		|		ИНАЧЕ ВременнаяТаблицаШапка.ВалютаДокумента
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА &ВалютаРегламентированногоУчета
		|		ИНАЧЕ ВременнаяТаблицаШапка.ВалютаДокумента
		|	КОНЕЦ,
		|	ВременнаяТаблицаУслуги.Субконто1,
		|	ВременнаяТаблицаУслуги.Субконто2,
		|	ВременнаяТаблицаУслуги.Субконто3,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаУслуги.Субконто1
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаУслуги.Субконто2
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаУслуги.Субконто3
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &УказыватьПризнакЗачетаНДС
		|				И ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|			ТОГДА &СодержаниеНДСВСебестоимость
		|		ИНАЧЕ &СодержаниеНДС
		|	КОНЕЦ";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// НДС услуги (Признак страны ЕАЭС и НЕ плательщик НДС).
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	7 КАК Порядок,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		//|	ВременнаяТаблицаШапка.СчетРасчетовГНС КАК СчетДт,
		//|	ВременнаяТаблицаУслуги.СчетРасходов КАК СчетКт,
		//|	ВременнаяТаблицаШапка.КонтрагентГНС КАК СубконтоДт1,
		//|	ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС КАК СубконтоДт2,
		//|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		//|	ВременнаяТаблицаУслуги.Субконто1 КАК СубконтоКт1,
		//|	ВременнаяТаблицаУслуги.Субконто2 КАК СубконтоКт2,
		//|	ВременнаяТаблицаУслуги.Субконто3 КАК СубконтоКт3,
		|	ВременнаяТаблицаУслуги.СчетРасходов КАК СчетДт,
		|	ВременнаяТаблицаШапка.СчетРасчетовГНС КАК СчетКт,
		|	ВременнаяТаблицаУслуги.Субконто1 КАК СубконтоДт1,
		|	ВременнаяТаблицаУслуги.Субконто2 КАК СубконтоДт2,
		|	ВременнаяТаблицаУслуги.Субконто3 КАК СубконтоДт3,
		|	ВременнаяТаблицаШапка.КонтрагентГНС КАК СубконтоКт1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ВременнаяТаблицаУслуги.СуммаНДС КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	ВременнаяТаблицаУслуги.СуммаНДС КАК ВалютнаяСуммаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	ВременнаяТаблицаУслуги.СуммаНДС КАК ВалютнаяСуммаКт,
		|	&СодержаниеНДС КАК Содержание,
		|	0 КАК КоличествоДт,
		|	0 КАК КоличествоКт
		|ИЗ
		|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|	И НЕ ВременнаяТаблицаШапка.ПлательщикНДС
		|	И НЕ ВременнаяТаблицаУслуги.СуммаНДС = 0
		|	И ВЫБОР
		|			КОГДА &УказыватьПризнакЗачетаНДС
		|				ТОГДА НЕ ВременнаяТаблицаУслуги.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// НДС ОС.
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	8 КАК Порядок,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|	КОНЕЦ КАК СчетДт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаОС.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаОС.СчетУчета
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению)
		|	КОНЕЦ КАК СчетКт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|	КОНЕЦ КАК СубконтоДт1,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|	КОНЕЦ КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаОС.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаОС.ОсновноеСредство
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	-СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|					И НЕ ВременнаяТаблицаШапка.ВалютаДокумента = &ВалютаРегламентированногоУчета
		|				ТОГДА ВременнаяТаблицаОС.Всего * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность - (ВременнаяТаблицаОС.Сумма + ВременнаяТаблицаОС.СуммаНСП) * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|			ИНАЧЕ ВременнаяТаблицаОС.СуммаНДС
		|		КОНЕЦ) КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ КАК ВалютаДт,
		|	-СУММА(ВременнаяТаблицаОС.СуммаНДС) КАК ВалютнаяСуммаДт,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ КАК ВалютаКт,
		|	-СУММА(ВременнаяТаблицаОС.СуммаНДС) КАК ВалютнаяСуммаКт,
		|	ВЫБОР
		|		КОГДА &УказыватьПризнакЗачетаНДС
		|				И ВременнаяТаблицаОС.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|			ТОГДА &СодержаниеНДСВСебестоимость
		|		ИНАЧЕ &СодержаниеНДС
		|	КОНЕЦ КАК Содержание,
		|	0 КАК КоличествоДт,
		|	0 КАК КоличествоКт
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПлательщикНДС
		|	И НЕ ВременнаяТаблицаОС.СуммаНДС = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.СчетРасчетовГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.СчетРасчетов
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.КонтрагентГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.Контрагент
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС
		|		ИНАЧЕ ВременнаяТаблицаШапка.ДоговорКонтрагента
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаОС.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаОС.СчетУчета
		|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС_ПодлежащийВозмещению)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА &ВалютаРегламентированногоУчета
		|		ИНАЧЕ ВременнаяТаблицаШапка.ВалютаДокумента
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА &ВалютаРегламентированногоУчета
		|		ИНАЧЕ ВременнаяТаблицаШапка.ВалютаДокумента
		|	КОНЕЦ,
		|	ВременнаяТаблицаОС.ОсновноеСредство,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаОС.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|				И &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаОС.ОсновноеСредство
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаШапка.ВалютаДокумента
		|		ИНАЧЕ &ВалютаРегламентированногоУчета
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &УказыватьПризнакЗачетаНДС
		|				И ВременнаяТаблицаОС.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|			ТОГДА &СодержаниеНДСВСебестоимость
		|		ИНАЧЕ &СодержаниеНДС
		|	КОНЕЦ";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
	
	// НДС ОС (Признак страны ЕАЭС и НЕ плательщик НДС).
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	9 КАК Порядок,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,		
		|	ВременнаяТаблицаШапка.СчетРасчетовГНС КАК СчетДт,
		|	ВременнаяТаблицаОС.СчетУчета КАК СчетКт,		
		|	ВременнаяТаблицаШапка.КонтрагентГНС КАК СубконтоДт1,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагентаГНС КАК СубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ВременнаяТаблицаОС.ОсновноеСредство КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	-ВременнаяТаблицаОС.СуммаНДС КАК Сумма,
		|	&ВалютаРегламентированногоУчета КАК ВалютаДт,
		|	-ВременнаяТаблицаОС.СуммаНДС КАК ВалютнаяСуммаДт,
		|	&ВалютаРегламентированногоУчета КАК ВалютаКт,
		|	-ВременнаяТаблицаОС.СуммаНДС КАК ВалютнаяСуммаКт,
		|	&СодержаниеНДС КАК Содержание,
		|	0 КАК КоличествоДт,
		|	0 КАК КоличествоКт
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|	И НЕ ВременнаяТаблицаШапка.ПлательщикНДС
		|	И НЕ ВременнаяТаблицаОС.СуммаНДС = 0
		|	И ВЫБОР
		|			КОГДА &УказыватьПризнакЗачетаНДС
		|				ТОГДА НЕ ВременнаяТаблицаОС.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Себестоимость)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	ТекстыЗапроса.Добавить(ТекстЗапроса);
		
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ТекстыЗапроса, Символы.ПС + " ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС);
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТаблицаРаспределенныхДанных", 		ТаблицаНоменклатура); //ТаблицаРаспределенныхДанных);
	Запрос.УстановитьПараметр("СодержаниеТовары", 					НСтр("ru = 'Поступление товаров'"));
	Запрос.УстановитьПараметр("ПартионныйУчет", 					СтруктураДополнительныеСвойства.УчетнаяПолитика.СпособОценкиТМЗ 
																		= Перечисления.СпособыОценки.ФИФО);	
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", 	СтруктураДополнительныеСвойства.ДляПроведения.ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ПлательщикНДС", 						СтруктураДополнительныеСвойства.УчетнаяПолитика.ПлательщикНДС);
	Запрос.УстановитьПараметр("СодержаниеУслуги", 					НСтр("ru = 'Поступление услуг'")); 
	Запрос.УстановитьПараметр("СодержаниеОС", 						НСтр("ru = 'Поступление ОС'")); 
	Запрос.УстановитьПараметр("СодержаниеРасходыБудущихПериодов", 	НСтр("ru = 'Расходы будущих периодов'")); 
	Запрос.УстановитьПараметр("СодержаниеНДС", 						НСтр("ru = 'НДС'"));
	Запрос.УстановитьПараметр("СодержаниеНДСВСебестоимость", 		НСтр("ru = 'НДС в себестоимость'"));
	Запрос.УстановитьПараметр("УказыватьПризнакЗачетаНДС", 			СтруктураДополнительныеСвойства.УчетнаяПолитика.УказыватьПризнакЗачетаНДСПриПоступлении);
	Запрос.УстановитьПараметр("ПлательщикНДС", 						СтруктураДополнительныеСвойства.УчетнаяПолитика.ПлательщикНДС);
		
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаХозрасчетный", Запрос.Выполнить().Выгрузить());
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПоступлениеТоваров(ДокументСсылка, СтруктураДополнительныеСвойства) 
	                   
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК Договор,
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаШапка.БезналичныйРасчет КАК БезналичныйРасчет,
		|	ВременнаяТаблицаШапка.Склад КАК Склад,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС КАК ЗначениеСтавкиНДС,
		|	ВременнаяТаблицаТовары.ЗначениеСтавкиНСП КАК ЗначениеСтавкиНСП,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|				ИЛИ НЕ &УказыватьПризнакЗачетаНДС
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.ПустаяСсылка)
		|		ИНАЧЕ ВременнаяТаблицаТовары.ЗачетНДС
		|	КОНЕЦ КАК ЗачетНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаТовары.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаТовары.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаТовары.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаТовары.СуммаНДС
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаТовары.СуммаНСП * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаТовары.СуммаНСП
		|	КОНЕЦ КАК СуммаНСП,
		|	0 КАК Количество
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	&Основание_ПоступлениеТоваров
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
		|	ВременнаяТаблицаУслуги.Номенклатура,
		|	ВременнаяТаблицаШапка.БезналичныйРасчет,
		|	ВременнаяТаблицаШапка.Склад,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС,
		|	ВременнаяТаблицаУслуги.ЗначениеСтавкиНСП,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|				ИЛИ НЕ &УказыватьПризнакЗачетаНДС
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.ПустаяСсылка)
		|		ИНАЧЕ ВременнаяТаблицаУслуги.ЗачетНДС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаУслуги.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаУслуги.Сумма
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаУслуги.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаУслуги.СуммаНДС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаУслуги.СуммаНСП * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаУслуги.СуммаНСП
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	&Основание_ПоступлениеТоваров
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
		|	ВременнаяТаблицаОС.ОсновноеСредство,
		|	ВременнаяТаблицаШапка.БезналичныйРасчет,
		|	ВременнаяТаблицаШапка.Склад,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС,
		|	ВременнаяТаблицаОС.ЗначениеСтавкиНСП,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|				ИЛИ НЕ &УказыватьПризнакЗачетаНДС
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.ПустаяСсылка)
		|		ИНАЧЕ ВременнаяТаблицаОС.ЗачетНДС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаОС.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаОС.Сумма
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаОС.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаОС.СуммаНДС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаОС.СуммаНСП * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаОС.СуммаНСП
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	&Основание_ПоступлениеТоваров";
	Запрос.УстановитьПараметр("УказыватьПризнакЗачетаНДС", СтруктураДополнительныеСвойства.УчетнаяПолитика.УказыватьПризнакЗачетаНДСПриПоступлении);
	
	ДокументОснование = СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.ДокументОснование;
	
	Запрос.УстановитьПараметр("Основание_ПоступлениеТоваров", 		ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	Запрос.УстановитьПараметр("Основание_ПоступлениеИзПереработки", ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеИзПереработки"));
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоступлениеТоваров", Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСведенияОПоступлении(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Ссылка КАК ДокументСсылка,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Дата,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаШапка.ПризнакСтраны КАК ПризнакСтраны,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК ДатаПоставки,
		|	ВременнаяТаблицаТовары.ЗачетНДС КАК ЗачетНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаТовары.БазаНДС
		|		ИНАЧЕ ВременнаяТаблицаТовары.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ВременнаяТаблицаТовары.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаТовары.СуммаНСП КАК СуммаНСП,
		|	ВременнаяТаблицаШапка.НДСНеПодтвержден КАК НДСНеПодтвержден,
		|	ВременнаяТаблицаШапка.НеВключатьВРеестрСФ КАК НеВключатьВРеестрСФ,
		|	ВременнаяТаблицаШапка.Курс КАК Курс,
		|	ВременнаяТаблицаШапка.Кратность КАК Кратность,
		|	ВременнаяТаблицаШапка.ПоступлениеОтНерезидента КАК ПоступлениеОтНерезидента,
		|	ЛОЖЬ КАК Услуги
		|ПОМЕСТИТЬ ВременнаяТаблицаСтроки
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ПО (ИСТИНА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Ссылка,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаШапка.Контрагент.ПризнакСтраны,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаУслуги.ЗачетНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаУслуги.БазаНДС
		|		ИНАЧЕ ВременнаяТаблицаУслуги.Сумма
		|	КОНЕЦ,
		|	ВременнаяТаблицаУслуги.СуммаНДС,
		|	ВременнаяТаблицаУслуги.СуммаНСП,
		|	ВременнаяТаблицаШапка.НДСНеПодтвержден,
		|	ВременнаяТаблицаШапка.НеВключатьВРеестрСФ,
		|	ВременнаяТаблицаШапка.Курс,
		|	ВременнаяТаблицаШапка.Кратность,
		|	ВременнаяТаблицаШапка.ПоступлениеОтНерезидента,
		|	ИСТИНА
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|		ПО (ИСТИНА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Ссылка,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаШапка.Контрагент.ПризнакСтраны,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаОС.ЗачетНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|			ТОГДА ВременнаяТаблицаОС.БазаНДС
		|		ИНАЧЕ ВременнаяТаблицаОС.Сумма
		|	КОНЕЦ,
		|	ВременнаяТаблицаОС.СуммаНДС,
		|	ВременнаяТаблицаОС.СуммаНСП,
		|	ВременнаяТаблицаШапка.НДСНеПодтвержден,
		|	ВременнаяТаблицаШапка.НеВключатьВРеестрСФ,
		|	ВременнаяТаблицаШапка.Курс,
		|	ВременнаяТаблицаШапка.Кратность,
		|	ВременнаяТаблицаШапка.ПоступлениеОтНерезидента,
		|	ЛОЖЬ
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаСтроки.Организация КАК Организация,
		|	ВременнаяТаблицаСтроки.ДокументСсылка КАК ДокументСсылка,
		|	ВременнаяТаблицаСтроки.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаСтроки.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|			И НЕ ВременнаяТаблицаСтроки.ПоступлениеОтНерезидента
		|			ТОГДА """"
		|		ИНАЧЕ ВременнаяТаблицаСтроки.ДатаПоставки
		|	КОНЕЦ КАК ДатаПоставки,
		|	ВЫБОР
		|		КОГДА &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаСтроки.ЗачетНДС
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.ПустаяСсылка)
		|	КОНЕЦ КАК ЗачетНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|			И НЕ ВременнаяТаблицаСтроки.ПоступлениеОтНерезидента
		|				ТОГДА 0
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				ТОГДА ВременнаяТаблицаСтроки.Сумма * ВременнаяТаблицаСтроки.Курс / ВременнаяТаблицаСтроки.Кратность
		|			ИНАЧЕ ВременнаяТаблицаСтроки.Сумма
		|		КОНЕЦ) КАК Сумма,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|			И НЕ ВременнаяТаблицаСтроки.ПоступлениеОтНерезидента
		|				ТОГДА 0
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				ТОГДА ВременнаяТаблицаСтроки.СуммаНДС * ВременнаяТаблицаСтроки.Курс / ВременнаяТаблицаСтроки.Кратность
		|			ИНАЧЕ ВременнаяТаблицаСтроки.СуммаНДС
		|		КОНЕЦ) КАК СуммаНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|			И НЕ ВременнаяТаблицаСтроки.ПоступлениеОтНерезидента
		|				ТОГДА 0
		|			КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				ТОГДА ВременнаяТаблицаСтроки.СуммаНСП * ВременнаяТаблицаСтроки.Курс / ВременнаяТаблицаСтроки.Кратность
		|			ИНАЧЕ ВременнаяТаблицаСтроки.СуммаНСП
		|		КОНЕЦ) КАК СуммаНСП,
		|	ВременнаяТаблицаСтроки.НДСНеПодтвержден КАК НДСНеПодтвержден,
		|	ВременнаяТаблицаСтроки.ПоступлениеОтНерезидента КАК ПоступлениеОтНерезидента,
		|	ВременнаяТаблицаСтроки.Услуги КАК Услуги
		|ИЗ
		|	ВременнаяТаблицаСтроки КАК ВременнаяТаблицаСтроки
		|ГДЕ
		|	&Основание_ПоступлениеТоваров
		|	И (ВременнаяТаблицаСтроки.Сумма <> 0
		|			ИЛИ ВременнаяТаблицаСтроки.СуммаНДС <> 0
		|			ИЛИ ВременнаяТаблицаСтроки.СуммаНСП <> 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаСтроки.ДокументСсылка,
		|	ВременнаяТаблицаСтроки.Организация,
		|	ВременнаяТаблицаСтроки.ДатаПоставки,
		|	ВременнаяТаблицаСтроки.Дата,
		|	ВременнаяТаблицаСтроки.Контрагент,
		|	ВременнаяТаблицаСтроки.ДоговорКонтрагента,
		|	ВременнаяТаблицаСтроки.ЗачетНДС,
		|	ВременнаяТаблицаСтроки.НДСНеПодтвержден,
		|	ВременнаяТаблицаСтроки.ПоступлениеОтНерезидента,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаСтроки.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|			И НЕ ВременнаяТаблицаСтроки.ПоступлениеОтНерезидента
		|			ТОГДА """"
		|		ИНАЧЕ ВременнаяТаблицаСтроки.ДатаПоставки
		|	КОНЕЦ,
		|	ВременнаяТаблицаСтроки.Услуги
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Ссылка,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаШапка.ДоговорКонтрагента,
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВЫБОР
		|		КОГДА &УказыватьПризнакЗачетаНДС
		|			ТОГДА ВременнаяТаблицаУслуги.ЗачетНДС
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|			И НЕ ВременнаяТаблицаШапка.ПоступлениеОтНерезидента
		|			ТОГДА 0
		|		КОГДА ВременнаяТаблицаШапка.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаУслуги.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаУслуги.Сумма
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|			И НЕ ВременнаяТаблицаШапка.ПоступлениеОтНерезидента
		|			ТОГДА 0
		|		КОГДА ВременнаяТаблицаШапка.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаУслуги.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаУслуги.СуммаНДС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|			И НЕ ВременнаяТаблицаШапка.ПоступлениеОтНерезидента
		|			ТОГДА 0
		|		КОГДА ВременнаяТаблицаШапка.Контрагент.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаУслуги.СуммаНСП * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаУслуги.СуммаНСП
		|	КОНЕЦ,
		|	НЕОПРЕДЕЛЕНО,
		|	ВременнаяТаблицаШапка.ПоступлениеОтНерезидента,
		|	ИСТИНА КАК Услуги
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|		ПО (ИСТИНА)
		|ГДЕ
		|	&Основание_ПоступлениеИзПереработки
		|	И (НЕ ВременнаяТаблицаУслуги.Сумма = 0
		|			ИЛИ НЕ ВременнаяТаблицаУслуги.СуммаНДС = 0
		|			ИЛИ НЕ ВременнаяТаблицаУслуги.СуммаНСП = 0)";
	Запрос.УстановитьПараметр("УказыватьПризнакЗачетаНДС", СтруктураДополнительныеСвойства.УчетнаяПолитика.УказыватьПризнакЗачетаНДСПриПоступлении);
	
	ДокументОснование = СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.ДокументОснование;
	
	Запрос.УстановитьПараметр("Основание_ПоступлениеТоваров", 		ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	Запрос.УстановитьПараметр("Основание_ПоступлениеИзПереработки", ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеИзПереработки"));
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСведенияОПоступлении", Запрос.Выполнить().Выгрузить());	
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПараметрыУчетаОС(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПараметрыУчетаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	ПараметрыУчетаОССрезПоследних.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость
		|ПОМЕСТИТЬ ВременнаяТаблицаПараметрыУчетаОС
		|ИЗ
		|	РегистрСведений.ПараметрыУчетаОС.СрезПоследних(
		|			&Период,
		|			Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|				И ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						ВременнаяТаблицаОС.ОсновноеСредство
		|					ИЗ
		|						ВременнаяТаблицаОС)) КАК ПараметрыУчетаОССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаОС.СчетУчета КАК СчетУчета,		
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаПараметрыУчетаОС.ПервоначальнаяСтоимость + ((ВременнаяТаблицаОС.Сумма + ВременнаяТаблицаОС.СуммаНСП) * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность)
		|		ИНАЧЕ ВременнаяТаблицаПараметрыУчетаОС.ПервоначальнаяСтоимость + (ВременнаяТаблицаОС.Сумма + ВременнаяТаблицаОС.СуммаНСП)
		|	КОНЕЦ КАК ПервоначальнаяСтоимость
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПараметрыУчетаОС КАК ВременнаяТаблицаПараметрыУчетаОС
		|		ПО ВременнаяТаблицаОС.ОсновноеСредство = ВременнаяТаблицаПараметрыУчетаОС.ОсновноеСредство
		|ГДЕ
		|	&Основание_ПоступлениеТоваров";
	Запрос.УстановитьПараметр("Период", СтруктураДополнительныеСвойства.ДляПроведения.ДатаФормированияПроводок);
	
	ДокументОснование = СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.ДокументОснование;
	
	Запрос.УстановитьПараметр("Основание_ПоступлениеТоваров", 		ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	Запрос.УстановитьПараметр("Основание_ПоступлениеИзПереработки", ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеИзПереработки"));
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыУчетаОС", Запрос.Выполнить().Выгрузить()); 		
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРеестрВвезенных(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаТовары.ЗачетНДС КАК ЗачетНДС,
		|	ЛОЖЬ КАК Услуги,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				ТОГДА ВременнаяТаблицаТовары.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|			ИНАЧЕ ВременнаяТаблицаТовары.СуммаНДС
		|		КОНЕЦ) КАК СуммаНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				ТОГДА ВременнаяТаблицаТовары.БазаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|			ИНАЧЕ ВременнаяТаблицаТовары.БазаНДС
		|		КОНЕЦ) КАК БазаНДС
		|ПОМЕСТИТЬ ВременнаяТаблицаТаблицыТоваров
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаТовары.ЗачетНДС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаУслуги.ЗачетНДС,  
		|	ИСТИНА,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				ТОГДА ВременнаяТаблицаУслуги.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|			ИНАЧЕ ВременнаяТаблицаУслуги.СуммаНДС
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				ТОГДА ВременнаяТаблицаУслуги.БазаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|			ИНАЧЕ ВременнаяТаблицаУслуги.БазаНДС
		|		КОНЕЦ)
		|ИЗ
		|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаУслуги.ЗачетНДС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаОС.ЗачетНДС,
		|	ЛОЖЬ,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				ТОГДА ВременнаяТаблицаОС.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|			ИНАЧЕ ВременнаяТаблицаОС.СуммаНДС
		|		КОНЕЦ),
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				ТОГДА ВременнаяТаблицаОС.БазаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|			ИНАЧЕ ВременнаяТаблицаОС.БазаНДС
		|		КОНЕЦ)
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаОС.ЗачетНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаТаблицыТоваров.ЗачетНДС КАК ЗачетНДС,  
		|	ВременнаяТаблицаТаблицыТоваров.Услуги КАК Услуги,
		|	ВременнаяТаблицаТаблицыТоваров.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаТаблицыТоваров.БазаНДС КАК БазаНДС
		|ПОМЕСТИТЬ ВТСуммыРеестрВвезенных
		|ИЗ
		|	ВременнаяТаблицаТаблицыТоваров КАК ВременнаяТаблицаТаблицыТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Номер КАК Номер,
		|	ВременнаяТаблицаШапка.Дата КАК ДатаСФ,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВТСуммыРеестрВвезенных.СуммаНДС КАК СуммаНДС,
		|	ВТСуммыРеестрВвезенных.БазаНДС КАК Сумма,
		|	ВТСуммыРеестрВвезенных.ЗачетНДС КАК ЗачетНДС
		|ИЗ
		|	ВТСуммыРеестрВвезенных КАК ВТСуммыРеестрВвезенных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	&Основание_ПоступлениеТоваров
		|	И ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|	И НЕ ВременнаяТаблицаШапка.ПоступлениеОтНерезидента
		|	И ВременнаяТаблицаШапка.ПлательщикНДС
		|	И НЕ ВТСуммыРеестрВвезенных.Услуги";
	Запрос.УстановитьПараметр("УказыватьПризнакЗачетаНДС", СтруктураДополнительныеСвойства.УчетнаяПолитика.УказыватьПризнакЗачетаНДСПриПоступлении);
	
	ДокументОснование = СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.ДокументОснование;
	
	Запрос.УстановитьПараметр("Основание_ПоступлениеТоваров", 		ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	Запрос.УстановитьПараметр("Основание_ПоступлениеИзПереработки", ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеИзПереработки"));
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрВвезенных", Запрос.Выполнить().Выгрузить());		
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРеестрПриобретенныхМатериальныхРесурсов(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.ЗачетНДС КАК ЗачетНДС,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		|	СУММА(ВложенныйЗапрос.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ВременнаяТаблицаДанныеТабличныхЧастей
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВременнаяТаблицаТовары.ЗачетНДС КАК ЗачетНДС,
		|		СУММА(ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|					ТОГДА ВременнаяТаблицаТовары.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|				ИНАЧЕ ВременнаяТаблицаТовары.СуммаНДС
		|			КОНЕЦ) КАК СуммаНДС,
		|		СУММА(ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|					ТОГДА ВременнаяТаблицаТовары.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|				ИНАЧЕ ВременнаяТаблицаТовары.Сумма
		|			КОНЕЦ) КАК Сумма
		|	ИЗ
		|		ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|			ПО (ИСТИНА)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВременнаяТаблицаТовары.ЗачетНДС
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВременнаяТаблицаУслуги.ЗачетНДС,
		|		СУММА(ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|					ТОГДА ВременнаяТаблицаУслуги.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|				ИНАЧЕ ВременнаяТаблицаУслуги.СуммаНДС
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|					ТОГДА ВременнаяТаблицаУслуги.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|				ИНАЧЕ ВременнаяТаблицаУслуги.Сумма
		|			КОНЕЦ)
		|	ИЗ
		|		ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|			ПО (ИСТИНА)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВременнаяТаблицаУслуги.ЗачетНДС
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВременнаяТаблицаОС.ЗачетНДС,
		|		СУММА(ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|					ТОГДА ВременнаяТаблицаОС.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|				ИНАЧЕ ВременнаяТаблицаОС.СуммаНДС
		|			КОНЕЦ),
		|		СУММА(ВЫБОР
		|				КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|					ТОГДА ВременнаяТаблицаОС.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|				ИНАЧЕ ВременнаяТаблицаОС.Сумма
		|			КОНЕЦ)
		|	ИЗ
		|		ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|			ПО (ИСТИНА)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВременнаяТаблицаОС.ЗачетНДС) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ЗачетНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаДанныеТабличныхЧастей.ЗачетНДС КАК ЗачетНДС,
		|	ВЫБОР
		|		КОГДА &Основание_ПоступлениеТоваров
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ЭтоПоступлениеБезНДС
		|							ИЛИ ВременнаяТаблицаШапка.ЭтоПоступлениеПоЧеку
		|						ТОГДА ВременнаяТаблицаШапка.НомерБланкаСФ
		|					КОГДА ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ЗакупочныйАкт)
		|						ТОГДА ВременнаяТаблицаШапка.НомерАкта
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерБланкаСФ,
		|	ВЫБОР
		|		КОГДА &Основание_ПоступлениеТоваров
		|			ТОГДА ВЫБОР
		|					КОГДА ВременнаяТаблицаШапка.ЭтоПоступлениеБезНДС
		|							И НЕ &НеУчитыватьЗакупкиБезНДС
		|						ТОГДА ВременнаяТаблицаШапка.СерияБланкаСФ
		|					КОГДА ВременнаяТаблицаШапка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ЗакупочныйАкт)
		|						ТОГДА ""ДПБУ""
		|					КОГДА ВременнаяТаблицаШапка.ЭтоПоступлениеПоЧеку
		|						ТОГДА ""Чек""
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК СерияБланкаСФ,
		//|	ВЫБОР
		//|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		//|			ТОГДА ЕСТЬNULL(ВременнаяТаблицаДанныеТабличныхЧастей.СуммаНДС, 0) * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		//|		ИНАЧЕ ЕСТЬNULL(ВременнаяТаблицаДанныеТабличныхЧастей.СуммаНДС, 0)
		//|	КОНЕЦ КАК СуммаНДС,
		//|	ВЫБОР
		//|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		//|			ТОГДА ЕСТЬNULL(ВременнаяТаблицаДанныеТабличныхЧастей.Сумма, 0) * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		//|		ИНАЧЕ ЕСТЬNULL(ВременнаяТаблицаДанныеТабличныхЧастей.Сумма, 0)
		//|	КОНЕЦ КАК Сумма
		|	ВременнаяТаблицаДанныеТабличныхЧастей.СуммаНДС КАК СуммаНДС,
		|	ВременнаяТаблицаДанныеТабличныхЧастей.Сумма КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДанныеТабличныхЧастей КАК ВременнаяТаблицаДанныеТабличныхЧастей
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПлательщикНДС
		|	И ((ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			И НЕ ВременнаяТаблицаШапка.КонтрагентСЭЗ)
		|		ИЛИ ВременнаяТаблицаШапка.ПоступлениеОтНерезидента
		|		ИЛИ НЕ ВременнаяТаблицаШапка.ПоступлениеОтНерезидента)";
	Запрос.Параметры.Вставить("НеУчитыватьЗакупкиБезНДС", СтруктураДополнительныеСвойства.УчетнаяПолитика.НеУчитыватьЗакупкиБезНДС);
	
	ДокументОснование = СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.ДокументОснование;
	
	Запрос.УстановитьПараметр("Основание_ПоступлениеТоваров", ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрПриобретенныхМатериальныхРесурсов", Запрос.Выполнить().Выгрузить());		
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаНДСНаИмпорт(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ИмпортОсвобожденныйОтНДС <> ЗНАЧЕНИЕ(Перечисление.ИмпортОсвобожденныйОтНДС.ПустаяСсылка)
		|			ТОГДА ВременнаяТаблицаШапка.ИмпортОсвобожденныйОтНДС
		|		ИНАЧЕ ВременнаяТаблицаТовары.ИмпортОсвобожденныйОтНДС
		|	КОНЕЦ КАК ИмпортОсвобожденныйОтНДС,
		|	ВременнаяТаблицаШапка.ПоказательИмпорта КАК ПоказательИмпорта,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаТовары.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаТовары.СуммаНДС
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаТовары.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаТовары.Сумма
		|	КОНЕЦ КАК Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаНДСНаИмпорт
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|	И НЕ ВременнаяТаблицаШапка.ПоступлениеОтНерезидента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ИмпортОсвобожденныйОтНДС <> ЗНАЧЕНИЕ(Перечисление.ИмпортОсвобожденныйОтНДС.ПустаяСсылка)
		|			ТОГДА ВременнаяТаблицаШапка.ИмпортОсвобожденныйОтНДС
		|		ИНАЧЕ ВременнаяТаблицаОС.ИмпортОсвобожденныйОтНДС
		|	КОНЕЦ,
		|	ВременнаяТаблицаШапка.ПоказательИмпорта,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаОС.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаОС.СуммаНДС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаОС.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаОС.Сумма
		|	КОНЕЦ
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|	И НЕ ВременнаяТаблицаШапка.ПоступлениеОтНерезидента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаНДСНаИмпорт.Период КАК Период,
		|	ВременнаяТаблицаНДСНаИмпорт.Организация КАК Организация,
		|	ВременнаяТаблицаНДСНаИмпорт.ИмпортОсвобожденныйОтНДС КАК ИмпортОсвобожденныйОтНДС,
		|	ВременнаяТаблицаНДСНаИмпорт.ПоказательИмпорта КАК ПоказательИмпорта,
		|	СУММА(ВременнаяТаблицаНДСНаИмпорт.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ВременнаяТаблицаНДСНаИмпорт.Сумма) КАК Сумма
		|ИЗ
		|	ВременнаяТаблицаНДСНаИмпорт КАК ВременнаяТаблицаНДСНаИмпорт
		|ГДЕ
		|	&Основание_ПоступлениеТоваров
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаНДСНаИмпорт.Организация,
		|	ВременнаяТаблицаНДСНаИмпорт.ИмпортОсвобожденныйОтНДС,
		|	ВременнаяТаблицаНДСНаИмпорт.ПоказательИмпорта,
		|	ВременнаяТаблицаНДСНаИмпорт.Период";
	
	ДокументОснование = СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.ДокументОснование;
	
	Запрос.УстановитьПараметр("Основание_ПоступлениеТоваров", 		ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	Запрос.УстановитьПараметр("Основание_ПоступлениеИзПереработки", ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеИзПереработки"));
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНДСНаИмпорт", Запрос.Выполнить().Выгрузить());		
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьСведенияПоПоказателямИмпорта(ДокументСсылка, СтруктураДополнительныеСвойства) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Дата,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Ссылка КАК ДокументСсылка,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаШапка.ХарактерСделки КАК ХарактерСделки,
		|	ВременнаяТаблицаШапка.КоммерческийДокумент КАК КоммерческиеДокументы,
		|	ВременнаяТаблицаШапка.Транспортировка КАК Транспортировка,
		|	ВременнаяТаблицаШапка.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	ВременнаяТаблицаШапка.КодУсловийПоставки КАК КодУсловийПоставки,
		|	ВременнаяТаблицаШапка.КодОсобенностиПеремещенияТоваров КАК КодОсобенностиПеремещенияТоваров,
		|	ВременнаяТаблицаШапка.ВидТранспорта КАК ВидТранспорта,
		|	ВременнаяТаблицаШапка.НомерКонтракта КАК НомерКонтракта,
		|	ВременнаяТаблицаШапка.ДатаКонтракта КАК ДатаКонтракта,
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		|	0 КАК Вес,
		|	0 КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				ТОГДА ВременнаяТаблицаТовары.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|			ИНАЧЕ ВременнаяТаблицаТовары.Сумма
		|		КОНЕЦ) КАК Сумма,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|				ТОГДА ВременнаяТаблицаТовары.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность / КурсыВалютСрезПоследних.Курс * КурсыВалютСрезПоследних.Кратность
		|			ИНАЧЕ ВременнаяТаблицаТовары.Сумма / КурсыВалютСрезПоследних.Курс * КурсыВалютСрезПоследних.Кратность
		|		КОНЕЦ) КАК СуммаВДолларах
		|ИЗ
		|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ПО (ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта.Код = ""840"") КАК КурсыВалютСрезПоследних
		|		ПО (ИСТИНА)
		|ГДЕ
		|	&Основание_ПоступлениеТоваров
		|	И ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ЕАЭС)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Ссылка,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаШапка.ХарактерСделки,
		|	ВременнаяТаблицаШапка.КоммерческийДокумент,
		|	ВременнаяТаблицаШапка.Транспортировка,
		|	ВременнаяТаблицаШапка.ДополнительнаяИнформация,
		|	ВременнаяТаблицаШапка.КодУсловийПоставки,
		|	ВременнаяТаблицаШапка.КодОсобенностиПеремещенияТоваров,
		|	ВременнаяТаблицаШапка.ВидТранспорта,
		|	ВременнаяТаблицаШапка.НомерКонтракта,
		|	ВременнаяТаблицаШапка.ДатаКонтракта,
		|	ВременнаяТаблицаТовары.Номенклатура";
	Запрос.УстановитьПараметр("Период", СтруктураДополнительныеСвойства.ДляПроведения.ДатаФормированияПроводок);
	
	ДокументОснование = СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.ДокументОснование;
	
	Запрос.УстановитьПараметр("Основание_ПоступлениеТоваров", 		ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	Запрос.УстановитьПараметр("Основание_ПоступлениеИзПереработки", ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеИзПереработки"));
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСведенияПоПоказателямИмпорта", Запрос.Выполнить().Выгрузить());		
КонецПроцедуры 

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРеестрЗакупок(ДокументСсылка, СтруктураДополнительныеСвойства) 
	                   
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок КАК Период,
		|	ВременнаяТаблицаШапка.Организация КАК Организация,
		|	ВременнаяТаблицаШапка.Контрагент КАК Контрагент,
		|	ВременнаяТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС КАК ЗначениеСтавкиНДС,
		|	ВременнаяТаблицаТовары.ЗначениеСтавкиНСП КАК ЗначениеСтавкиНСП,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ДокументОснование ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|			И (ВременнаяТаблицаШапка.ДокументОснование.ЭтоПоступлениеБезНДС
		|				ИЛИ ВременнаяТаблицаШапка.ДокументОснование.ЭтоПоступлениеПоЧеку)
		|			ТОГДА ИСТИНА
		|		КОГДА ВременнаяТаблицаШапка.ДокументОснование ССЫЛКА Документ.ПоступлениеИзПереработки
		|			И ВременнаяТаблицаШапка.ДокументОснование.ЭтоПоступлениеБезНДС
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК БезНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаТовары.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаТовары.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаТовары.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаТовары.СуммаНДС
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаТовары.СуммаНСП * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаТовары.СуммаНСП
		|	КОНЕЦ КАК СуммаНСП,
		|	0 КАК Количество
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ВременнаяТаблицаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	&Основание_ПоступлениеТоваров
		|	И НЕ (ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|		И НЕ ВременнаяТаблицаШапка.ПоступлениеОтНерезидента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаУслуги.Номенклатура,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС,
		|	ВременнаяТаблицаУслуги.ЗначениеСтавкиНСП,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ДокументОснование ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|			И (ВременнаяТаблицаШапка.ДокументОснование.ЭтоПоступлениеБезНДС
		|				ИЛИ ВременнаяТаблицаШапка.ДокументОснование.ЭтоПоступлениеПоЧеку)
		|			ТОГДА ИСТИНА
		|		КОГДА ВременнаяТаблицаШапка.ДокументОснование ССЫЛКА Документ.ПоступлениеИзПереработки
		|			И ВременнаяТаблицаШапка.ДокументОснование.ЭтоПоступлениеБезНДС
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК БезНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаУслуги.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаУслуги.Сумма
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаУслуги.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаУслуги.СуммаНДС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаУслуги.СуммаНСП * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаУслуги.СуммаНСП
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	ВременнаяТаблицаУслуги КАК ВременнаяТаблицаУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	&Основание_ПоступлениеТоваров
		|	И НЕ (ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|		И НЕ ВременнаяТаблицаШапка.ПоступлениеОтНерезидента)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаШапка.ДатаФормированияПроводок,
		|	ВременнаяТаблицаШапка.Организация,
		|	ВременнаяТаблицаШапка.Контрагент,
		|	ВременнаяТаблицаОС.ОсновноеСредство,
		|	ВременнаяТаблицаШапка.ЗначениеСтавкиНДС,
		|	ВременнаяТаблицаОС.ЗначениеСтавкиНСП,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ДокументОснование ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|			И (ВременнаяТаблицаШапка.ДокументОснование.ЭтоПоступлениеБезНДС
		|				ИЛИ ВременнаяТаблицаШапка.ДокументОснование.ЭтоПоступлениеПоЧеку)
		|			ТОГДА ИСТИНА
		|		КОГДА ВременнаяТаблицаШапка.ДокументОснование ССЫЛКА Документ.ПоступлениеИзПереработки
		|			И ВременнаяТаблицаШапка.ДокументОснование.ЭтоПоступлениеБезНДС
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК БезНДС,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаОС.Сумма * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаОС.Сумма
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаОС.СуммаНДС * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаОС.СуммаНДС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.КР)
		|			ТОГДА ВременнаяТаблицаОС.СуммаНСП * ВременнаяТаблицаШапка.Курс / ВременнаяТаблицаШапка.Кратность
		|		ИНАЧЕ ВременнаяТаблицаОС.СуммаНСП
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	ВременнаяТаблицаОС КАК ВременнаяТаблицаОС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	&Основание_ПоступлениеТоваров
		|	И НЕ (ВременнаяТаблицаШапка.ПризнакСтраны = ЗНАЧЕНИЕ(Перечисление.ПризнакиСтраны.ИмпортЭкспорт)
		|		И НЕ ВременнаяТаблицаШапка.ПоступлениеОтНерезидента)";
	
	ДокументОснование = СтруктураДополнительныеСвойства.ДляПроведения.Ссылка.ДокументОснование;
	
	Запрос.УстановитьПараметр("Основание_ПоступлениеТоваров", 		ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг"));
	Запрос.УстановитьПараметр("Основание_ПоступлениеИзПереработки", ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеИзПереработки"));
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрЗакупок", Запрос.Выполнить().Выгрузить());		
КонецПроцедуры 

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц 	= СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Ссылка,
		|	ТаблицаДокумента.Дата КАК Дата,
		|	ТаблицаДокумента.Номер КАК Номер,
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ТаблицаДокумента.БезналичныйРасчет КАК БезналичныйРасчет,
		|	ТаблицаДокумента.ВалютаДокумента КАК ВалютаДокумента,
		|	ТаблицаДокумента.Склад КАК Склад,
		|	ТаблицаДокумента.Контрагент КАК Контрагент,
		|	ТаблицаДокумента.Контрагент.ПризнакСтраны КАК ПризнакСтраны,
		|	ТаблицаДокумента.Контрагент.СЭЗ КАК КонтрагентСЭЗ,
		|	ТаблицаДокумента.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ТаблицаДокумента.Курс КАК Курс,
		|	ТаблицаДокумента.Кратность КАК Кратность,
		|	&КонтрагентГНС КАК КонтрагентГНС,
		|	&ДоговорКонтрагентаГНС КАК ДоговорКонтрагентаГНС,
		|	&СчетРасчетовГНС КАК СчетРасчетовГНС,
		|	ТаблицаДокумента.СуммаДокумента КАК СуммаДокумента,
		|	ТаблицаДокумента.СчетРасчетов КАК СчетРасчетов,
		|	&ПлательщикНДС КАК ПлательщикНДС,
		|	ТаблицаДокумента.ЗначениеСтавкиНДС КАК ЗначениеСтавкиНДС,
		|	ТаблицаДокумента.ДокументОснование КАК ДокументОснование,
		|	ТаблицаДокумента.ДатаФормированияПроводок КАК ДатаФормированияПроводок,
		|	ТаблицаДокумента.НДСНеПодтвержден КАК НДСНеПодтвержден,
		|	ТаблицаДокумента.ПоступлениеОтНерезидента КАК ПоступлениеОтНерезидента,
		|	ПоступлениеТоваровУслуг.ЭтоПоступлениеБезНДС КАК ЭтоПоступлениеБезНДС,
		|	ПоступлениеТоваровУслуг.ЭтоПоступлениеПоЧеку КАК ЭтоПоступлениеПоЧеку,
		|	ПоступлениеТоваровУслуг.ВидОперации КАК ВидОперации,
		|	ПоступлениеТоваровУслуг.СерияБланкаСФ КАК СерияБланкаСФ,
		|	ПоступлениеТоваровУслуг.НомерБланкаСФ КАК НомерБланкаСФ,	
		|	ПоступлениеТоваровУслуг.НомерАкта КАК НомерАкта,
		|	ПоступлениеТоваровУслуг.НеВключатьВРеестрСФ КАК НеВключатьВРеестрСФ,
		|	ПоступлениеТоваровУслуг.ПоказательИмпорта КАК ПоказательИмпорта,
		|	ПоступлениеТоваровУслуг.ИмпортОсвобожденныйОтНДС КАК ИмпортОсвобожденныйОтНДС,
		|	ПоступлениеТоваровУслуг.ХарактерСделки КАК ХарактерСделки,
		|	ПоступлениеТоваровУслуг.КоммерческийДокумент КАК КоммерческийДокумент,
		|	ПоступлениеТоваровУслуг.Транспортировка КАК Транспортировка,
		|	ПоступлениеТоваровУслуг.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	ПоступлениеТоваровУслуг.КодУсловийПоставки КАК КодУсловийПоставки,
		|	ПоступлениеТоваровУслуг.КодОсобенностиПеремещенияТоваров КАК КодОсобенностиПеремещенияТоваров,
		|	ПоступлениеТоваровУслуг.ВидТранспорта КАК ВидТранспорта,
		|	ПоступлениеТоваровУслуг.НомерКонтракта КАК НомерКонтракта,
		|	ПоступлениеТоваровУслуг.ДатаКонтракта КАК ДатаКонтракта
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.КорректировкаСтоимостиПоступления КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ПО ТаблицаДокумента.ДокументОснование = ПоступлениеТоваровУслуг.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
		|	ТаблицаДокумента.Количество КАК Количество,
		|	ТаблицаДокумента.Цена КАК Цена,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.ЗначениеСтавкиНСП КАК ЗначениеСтавкиНСП,
		|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
		|	ТаблицаДокумента.СуммаНСП КАК СуммаНСП,
		|	ТаблицаДокумента.СуммаАкциза КАК СуммаАкциза,
		|	ТаблицаДокумента.Всего КАК Всего,
		|	ТаблицаДокумента.БазаНДС КАК БазаНДС,
		|	ТаблицаДокумента.ИмпортОсвобожденныйОтНДС КАК ИмпортОсвобожденныйОтНДС,
		|	ТаблицаДокумента.Вес КАК Вес,
		|	ВЫБОР
		|		КОГДА НЕ &ПризнакЗачетаНДСП
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Распределение)
		|		КОГДА ТаблицаДокумента.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет)
		|		ИНАЧЕ ТаблицаДокумента.ЗачетНДС
		|	КОНЕЦ КАК ЗачетНДС
		|ПОМЕСТИТЬ ВременнаяТаблицаТовары
		|ИЗ
		|	Документ.КорректировкаСтоимостиПоступления.Товары КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
		|	ТаблицаДокумента.Количество КАК Количество,
		|	ТаблицаДокумента.Цена КАК Цена,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СчетРасходов КАК СчетРасходов,
		|	ТаблицаДокумента.ЗначениеСтавкиНСП КАК ЗначениеСтавкиНСП,
		|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
		|	ТаблицаДокумента.СуммаНСП КАК СуммаНСП,
		|	ТаблицаДокумента.СуммаАкциза КАК СуммаАкциза,
		|	ТаблицаДокумента.Всего КАК Всего,
		|	ТаблицаДокумента.БазаНДС КАК БазаНДС,
		|	ВЫБОР
		|		КОГДА НЕ &ПризнакЗачетаНДСП
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Распределение)
		|		КОГДА ТаблицаДокумента.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет)
		|		ИНАЧЕ ТаблицаДокумента.ЗачетНДС
		|	КОНЕЦ КАК ЗачетНДС,
		|	ТаблицаДокумента.Субконто1 КАК Субконто1,
		|	ТаблицаДокумента.Субконто2 КАК Субконто2,
		|	ТаблицаДокумента.Субконто3 КАК Субконто3
		|ПОМЕСТИТЬ ВременнаяТаблицаУслуги
		|ИЗ
		|	Документ.КорректировкаСтоимостиПоступления.Услуги КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокумента.ОсновноеСредство КАК ОсновноеСредство,
		|	ТаблицаДокумента.Сумма КАК Сумма,
		|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
		|	ТаблицаДокумента.ЗначениеСтавкиНСП КАК ЗначениеСтавкиНСП,
		|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
		|	ТаблицаДокумента.СуммаНСП КАК СуммаНСП,
		|	ТаблицаДокумента.СуммаАкциза КАК СуммаАкциза,
		|	ТаблицаДокумента.Всего КАК Всего,
		|	ТаблицаДокумента.БазаНДС КАК БазаНДС,
		|	ВЫБОР
		|		КОГДА НЕ &ПризнакЗачетаНДСП
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Распределение)
		|		КОГДА ТаблицаДокумента.ЗачетНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗачетаНДС.Зачет)
		|		ИНАЧЕ ТаблицаДокумента.ЗачетНДС
		|	КОНЕЦ КАК ЗачетНДС,
		|	ТаблицаДокумента.ИмпортОсвобожденныйОтНДС КАК ИмпортОсвобожденныйОтНДС
		|ПОМЕСТИТЬ ВременнаяТаблицаОС
		|ИЗ
		|	Документ.КорректировкаСтоимостиПоступления.ОС КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостоянияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство
		|ПОМЕСТИТЬ ВременнаяТаблицаСписанныеОС
		|ИЗ
		|	РегистрСведений.СостоянияОС.СрезПоследних(&Период, ) КАК СостоянияОССрезПоследних
		|ГДЕ
		|	СостоянияОССрезПоследних.Состояние В(&ВидыСостоянийОС)";
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	УчетнаяПолитика = СтруктураДополнительныеСвойства.УчетнаяПолитика;
	Запрос.УстановитьПараметр("ПлательщикНДС", УчетнаяПолитика.ПлательщикНДС);
	Запрос.УстановитьПараметр("ПризнакЗачетаНДСП", УчетнаяПолитика.УказыватьПризнакЗачетаНДСПриПоступлении);
	
	// Параметры для отражения НДС.
	КонтрагентГНС = СтруктураДополнительныеСвойства.ДляПроведения.Организация.КонтрагентГНС;
	
	СписокВидовДоговора = Новый СписокЗначений;
	СписокВидовДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	ДоговорКонтрагентаГНС = Справочники.ДоговорыКонтрагентов.ПолучитьДоговорПоУмолчаниюПоОрганизацииВидуДоговора(КонтрагентГНС, 
		СтруктураДополнительныеСвойства.ДляПроведения.Организация, СписокВидовДоговора);
		
	СчетаУчета = БухгалтерскийУчетСервер.ПолучитьСчетаРасчетовСКонтрагентом(СтруктураДополнительныеСвойства.ДляПроведения.Организация, 
		КонтрагентГНС, ДоговорКонтрагентаГНС);
		
	Запрос.УстановитьПараметр("КонтрагентГНС", КонтрагентГНС);
	Запрос.УстановитьПараметр("ДоговорКонтрагентаГНС", ДоговорКонтрагентаГНС);
	Запрос.УстановитьПараметр("СчетРасчетовГНС", СчетаУчета.СчетРасчетовПоставщика);
	Запрос.УстановитьПараметр("Период", СтруктураДополнительныеСвойства.ДляПроведения.ДатаФормированияПроводок);
	
	ВидыСостоянийОС = Новый Массив();
	ВидыСостоянийОС.Добавить(Перечисления.ВидыСостоянийОС.Передано);
	ВидыСостоянийОС.Добавить(Перечисления.ВидыСостоянийОС.СнятоСУчета);
	Запрос.УстановитьПараметр("ВидыСостоянийОС", ВидыСостоянийОС);
	
	Запрос.Выполнить();    		
		
	СформироватьТаблицаХозрасчетный(ДокументСсылка, СтруктураДополнительныеСвойства);	
	СформироватьТаблицаПоступлениеТоваров(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПараметрыУчетаОС(ДокументСсылка, СтруктураДополнительныеСвойства); 
	СформироватьТаблицаРеестрВвезенных(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСведенияОПоступлении(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаНДСНаИмпорт(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьСведенияПоПоказателямИмпорта(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРеестрЗакупок(ДокументСсылка, СтруктураДополнительныеСвойства);	
	СформироватьТаблицаРеестрПриобретенныхМатериальныхРесурсов(ДокументСсылка, СтруктураДополнительныеСвойства);
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//@skip-warning
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Функция формирует табличный документ с печатной формой ПечатьНакладной
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КорректировкаСтоимостиПоступления.Ссылка КАК Ссылка,
		|	КорректировкаСтоимостиПоступления.Номер КАК Номер,
		|	КорректировкаСтоимостиПоступления.Дата КАК Дата,
		|	КорректировкаСтоимостиПоступления.Организация КАК Организация,
		|	КорректировкаСтоимостиПоступления.Склад КАК Склад,
		|	КорректировкаСтоимостиПоступления.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	КорректировкаСтоимостиПоступления.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
		|	КорректировкаСтоимостиПоступления.Контрагент.ПризнакСтраны КАК КонтрагентПризнакСтраны,
		|	ПРЕДСТАВЛЕНИЕ(КорректировкаСтоимостиПоступления.Склад) КАК СкладПредставление,
		|	КорректировкаСтоимостиПоступления.Курс КАК Курс,
		|	КорректировкаСтоимостиПоступления.Кратность КАК Кратность,
		|	КорректировкаСтоимостиПоступления.ВалютаДокумента КАК ВалютаДокумента,
		|	КорректировкаСтоимостиПоступления.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
		|		ПРЕДСТАВЛЕНИЕ(КорректировкаСтоимостиПоступления.Товары.Номенклатура.КодТНВЭД) КАК КодПоКлассификатору,
		|		ПРЕДСТАВЛЕНИЕ(КорректировкаСтоимостиПоступления.Товары.Номенклатура.ЕдиницаИзмерения) КАК ЕИ,
		|		Количество КАК Количество,
		|		ВЫРАЗИТЬ(КорректировкаСтоимостиПоступления.Товары.Всего / КорректировкаСтоимостиПоступления.Товары.Количество КАК ЧИСЛО(15, 2)) КАК Цена,
		|		СуммаНДС КАК СуммаНДС,
		|		СуммаНСП КАК СуммаНСП,
		|		Всего КАК Всего
		|	) КАК Товары,
		|	КорректировкаСтоимостиПоступления.Услуги.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
		|		ПРЕДСТАВЛЕНИЕ(КорректировкаСтоимостиПоступления.Услуги.Номенклатура.КодГКЭД) КАК КодПоКлассификатору,
		|		ПРЕДСТАВЛЕНИЕ(КорректировкаСтоимостиПоступления.Услуги.Номенклатура.ЕдиницаИзмерения) КАК ЕИ,
		|		Количество КАК Количество,
		|		ВЫРАЗИТЬ(КорректировкаСтоимостиПоступления.Услуги.Всего / КорректировкаСтоимостиПоступления.Услуги.Количество КАК ЧИСЛО(15, 2)) КАК Цена,
		|		СуммаНДС КАК СуммаНДС,
		|		СуммаНСП КАК СуммаНСП,
		|		Всего КАК Всего
		|	) КАК Услуги,
		|	КорректировкаСтоимостиПоступления.ОС.(
		|		НомерСтроки КАК НомерСтроки,
		|		ОсновноеСредство КАК Номенклатура,
		|		ОсновноеСредство.НаименованиеПолное КАК НоменклатураПредставление,
		|		ПРЕДСТАВЛЕНИЕ(КорректировкаСтоимостиПоступления.ОС.ОсновноеСредство.КодТНВЭД) КАК КодПоКлассификатору,
		|		Всего КАК Цена,
		|		1 КАК Количество,
		|		СуммаНДС КАК СуммаНДС,
		|		СуммаНСП КАК СуммаНСП,
		|		Всего КАК Всего
		|	) КАК ОС
		|ИЗ
		|	Документ.КорректировкаСтоимостиПоступления КАК КорректировкаСтоимостиПоступления
		|ГДЕ
		|	КорректировкаСтоимостиПоступления.Ссылка В(&СписокДокументов)";		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "КорректировкаСтоимостиПоступления_Накладная";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.КорректировкаСтоимостиПоступления.ПФ_MXL_Накладная");
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подготовка данных.
		ДанныеПечати = Новый Структура;
		
		ТекстЗаголовка = СформироватьЗаголовокДокумента(Шапка, НСтр("ru = 'Накладная на поступление'"));
		ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		ДанныеПечати.Вставить("ОрганизацияНаименованиеПолное", Шапка.ОрганизацияНаименованиеПолное);
		ДанныеПечати.Вставить("СкладПредставление", Шапка.СкладПредставление);
		ДанныеПечати.Вставить("КонтрагентНаименованиеПолное", Шапка.КонтрагентНаименованиеПолное);

		ТаблицаТовары = Шапка.Товары.Выгрузить();
		ТаблицаУслуги = Шапка.Услуги.Выгрузить();
		ТаблицаОС = Шапка.ОС.Выгрузить();
		
		Если ТаблицаТовары.Количество() > 0
			Или ТаблицаОС.Количество() > 0 Тогда 
			ДанныеПечати.Вставить("НаименованиеКлассификатора", НСтр("ru = 'Код ТНВЭД'"));
		ИначеЕсли ТаблицаУслуги.Количество() > 0 Тогда  
			ДанныеПечати.Вставить("НаименованиеКлассификатора", НСтр("ru = 'Код ГКЭД'"));	
		КонецЕсли;	
		
		Всего = Окр((ТаблицаТовары.Итог("Всего") + ТаблицаУслуги.Итог("Всего") + ТаблицаОС.Итог("Всего")) * Шапка.Курс / Шапка.Кратность, 2);
		ВсегоНДС = ТаблицаТовары.Итог("СуммаНДС") + ТаблицаУслуги.Итог("СуммаНДС") + ТаблицаОС.Итог("СуммаНДС");
		ВсегоНСП = ТаблицаТовары.Итог("СуммаНСП") + ТаблицаУслуги.Итог("СуммаНСП") + ТаблицаОС.Итог("СуммаНСП");
		КоличествоНаименований = ТаблицаТовары.Количество() + ТаблицаУслуги.Количество() + ТаблицаОС.Количество();		
		
		Если Шапка.КонтрагентПризнакСтраны = Перечисления.ПризнакиСтраны.ЕАЭС Тогда 
			ДанныеПечати.Вставить("НадписьНДС", НСтр("ru = 'НДС на импорт:'"));
		Иначе 
			ДанныеПечати.Вставить("НадписьНДС", НСтр("ru = 'в том числе НДС:'"));
		КонецЕсли;	
		
		ДанныеПечати.Вставить("Всего", Всего);
		ДанныеПечати.Вставить("ВсегоНДС", ВсегоНДС);
		ДанныеПечати.Вставить("ВсегоНСП", ВсегоНСП);
		ДанныеПечати.Вставить("ИтоговаяСтрока", 
			СтрШаблон(НСтр("ru = 'Всего наименований %1, на сумму %2'"), 
			Формат(КоличествоНаименований, "ЧН=0; ЧГ=0"), Формат(ДанныеПечати.Всего, "ЧЦ=15; ЧДЦ=2")));
		ДанныеПечати.Вставить("СуммаПрописью", 
								БухгалтерскийУчетСервер.СформироватьСуммуПрописью(
									ДанныеПечати.Всего, 
									ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета()));

		// Области
		МассивОбластейМакета = Новый Массив;
		МассивОбластейМакета.Добавить("Заголовок");		
		МассивОбластейМакета.Добавить("ШапкаТаблицы");
		МассивОбластейМакета.Добавить("Строка");		
		МассивОбластейМакета.Добавить("Подвал");		
		МассивОбластейМакета.Добавить("Итоги");
		
		Если Шапка.КонтрагентПризнакСтраны = Перечисления.ПризнакиСтраны.КР
			Или Шапка.КонтрагентПризнакСтраны = Перечисления.ПризнакиСтраны.ЕАЭС Тогда 
			МассивОбластейМакета.Добавить("ИтогиНДС");
		КонецЕсли;
		
		Если Шапка.КонтрагентПризнакСтраны = Перечисления.ПризнакиСтраны.КР Тогда 
			МассивОбластейМакета.Добавить("ИтогиНСП");
		КонецЕсли;	
		
		МассивОбластейМакета.Добавить("СуммаПрописью");
		МассивОбластейМакета.Добавить("Подписи");
	
		Для Каждого ИмяОбласти Из МассивОбластейМакета Цикл
			ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбласти);
			
			Если ИмяОбласти = "Строка" ИЛИ ИмяОбласти = "СтрокаДопЕдиницы" Тогда
				
				СтруктураВсего_Цена = Новый Структура();
				СтруктураВсего_Цена.Вставить("Всего", 0);
				СтруктураВсего_Цена.Вставить("Цена", 0);
				
				НомерСтроки = 1;
				Для Каждого СтрокаТаблицы Из ТаблицаТовары Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					
					СтруктураВсего_Цена.Всего = Окр(СтрокаТаблицы.Всего * Шапка.Курс / Шапка.Кратность, 2);
					СтруктураВсего_Цена.Цена = Окр(СтрокаТаблицы.Цена * Шапка.Курс / Шапка.Кратность, 2);
					
					ОбластьМакета.Параметры.Заполнить(СтруктураВсего_Цена);
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
					НомерСтроки = НомерСтроки + 1;
				КонецЦикла;
				Для Каждого СтрокаТаблицы Из ТаблицаУслуги Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					
					СтруктураВсего_Цена.Всего = Окр(СтрокаТаблицы.Всего * Шапка.Курс / Шапка.Кратность, 2);
					СтруктураВсего_Цена.Цена = Окр(СтрокаТаблицы.Цена * Шапка.Курс / Шапка.Кратность, 2);
					
					ОбластьМакета.Параметры.Заполнить(СтруктураВсего_Цена);
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
					НомерСтроки = НомерСтроки + 1;
				КонецЦикла;
				Для Каждого СтрокаТаблицы Из ТаблицаОС Цикл
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
					
					СтруктураВсего_Цена.Всего = Окр(СтрокаТаблицы.Всего * Шапка.Курс / Шапка.Кратность, 2);
					СтруктураВсего_Цена.Цена = Окр(СтрокаТаблицы.Цена * Шапка.Курс / Шапка.Кратность, 2);
					
					ОбластьМакета.Параметры.Заполнить(СтруктураВсего_Цена);
					
					ТабличныйДокумент.Вывести(ОбластьМакета);
					НомерСтроки = НомерСтроки + 1;
				КонецЦикла;
				
			Иначе
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;	
		КонецЦикла;
		
		БухгалтерскиеОтчеты.ВыводПодписиРуководителей(ТабличныйДокумент, Шапка);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.     
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;      
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
		 // Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Накладная",  НСтр("ru = 'Накладная'"), ПечатьНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,
			"Документ.КорректировкаСтоимостиПоступления.ПФ_MXL_Накладная");
	КонецЕсли;

КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Накладная";
	КомандаПечати.Представление = НСтр("ru = 'Накладная'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает заголовок документа для печатной формы.
//
// Параметры:
//  Шапка - любая структура с полями:
//           Номер         - Строка или Число - номер документа;
//           Дата          - Дата - дата документа;
//           Представление - Строка - (необязательный) платформенное представление ссылки на документ.
//                                    Если параметр НазваниеДокумента не задан, то название документа будет вычисляться
//                                    из этого параметра.
//  НазваниеДокумента - Строка - название документа (например, "Счет на оплату").
//
// Возвращаемое значение:
//  Строка - заголовок документа.
//
Функция СформироватьЗаголовокДокумента(Шапка, Знач НазваниеДокумента = "")
	
	ДанныеДокумента = Новый Структура("Номер,Дата,Представление");
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, Шапка);
	
	// Если название документа не передано, получим название по представлению документа.
	Если ПустаяСтрока(НазваниеДокумента) И ЗначениеЗаполнено(ДанныеДокумента.Представление) Тогда
		ПоложениеНомера = СтрНайти(ДанныеДокумента.Представление, ДанныеДокумента.Номер);
		Если ПоложениеНомера > 0 Тогда
			НазваниеДокумента = СокрЛП(Лев(ДанныеДокумента.Представление, ПоложениеНомера - 1));
		КонецЕсли;
	КонецЕсли;

	НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокумента.Номер);
	Возврат СтрШаблон(НСтр("ru = '%1 № %2 от %3'"),
		НазваниеДокумента, НомерНаПечать, Формат(ДанныеДокумента.Дата, "ДЛФ=DD"));
	
КонецФункции

#КонецОбласти

#КонецЕсли