#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Заполнение заголовка печатных форм
//
Процедура ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета, ИмяМакета)

	Организация 	= СтруктураПараметров.Организация;
	НачалоПериода 	= СтруктураПараметров.НачалоПериода;
	КонецПериода 	= СтруктураПараметров.КонецПериода;		
	
	КонтактныеДанные = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСведенияОбОрганизации(Организация, КонецПериода);

	ОКПО              				= КонтактныеДанные.ОКПО;
	ИНН 							= КонтактныеДанные.ИНН;
	ГНСНаименование                 = КонтактныеДанные.ГНСНаименование;
	КодГНС 							= КонтактныеДанные.ГНСКод;
	ОрганизацияНаменованиеПолное    = КонтактныеДанные.НаименованиеПолное;
	Индекс  						= КонтактныеДанные.Индекс;
	Город  							= КонтактныеДанные.Город;
	Улица							= КонтактныеДанные.Улица; 
	Телефон							= КонтактныеДанные.Тел;
	ЭлектроннаяПочта 				= КонтактныеДанные.Email; 
	
	ДанныеПечати = Новый Структура();
	ДанныеПечати.Вставить("ОРГАНИЗАЦИЯ", 	ОрганизацияНаменованиеПолное);
	ДанныеПечати.Вставить("НАЛОГОВАЯ", 		ГНСНаименование);
	ДанныеПечати.Вставить("ГОРОД", 			Город);
	ДанныеПечати.Вставить("АДРЕС", 			Улица);
	ДанныеПечати.Вставить("ТЕЛЕФОН", 		Телефон);
	ДанныеПечати.Вставить("ЕМЭЙЛ", 			ЭлектроннаяПочта);
	
	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	
	ОбластьМакета.Параметры.ИНН1 = Сред(ИНН, 1, 1);
	ОбластьМакета.Параметры.ИНН2 = Сред(ИНН, 2, 1);
	ОбластьМакета.Параметры.ИНН3 = Сред(ИНН, 3, 1);                           
	ОбластьМакета.Параметры.ИНН4 = Сред(ИНН, 4, 1);
	ОбластьМакета.Параметры.ИНН5 = Сред(ИНН, 5, 1);
	ОбластьМакета.Параметры.ИНН6 = Сред(ИНН, 6, 1);
	ОбластьМакета.Параметры.ИНН7 = Сред(ИНН, 7, 1);
	ОбластьМакета.Параметры.ИНН8 = Сред(ИНН, 8, 1);
	ОбластьМакета.Параметры.ИНН9 = Сред(ИНН, 9, 1);
	ОбластьМакета.Параметры.ИНН10 = Сред(ИНН, 10, 1);
	ОбластьМакета.Параметры.ИНН11 = Сред(ИНН, 11, 1);
	ОбластьМакета.Параметры.ИНН12 = Сред(ИНН, 12, 1);
	ОбластьМакета.Параметры.ИНН13 = Сред(ИНН, 13, 1);
	ОбластьМакета.Параметры.ИНН14 = Сред(ИНН, 14, 1);         
	
	ОбластьМакета.Параметры.ГНС1 = Сред(КодГНС, 1, 1);
	ОбластьМакета.Параметры.ГНС2 = Сред(КодГНС, 2, 1);
	ОбластьМакета.Параметры.ГНС3 = Сред(КодГНС, 3, 1);
	
	Если ЗначениеЗаполнено(ОКПО) Тогда 
		ОбластьМакета.Параметры.ОКПО1 = Сред(ОКПО,1,1);
		ОбластьМакета.Параметры.ОКПО2 = Сред(ОКПО,2,1);
		ОбластьМакета.Параметры.ОКПО3 = Сред(ОКПО,3,1);
		ОбластьМакета.Параметры.ОКПО4 = Сред(ОКПО,4,1);
		ОбластьМакета.Параметры.ОКПО5 = Сред(ОКПО,5,1);
		ОбластьМакета.Параметры.ОКПО6 = Сред(ОКПО,6,1);
		ОбластьМакета.Параметры.ОКПО7 = Сред(ОКПО,7,1);
		ОбластьМакета.Параметры.ОКПО8 = Сред(ОКПО,8,1);
	КонецЕсли;
	
	ОбластьМакета.Параметры.ДатаН1 = Сред(НачалоПериода, 1, 1);	
	ОбластьМакета.Параметры.ДатаН2 = Сред(НачалоПериода, 2, 1);	
	ОбластьМакета.Параметры.ДатаН3 = Сред(НачалоПериода, 4, 1);	
	ОбластьМакета.Параметры.ДатаН4 = Сред(НачалоПериода, 5, 1);	
	ОбластьМакета.Параметры.ДатаН5 = Сред(НачалоПериода, 7, 1);	
	ОбластьМакета.Параметры.ДатаН6 = Сред(НачалоПериода, 8, 1);	
	ОбластьМакета.Параметры.ДатаН7 = Сред(НачалоПериода, 9, 1);	
	ОбластьМакета.Параметры.ДатаН8 = Сред(НачалоПериода, 10, 1);		
		
	ОбластьМакета.Параметры.ДатаК1 = Сред(КонецПериода, 1, 1);	
	ОбластьМакета.Параметры.ДатаК2 = Сред(КонецПериода, 2, 1);	
	ОбластьМакета.Параметры.ДатаК3 = Сред(КонецПериода, 4, 1);	
	ОбластьМакета.Параметры.ДатаК4 = Сред(КонецПериода, 5, 1);	
	ОбластьМакета.Параметры.ДатаК5 = Сред(КонецПериода, 7, 1);	
	ОбластьМакета.Параметры.ДатаК6 = Сред(КонецПериода, 8, 1);	
	ОбластьМакета.Параметры.ДатаК7 = Сред(КонецПериода, 9, 1);	
	ОбластьМакета.Параметры.ДатаК8 = Сред(КонецПериода, 10, 1);
		
	Если ИмяМакета = "ОсновнаяФорма"
		И ЗначениеЗаполнено(Индекс) Тогда
		ОбластьМакета.Параметры.ИНДЕКС1 = Сред(Индекс, 1, 1);	
		ОбластьМакета.Параметры.ИНДЕКС2 = Сред(Индекс, 2, 1);	
		ОбластьМакета.Параметры.ИНДЕКС3 = Сред(Индекс, 4, 1);	
		ОбластьМакета.Параметры.ИНДЕКС4 = Сред(Индекс, 5, 1);	
		ОбластьМакета.Параметры.ИНДЕКС5 = Сред(Индекс, 7, 1);	
		ОбластьМакета.Параметры.ИНДЕКС6 = Сред(Индекс, 8, 1);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//@skip-warning
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьОсновнаяФорма(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоКосвеннымНалогам.Ссылка КАК Ссылка,
		|	ОтчетПоКосвеннымНалогам.Дата КАК Дата,
		|	ОтчетПоКосвеннымНалогам.Организация КАК Организация,
		|	ОтчетПоКосвеннымНалогам.ОсновнаяФорма.(
		|		КодСтроки КАК КодСтроки,
		|		Сумма КАК Сумма
		|	) КАК ОсновнаяФорма
		|ИЗ
		|	Документ.ОтчетПоКосвеннымНалогам КАК ОтчетПоКосвеннымНалогам
		|ГДЕ
		|	ОтчетПоКосвеннымНалогам.Ссылка В (&СписокДокументов)";		
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоКосвеннымНалогам_ОсновнаяФорма";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_ОсновнаяФорма");
	ИмяМакета = "ОсновнаяФорма";
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", 	Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", 	НачалоМесяца(Шапка.Дата));
		СтруктураПараметров.Вставить("КонецПериода", 	КонецМесяца(Шапка.Дата));

 		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета, ИмяМакета);
		
		Выборка = Шапка.ОсновнаяФорма.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.КодСтроки = "050" Тогда
				ОбластьМакета.Параметры.Сумма050 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "051" Тогда
				ОбластьМакета.Параметры.Сумма051 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "052" Тогда
				ОбластьМакета.Параметры.Сумма052 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "053" Тогда
				ОбластьМакета.Параметры.Сумма053 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "054" Тогда
				ОбластьМакета.Параметры.Сумма054 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "055" Тогда
				ОбластьМакета.Параметры.Сумма055 = Выборка.Сумма;	
			КонецЕсли;
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложение1(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоКосвеннымНалогам.Ссылка КАК Ссылка,
		|	ОтчетПоКосвеннымНалогам.Дата КАК Дата,
		|	ОтчетПоКосвеннымНалогам.Организация КАК Организация,
		|	ОтчетПоКосвеннымНалогам.Приложение1.(
		|		КодСтроки КАК КодСтроки,
		|		Сумма КАК Сумма,
		|		СуммаНДС КАК СуммаНДС
		|	) КАК Приложение1
		|ИЗ
		|	Документ.ОтчетПоКосвеннымНалогам КАК ОтчетПоКосвеннымНалогам
		|ГДЕ
		|	ОтчетПоКосвеннымНалогам.Ссылка В (&СписокДокументов)";		
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоКосвеннымНалогам_Приложение1";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение1");
	ИмяМакета = "Приложение1";
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", 	Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", 	НачалоМесяца(Шапка.Дата));
		СтруктураПараметров.Вставить("КонецПериода", 	КонецМесяца(Шапка.Дата));

 		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета, ИмяМакета);
		
		Выборка = Шапка.Приложение1.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.КодСтроки = "150" Тогда
				ОбластьМакета.Параметры.Лизинг 				= Выборка.Сумма;
				ОбластьМакета.Параметры.ЛизингНДС 			= Выборка.СуммаНДС;
				
			ИначеЕсли Выборка.КодСтроки = "151" Тогда
				ОбластьМакета.Параметры.ДавСырье 			= Выборка.Сумма;
				ОбластьМакета.Параметры.ДавСырьеНДС 		= Выборка.СуммаНДС;
				
			ИначеЕсли Выборка.КодСтроки = "152" Тогда
				ОбластьМакета.Параметры.Транспорт 			= Выборка.Сумма;
				ОбластьМакета.Параметры.ТранспортНДС 		= Выборка.СуммаНДС;
				
			ИначеЕсли Выборка.КодСтроки = "153" Тогда
				ОбластьМакета.Параметры.ПрочийИмпорт 		= Выборка.Сумма;
				ОбластьМакета.Параметры.ПрочийИмпортНДС 	= Выборка.СуммаНДС;
				
			ИначеЕсли Выборка.КодСтроки = "198" Тогда
				ОбластьМакета.Параметры.ИмпортОбщий 		= Выборка.Сумма;
				ОбластьМакета.Параметры.ИмпортОбщийНДС 		= Выборка.СуммаНДС;
				
			ИначеЕсли Выборка.КодСтроки = "199" Тогда
				ОбластьМакета.Параметры.ОблагаемыйИмпорт 	= Выборка.Сумма;
				ОбластьМакета.Параметры.ОблагаемыйИмпортНДС = Выборка.СуммаНДС;	
			КонецЕсли;
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложение2(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоКосвеннымНалогам.Ссылка КАК Ссылка,
		|	ОтчетПоКосвеннымНалогам.Дата КАК Дата,
		|	ОтчетПоКосвеннымНалогам.Организация КАК Организация,
		|	ОтчетПоКосвеннымНалогам.Приложение2.(
		|		НомерСтроки КАК НомерСтроки,
		|		КодСтраны КАК КодСтраны,
		|		НомерЗаявления КАК НомерЗаявления,
		|		ДатаЗаявления КАК ДатаЗаявления,
		|		СтоимостьТовара КАК СтоимостьТовара,
		|		УвеличениеСтоимостиСУчетомМУКЦ КАК УвеличениеСтоимости,
		|		СуммаАкцизногоНалога КАК СуммаАкцизногоНалога,
		|		СуммаНДС КАК СуммаНДС,
		|		НачислениеНДССУчетомМУКЦ КАК НачислениеНДС,
		|		СуммаНДСЗачет КАК СуммаНДСЗачет
		|	) КАК Приложение2
		|ИЗ
		|	Документ.ОтчетПоКосвеннымНалогам КАК ОтчетПоКосвеннымНалогам
		|ГДЕ
		|	ОтчетПоКосвеннымНалогам.Ссылка В(&СписокДокументов)";		
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоКосвеннымНалогам_Приложение2";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение2");
	ИмяМакета = "Приложение2";
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", 	Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", 	НачалоМесяца(Шапка.Дата));
		СтруктураПараметров.Вставить("КонецПериода", 	КонецМесяца(Шапка.Дата));

 		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета, ИмяМакета);		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");		
		ОбластьИтоги 	= Макет.ПолучитьОбласть("Итого");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластиПроверки = Новый Массив();
		
		ДанныеПечати = Новый Структура();
		ДанныеПечати.Вставить("КодСтраны1", "");
		ДанныеПечати.Вставить("КодСтраны2", "");
		ДанныеПечати.Вставить("КодСтраны3", "");
		ДанныеПечати.Вставить("СуммаНДСИтого", 0);
		ДанныеПечати.Вставить("НачислениеНДСИтого", 0);
		ДанныеПечати.Вставить("СуммаНДСЗачетИтого", 0);
				
		ВыборкаПриложение2 = Шапка.Приложение2.Выбрать();
		КоличествоСтрок = ВыборкаПриложение2.Количество();
		НомерСтроки = 1;
		
		Пока ВыборкаПриложение2.Следующий() Цикл			
			ДанныеПечати.Вставить("КодСтраны1", Сред(ВыборкаПриложение2.КодСтраны, 1, 1));
			ДанныеПечати.Вставить("КодСтраны2", Сред(ВыборкаПриложение2.КодСтраны, 2, 1));
			ДанныеПечати.Вставить("КодСтраны3", Сред(ВыборкаПриложение2.КодСтраны, 3, 1));
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаПриложение2);
			ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
			
			ДанныеПечати.СуммаНДСИтого 		= ДанныеПечати.СуммаНДСИтого + ВыборкаПриложение2.СуммаНДС;
			ДанныеПечати.НачислениеНДСИтого = ДанныеПечати.НачислениеНДСИтого + ВыборкаПриложение2.НачислениеНДС;
			ДанныеПечати.СуммаНДСЗачетИтого = ДанныеПечати.СуммаНДСЗачетИтого + ВыборкаПриложение2.СуммаНДСЗачет;
			
			ОбластиПроверки.Добавить(ОбластьСтрока);
			
			Если КоличествоСтрок = НомерСтроки Тогда
				ОбластьИтоги.Параметры.Заполнить(ДанныеПечати);
				ОбластиПроверки.Добавить(ОбластьИтоги);
			КонецЕсли;	
				
			Если НЕ ТабличныйДокумент.ПроверитьВывод(ОбластиПроверки) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьШапка);	
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ОбластиПроверки.Удалить(0);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложение3(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоКосвеннымНалогам.Ссылка КАК Ссылка,
		|	ОтчетПоКосвеннымНалогам.Дата КАК Дата,
		|	ОтчетПоКосвеннымНалогам.Организация КАК Организация,
		|	ОтчетПоКосвеннымНалогам.Приложение3.(
		|		НомерСтроки КАК НомерСтроки,
		|		КодТНВЭД КАК КодТНВЭД,
		|		Номенклатура КАК НаименованиеТовара,
		|		НомерСтрокиВЗаявлении КАК НомерСтрокиВЗаявлении,
		|		НомерЗаявленияОВвозе КАК НомерЗаявления,
		|		ДатаЗаявленияОВвозеТоваров КАК ДатаЗаявления,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		ЦенаЗаЕдТовараПоДоговору КАК Цена,
		|		МУКЦЗаЕдиницуТовара КАК МУКЦЗаЕдиницу,
		|		КоличествоИмпортированногоТовара КАК Количество,
		|		РазницаВСтоимостиТовараСУчетомМУКЦ КАК РазницаВСтоимости,
		|		НачислениеНДССУчетомМУКЦ КАК НДС
		|	) КАК Приложение3
		|ИЗ
		|	Документ.ОтчетПоКосвеннымНалогам КАК ОтчетПоКосвеннымНалогам
		|ГДЕ
		|	ОтчетПоКосвеннымНалогам.Ссылка В(&СписокДокументов)";		
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоКосвеннымНалогам_Приложение3";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение3");
	ИмяМакета = "Приложение3";
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", 	Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", 	НачалоМесяца(Шапка.Дата));
		СтруктураПараметров.Вставить("КонецПериода", 	КонецМесяца(Шапка.Дата));

 		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета, ИмяМакета);		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");		
		ОбластьИтого 	= Макет.ПолучитьОбласть("Итого");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластиПроверки = Новый Массив();
		
		ИтогиПоЛисту = Новый Структура();
		ИтогиПоЛисту.Вставить("ВсегоКол", 0);
		ИтогиПоЛисту.Вставить("ВсегоРазницаСУчетомМУКЦ", 0);
		ИтогиПоЛисту.Вставить("ВсегоСуммНДССМУКЦ", 0);
		
		ДанныеПечати = Новый Структура();
		ДанныеПечати.Вставить("КодТНВЭД1", "");
		ДанныеПечати.Вставить("КодТНВЭД2", "");
		ДанныеПечати.Вставить("КодТНВЭД3", "");
		ДанныеПечати.Вставить("КодТНВЭД4", "");
		ДанныеПечати.Вставить("КодТНВЭД5", "");
		ДанныеПечати.Вставить("КодТНВЭД6", "");
		ДанныеПечати.Вставить("КодТНВЭД7", "");
		ДанныеПечати.Вставить("КодТНВЭД8", "");
		ДанныеПечати.Вставить("КодТНВЭД9", "");
		ДанныеПечати.Вставить("КодТНВЭД10", "");
		ДанныеПечати.Вставить("КоличествоИтого", 0);
		ДанныеПечати.Вставить("РазницаВСтоимостиИтого", 0);
		ДанныеПечати.Вставить("НДСИтого", 0);
		
		ВыборкаПриложение3 = Шапка.Приложение3.Выбрать();
		КоличествоСтрок = ВыборкаПриложение3.Количество();
		НомерСтроки = 1;
		
		Пока ВыборкаПриложение3.Следующий() Цикл			
			ДанныеПечати.КодТНВЭД1 = Сред(ВыборкаПриложение3.КодТНВЭД, 1, 1);
			ДанныеПечати.КодТНВЭД2 = Сред(ВыборкаПриложение3.КодТНВЭД, 2, 1);
			ДанныеПечати.КодТНВЭД3 = Сред(ВыборкаПриложение3.КодТНВЭД, 3, 1);
			ДанныеПечати.КодТНВЭД4 = Сред(ВыборкаПриложение3.КодТНВЭД, 4, 1);
			ДанныеПечати.КодТНВЭД5 = Сред(ВыборкаПриложение3.КодТНВЭД, 5, 1);
			ДанныеПечати.КодТНВЭД6 = Сред(ВыборкаПриложение3.КодТНВЭД, 6, 1);
			ДанныеПечати.КодТНВЭД7 = Сред(ВыборкаПриложение3.КодТНВЭД, 7, 1);
			ДанныеПечати.КодТНВЭД8 = Сред(ВыборкаПриложение3.КодТНВЭД, 8, 1);
			ДанныеПечати.КодТНВЭД9 = Сред(ВыборкаПриложение3.КодТНВЭД, 9, 1);
			ДанныеПечати.КодТНВЭД10 = Сред(ВыборкаПриложение3.КодТНВЭД, 10, 1);
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаПриложение3);
			ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
			
			ДанныеПечати.КоличествоИтого 		= ДанныеПечати.КоличествоИтого + ВыборкаПриложение3.Количество;
			ДанныеПечати.РазницаВСтоимостиИтого = ДанныеПечати.РазницаВСтоимостиИтого + ВыборкаПриложение3.РазницаВСтоимости;
			ДанныеПечати.НДСИтого 		 		= ДанныеПечати.НДСИтого + ВыборкаПриложение3.НДС;
			
			ОбластиПроверки.Добавить(ОбластьСтрока);
			
			Если КоличествоСтрок = НомерСтроки Тогда
				ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
				ОбластиПроверки.Добавить(ОбластьИтого);	
			КонецЕсли;	
			
			Если НЕ ТабличныйДокумент.ПроверитьВывод(ОбластиПроверки) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьШапка);
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);	
			
			ОбластиПроверки.Удалить(0);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложение4(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоКосвеннымНалогам.Ссылка КАК Ссылка,
		|	ОтчетПоКосвеннымНалогам.Дата КАК Дата,
		|	ОтчетПоКосвеннымНалогам.Организация КАК Организация,
		|	ОтчетПоКосвеннымНалогам.Приложение4.(
		|		КодСтроки КАК КодСтроки,
		|		Сумма КАК Сумма
		|	) КАК Приложение3
		|ИЗ
		|	Документ.ОтчетПоКосвеннымНалогам КАК ОтчетПоКосвеннымНалогам
		|ГДЕ
		|	ОтчетПоКосвеннымНалогам.Ссылка В (&СписокДокументов)";		
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоКосвеннымНалогам_Приложение4";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение4");
	ИмяМакета = "Приложение4";
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", 	Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", 	НачалоМесяца(Шапка.Дата));
		СтруктураПараметров.Вставить("КонецПериода", 	КонецМесяца(Шапка.Дата));

 		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета, ИмяМакета);
		
		Выборка = Шапка.Приложение3.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.КодСтроки = "350" Тогда
				ОбластьМакета.Параметры.Сумма350 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "351" Тогда
				ОбластьМакета.Параметры.Сумма351 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "352" Тогда
				ОбластьМакета.Параметры.Сумма352 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "353" Тогда
				ОбластьМакета.Параметры.Сумма353 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "354" Тогда
				ОбластьМакета.Параметры.Сумма354 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "355" Тогда
				ОбластьМакета.Параметры.Сумма355 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "356" Тогда
				ОбластьМакета.Параметры.Сумма356 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "357" Тогда
				ОбластьМакета.Параметры.Сумма357 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "358" Тогда
				ОбластьМакета.Параметры.Сумма358 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "359" Тогда
				ОбластьМакета.Параметры.Сумма359 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "360" Тогда
				ОбластьМакета.Параметры.Сумма360 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "398" Тогда
				ОбластьМакета.Параметры.Сумма398 = Выборка.Сумма;
				
			ИначеЕсли Выборка.КодСтроки = "399" Тогда
				ОбластьМакета.Параметры.Сумма399 = Выборка.Сумма;
			КонецЕсли;
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложение5(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоКосвеннымНалогам.Ссылка КАК Ссылка,
		|	ОтчетПоКосвеннымНалогам.Дата КАК Дата,
		|	ОтчетПоКосвеннымНалогам.Организация КАК Организация,
		|	ОтчетПоКосвеннымНалогам.Приложение5.(
		|		КодСтроки КАК КодСтроки,
		|		ОблагаемыйОбъем КАК ОблагаемыйОбъем,
		|		СтавкаАкциза КАК СтавкаАкциза,
		|		СуммаАкциза КАК СуммаАкциза
		|	) КАК Приложение5
		|ИЗ
		|	Документ.ОтчетПоКосвеннымНалогам КАК ОтчетПоКосвеннымНалогам
		|ГДЕ
		|	ОтчетПоКосвеннымНалогам.Ссылка В (&СписокДокументов)";		
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоКосвеннымНалогам_Приложение5";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение5");
	ИмяМакета = "Приложение5";
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", 	Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", 	НачалоМесяца(Шапка.Дата));
		СтруктураПараметров.Вставить("КонецПериода", 	КонецМесяца(Шапка.Дата));

 		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета, ИмяМакета);
		
		ДанныеПечати = Новый Структура();
		ДанныеПечати.Вставить("Объем420_Литр", 	0);
		ДанныеПечати.Вставить("Объем420_1000", 	0);
		ДанныеПечати.Вставить("Объем420_Шт", 	0);
		ДанныеПечати.Вставить("Объем420_кг", 	0);
		ДанныеПечати.Вставить("Объем420_Тн", 	0);
		ДанныеПечати.Вставить("Объем420_Мл", 	0);
		ДанныеПечати.Вставить("Акциз420", 		0);
		
		ВыборкаПриложение5 = Шапка.Приложение5.Выбрать();
		
		Пока ВыборкаПриложение5.Следующий() Цикл
			Если ВыборкаПриложение5.КодСтроки = "401" Тогда                              
				ОбластьМакета.Параметры.Объем401 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Акциз401 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_Литр 			= ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 				= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "402" Тогда
				ОбластьМакета.Параметры.Объем402_1000 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Акциз402_1000 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_1000 				= ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 					= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "403" Тогда
				ОбластьМакета.Параметры.Объем403 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Ставка403 	= ВыборкаПриложение5.СтавкаАкциза;
				ОбластьМакета.Параметры.Акциз403 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_Тн 			= ДанныеПечати.Объем420_Тн + ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 				= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "404" Тогда
				ОбластьМакета.Параметры.Объем404 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Ставка404 	= ВыборкаПриложение5.СтавкаАкциза;
				ОбластьМакета.Параметры.Акциз404 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_Тн 			= ДанныеПечати.Объем420_Тн + ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 				= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "405" Тогда
				ОбластьМакета.Параметры.Объем405 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Ставка405 	= ВыборкаПриложение5.СтавкаАкциза;
				ОбластьМакета.Параметры.Акциз405 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_Тн 			= ДанныеПечати.Объем420_Тн + ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 				= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "406" Тогда
				ОбластьМакета.Параметры.Объем406 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Ставка406 	= ВыборкаПриложение5.СтавкаАкциза;
				ОбластьМакета.Параметры.Акциз406 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_Тн 			= ДанныеПечати.Объем420_Тн + ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 				= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "407" Тогда
				ОбластьМакета.Параметры.Объем407 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Ставка407 	= ВыборкаПриложение5.СтавкаАкциза;
				ОбластьМакета.Параметры.Акциз407 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_Тн 			= ДанныеПечати.Объем420_Тн + ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 				= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "408" Тогда
				ОбластьМакета.Параметры.Объем408 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Ставка408 	= ВыборкаПриложение5.СтавкаАкциза;
				ОбластьМакета.Параметры.Акциз408 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_Тн 			= ДанныеПечати.Объем420_Тн + ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 				= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "409" Тогда
				ОбластьМакета.Параметры.Объем409 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Ставка409 	= ВыборкаПриложение5.СтавкаАкциза;
				ОбластьМакета.Параметры.Акциз409 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_Тн 			= ДанныеПечати.Объем420_Тн + ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 				= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "410" Тогда
				ОбластьМакета.Параметры.Объем410 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Ставка410 	= ВыборкаПриложение5.СтавкаАкциза;
				ОбластьМакета.Параметры.Акциз410 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_Тн 			= ДанныеПечати.Объем420_Тн + ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 				= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "411" Тогда
				ОбластьМакета.Параметры.Объем411 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Ставка411 	= ВыборкаПриложение5.СтавкаАкциза;
				ОбластьМакета.Параметры.Акциз411 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_Тн 			= ДанныеПечати.Объем420_Тн + ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 				= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "412" Тогда
				ОбластьМакета.Параметры.Объем412 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Ставка412 	= ВыборкаПриложение5.СтавкаАкциза;
				ОбластьМакета.Параметры.Акциз412 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_Тн 			= ДанныеПечати.Объем420_Тн + ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 				= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "413" Тогда
				ОбластьМакета.Параметры.Объем413 	= ВыборкаПриложение5.ОблагаемыйОбъем;
				ОбластьМакета.Параметры.Ставка413 	= ВыборкаПриложение5.СтавкаАкциза;
				ОбластьМакета.Параметры.Акциз413 	= ВыборкаПриложение5.СуммаАкциза;
				ДанныеПечати.Объем420_Тн 			= ДанныеПечати.Объем420_Тн + ВыборкаПриложение5.ОблагаемыйОбъем;
				ДанныеПечати.Акциз420 				= ДанныеПечати.Акциз420 + ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "421" Тогда
				ОбластьМакета.Параметры.Акциз421 	= ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "422" Тогда
				ОбластьМакета.Параметры.Акциз422 	= ВыборкаПриложение5.СуммаАкциза;
				
			ИначеЕсли ВыборкаПриложение5.КодСтроки = "423" Тогда
				ОбластьМакета.Параметры.Акциз423 	= ВыборкаПриложение5.СуммаАкциза;	
			КонецЕсли;
		КонецЦикла;	
		
		// Заполнение графы номер "420".
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложение6(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоКосвеннымНалогам.Ссылка КАК Ссылка,
		|	ОтчетПоКосвеннымНалогам.Дата КАК Дата,
		|	ОтчетПоКосвеннымНалогам.Организация КАК Организация,
		|	ОтчетПоКосвеннымНалогам.Приложение6.(
		|		ВидАлкогольнойПродукции КАК ВидПродукции,
		|		КодТНВЭД КАК КодТНВЭД,
		|		СодержаниеСпиртаВ1Литре КАК СодержаниеСпирта,
		|		ОблагаемыйОбъем КАК ОблагаемыйОбъем,
		|		СтавкаАкциза КАК СтавкаАкциза,
		|		СуммаАкциза КАК СуммаАкциза
		|	) КАК Приложение6
		|ИЗ
		|	Документ.ОтчетПоКосвеннымНалогам КАК ОтчетПоКосвеннымНалогам
		|ГДЕ
		|	ОтчетПоКосвеннымНалогам.Ссылка В(&СписокДокументов)";		
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоКосвеннымНалогам_Приложение6";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение6");
	ИмяМакета = "Приложение6";
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", 	Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", 	НачалоМесяца(Шапка.Дата));
		СтруктураПараметров.Вставить("КонецПериода", 	КонецМесяца(Шапка.Дата));

 		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета, ИмяМакета);		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");		
		ОбластьИтоги 	= Макет.ПолучитьОбласть("Итого");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластиПроверки = Новый Массив();
		
		ДанныеПечати = Новый Структура();
		ДанныеПечати.Вставить("КодТНВЭД1", "");
		ДанныеПечати.Вставить("КодТНВЭД2", "");
		ДанныеПечати.Вставить("КодТНВЭД3", "");
		ДанныеПечати.Вставить("КодТНВЭД4", "");
		ДанныеПечати.Вставить("КодТНВЭД5", "");
		ДанныеПечати.Вставить("КодТНВЭД6", "");
		ДанныеПечати.Вставить("КодТНВЭД7", "");
		ДанныеПечати.Вставить("КодТНВЭД8", "");
		ДанныеПечати.Вставить("КодТНВЭД9", "");
		ДанныеПечати.Вставить("КодТНВЭД10", "");
		ДанныеПечати.Вставить("ОблагаемыйОбъемИтого", 0);
		ДанныеПечати.Вставить("СуммаАкцизаИтого", 0);
				
		ВыборкаПриложение6 = Шапка.Приложение6.Выбрать();
		КоличествоСтрок = ВыборкаПриложение6.Количество();
		НомерСтроки = 1;
		
		Пока ВыборкаПриложение6.Следующий() Цикл			
			ДанныеПечати.КодТНВЭД1 = Сред(ВыборкаПриложение6.КодТНВЭД, 1, 1);
			ДанныеПечати.КодТНВЭД2 = Сред(ВыборкаПриложение6.КодТНВЭД, 2, 1);
			ДанныеПечати.КодТНВЭД3 = Сред(ВыборкаПриложение6.КодТНВЭД, 3, 1);
			ДанныеПечати.КодТНВЭД4 = Сред(ВыборкаПриложение6.КодТНВЭД, 4, 1);
			ДанныеПечати.КодТНВЭД5 = Сред(ВыборкаПриложение6.КодТНВЭД, 5, 1);
			ДанныеПечати.КодТНВЭД6 = Сред(ВыборкаПриложение6.КодТНВЭД, 6, 1);
			ДанныеПечати.КодТНВЭД7 = Сред(ВыборкаПриложение6.КодТНВЭД, 7, 1);
			ДанныеПечати.КодТНВЭД8 = Сред(ВыборкаПриложение6.КодТНВЭД, 8, 1);
			ДанныеПечати.КодТНВЭД9 = Сред(ВыборкаПриложение6.КодТНВЭД, 9, 1);
			ДанныеПечати.КодТНВЭД10 = Сред(ВыборкаПриложение6.КодТНВЭД, 10, 1);
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаПриложение6);
			ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
			
			ДанныеПечати.ОблагаемыйОбъемИтого 	= ДанныеПечати.ОблагаемыйОбъемИтого + ВыборкаПриложение6.ОблагаемыйОбъем;
			ДанныеПечати.СуммаАкцизаИтого 		= ДанныеПечати.СуммаАкцизаИтого + ВыборкаПриложение6.СуммаАкциза;
			
			ОбластиПроверки.Добавить(ОбластьСтрока);
			
			Если КоличествоСтрок = НомерСтроки Тогда
				ОбластьИтоги.Параметры.Заполнить(ДанныеПечати);
				ОбластиПроверки.Добавить(ОбластьИтоги);
			КонецЕсли;	
				
			Если НЕ ТабличныйДокумент.ПроверитьВывод(ОбластиПроверки) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьШапка);	
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ОбластиПроверки.Удалить(0);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложение7(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоКосвеннымНалогам.Ссылка КАК Ссылка,
		|	ОтчетПоКосвеннымНалогам.Дата КАК Дата,
		|	ОтчетПоКосвеннымНалогам.Организация КАК Организация,
		|	ОтчетПоКосвеннымНалогам.Приложение7.(
		|		ВидТабачнойПродукции КАК ВидПродукции,
		|		КодТНВЭД КАК КодТНВЭД,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		ОблагаемыйОбъем КАК ОблагаемыйОбъем,
		|		СтавкаАкциза КАК СтавкаАкциза,
		|		СуммаАкциза КАК СуммаАкциза
		|	) КАК Приложение7
		|ИЗ
		|	Документ.ОтчетПоКосвеннымНалогам КАК ОтчетПоКосвеннымНалогам
		|ГДЕ
		|	ОтчетПоКосвеннымНалогам.Ссылка В(&СписокДокументов)";		
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоКосвеннымНалогам_Приложение7";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение7");
	ИмяМакета = "Приложение7";
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", 	Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", 	НачалоМесяца(Шапка.Дата));
		СтруктураПараметров.Вставить("КонецПериода", 	КонецМесяца(Шапка.Дата));

 		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета, ИмяМакета);		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");		
		ОбластьИтоги 	= Макет.ПолучитьОбласть("Итого");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластиПроверки = Новый Массив();
		
		ДанныеПечати = Новый Структура();
		ДанныеПечати.Вставить("КодТНВЭД1", "");
		ДанныеПечати.Вставить("КодТНВЭД2", "");
		ДанныеПечати.Вставить("КодТНВЭД3", "");
		ДанныеПечати.Вставить("КодТНВЭД4", "");
		ДанныеПечати.Вставить("КодТНВЭД5", "");
		ДанныеПечати.Вставить("КодТНВЭД6", "");
		ДанныеПечати.Вставить("КодТНВЭД7", "");
		ДанныеПечати.Вставить("КодТНВЭД8", "");
		ДанныеПечати.Вставить("КодТНВЭД9", "");
		ДанныеПечати.Вставить("КодТНВЭД10", "");
		ДанныеПечати.Вставить("ОблагаемыйОбъемИтого_1000", 0);
		ДанныеПечати.Вставить("СуммаАкцизаИтого_1000", 0);
				
		ВыборкаПриложение7 = Шапка.Приложение7.Выбрать();
		КоличествоСтрок = ВыборкаПриложение7.Количество();
		НомерСтроки = 1;
		
		Пока ВыборкаПриложение7.Следующий() Цикл			
			ДанныеПечати.КодТНВЭД1 = Сред(ВыборкаПриложение7.КодТНВЭД, 1, 1);
			ДанныеПечати.КодТНВЭД2 = Сред(ВыборкаПриложение7.КодТНВЭД, 2, 1);
			ДанныеПечати.КодТНВЭД3 = Сред(ВыборкаПриложение7.КодТНВЭД, 3, 1);
			ДанныеПечати.КодТНВЭД4 = Сред(ВыборкаПриложение7.КодТНВЭД, 4, 1);
			ДанныеПечати.КодТНВЭД5 = Сред(ВыборкаПриложение7.КодТНВЭД, 5, 1);
			ДанныеПечати.КодТНВЭД6 = Сред(ВыборкаПриложение7.КодТНВЭД, 6, 1);
			ДанныеПечати.КодТНВЭД7 = Сред(ВыборкаПриложение7.КодТНВЭД, 7, 1);
			ДанныеПечати.КодТНВЭД8 = Сред(ВыборкаПриложение7.КодТНВЭД, 8, 1);
			ДанныеПечати.КодТНВЭД9 = Сред(ВыборкаПриложение7.КодТНВЭД, 9, 1);
			ДанныеПечати.КодТНВЭД10 = Сред(ВыборкаПриложение7.КодТНВЭД, 10, 1);
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаПриложение7);
			ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
			
			ДанныеПечати.ОблагаемыйОбъемИтого_1000 	= ДанныеПечати.ОблагаемыйОбъемИтого_1000 + ВыборкаПриложение7.ОблагаемыйОбъем;
			ДанныеПечати.СуммаАкцизаИтого_1000 		= ДанныеПечати.СуммаАкцизаИтого_1000 + ВыборкаПриложение7.СуммаАкциза;
			
			ОбластиПроверки.Добавить(ОбластьСтрока);
			
			Если КоличествоСтрок = НомерСтроки Тогда
				ОбластьИтоги.Параметры.Заполнить(ДанныеПечати);
				ОбластиПроверки.Добавить(ОбластьИтоги);
			КонецЕсли;	
				
			Если НЕ ТабличныйДокумент.ПроверитьВывод(ОбластиПроверки) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьШапка);	
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ОбластиПроверки.Удалить(0);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложение8(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоКосвеннымНалогам.Ссылка КАК Ссылка,
		|	ОтчетПоКосвеннымНалогам.Дата КАК Дата,
		|	ОтчетПоКосвеннымНалогам.Организация КАК Организация,
		|	ОтчетПоКосвеннымНалогам.Приложение8.(
		|		НомерСтроки КАК НомерСтроки,
		|		НаименованиеВвезенногоДавальческогоСырья КАК НаименованиеВвезенногоДавальческогоСырья,
		|		КодТНВЭД КАК КодТНВЭД,
		|		КоличествоДавальческогоСырьяВвезенногоВОтчетныйПериод КАК КоличествоДавальческогоСырьяВвезенногоВОтчетныйПериод,
		|		КоличествоДавальческогоСырьяПереработанногоВОтчетномПериоде КАК КоличествоДавальческогоСырьяПереработанногоВОтчетномПериоде,
		|		ОстатокДавальческогоСырья КАК ОстатокДавальческогоСырья,
		|		НаименованиеПодакцизныхТоваровПодлежащихЭкспорту КАК НаименованиеПодакцизныхТоваровПодлежащихЭкспорту,
		|		КоличествоТовараПодлежащегоЭкспорту КАК КоличествоТовараПодлежащегоЭкспорту,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		СтавкаАкциза КАК СтавкаАкциза,
		|		ПодлежитВнесению КАК ПодлежитВнесению,
		|		ФактическиВнесенно КАК ФактическиВнесенно,
		|		СуммаДепозитаНеПодтвержденнаяДокументально КАК СуммаДепозитаНеПодтвержденнаяДокументально,
		|		СуммаДепозитаПодлежащаяВозврату КАК СуммаДепозитаПодлежащаяВозврату
		|	) КАК Приложение8
		|ИЗ
		|	Документ.ОтчетПоКосвеннымНалогам КАК ОтчетПоКосвеннымНалогам
		|ГДЕ
		|	ОтчетПоКосвеннымНалогам.Ссылка В(&СписокДокументов)";		
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоКосвеннымНалогам_Приложение8";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение8");
	ИмяМакета = "Приложение8";
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", 	Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", 	НачалоМесяца(Шапка.Дата));
		СтруктураПараметров.Вставить("КонецПериода", 	КонецМесяца(Шапка.Дата));

 		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета, ИмяМакета);		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");		
		ОбластьИтоги 	= Макет.ПолучитьОбласть("Итого");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластиПроверки = Новый Массив();
		
		ДанныеПечати = Новый Структура();
		ДанныеПечати.Вставить("КодТНВЭД1", "");
		ДанныеПечати.Вставить("КодТНВЭД2", "");
		ДанныеПечати.Вставить("КодТНВЭД3", "");
		ДанныеПечати.Вставить("КодТНВЭД4", "");
		ДанныеПечати.Вставить("КодТНВЭД5", "");
		ДанныеПечати.Вставить("КодТНВЭД6", "");
		ДанныеПечати.Вставить("КодТНВЭД7", "");
		ДанныеПечати.Вставить("КодТНВЭД8", "");
		ДанныеПечати.Вставить("КодТНВЭД9", "");
		ДанныеПечати.Вставить("КодТНВЭД10", "");
		ДанныеПечати.Вставить("КоличествоДавальческогоСырьяВвезенногоВОтчетныйПериодИтого_тонн", 0);
		ДанныеПечати.Вставить("КоличествоДавальческогоСырьяПереработанногоВОтчетномПериодеИтого_тонн", 0);
		ДанныеПечати.Вставить("ОстатокДавальческогоСырьяИтого_тонн", 0);
		ДанныеПечати.Вставить("КоличествоТовараПодлежащегоЭкспорту_тонн", 0);
		ДанныеПечати.Вставить("ПодлежитВнесениюИтого", 0);
		ДанныеПечати.Вставить("ФактическиВнесенноИтого", 0);
		ДанныеПечати.Вставить("СуммаДепозитаНеПодтвержденнаяДокументальноИтого", 0);
		ДанныеПечати.Вставить("СуммаДепозитаПодлежащаяВозвратуИтого", 0);
				
		ВыборкаПриложение8 = Шапка.Приложение8.Выбрать();
		КоличествоСтрок = ВыборкаПриложение8.Количество();
		НомерСтроки = 1;
		
		Пока ВыборкаПриложение8.Следующий() Цикл			
			ДанныеПечати.КодТНВЭД1 = Сред(ВыборкаПриложение8.КодТНВЭД, 1, 1);
			ДанныеПечати.КодТНВЭД2 = Сред(ВыборкаПриложение8.КодТНВЭД, 2, 1);
			ДанныеПечати.КодТНВЭД3 = Сред(ВыборкаПриложение8.КодТНВЭД, 3, 1);
			ДанныеПечати.КодТНВЭД4 = Сред(ВыборкаПриложение8.КодТНВЭД, 4, 1);
			ДанныеПечати.КодТНВЭД5 = Сред(ВыборкаПриложение8.КодТНВЭД, 5, 1);
			ДанныеПечати.КодТНВЭД6 = Сред(ВыборкаПриложение8.КодТНВЭД, 6, 1);
			ДанныеПечати.КодТНВЭД7 = Сред(ВыборкаПриложение8.КодТНВЭД, 7, 1);
			ДанныеПечати.КодТНВЭД8 = Сред(ВыборкаПриложение8.КодТНВЭД, 8, 1);
			ДанныеПечати.КодТНВЭД9 = Сред(ВыборкаПриложение8.КодТНВЭД, 9, 1);
			ДанныеПечати.КодТНВЭД10 = Сред(ВыборкаПриложение8.КодТНВЭД, 10, 1);
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаПриложение8);
			ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
			
			ДанныеПечати.КоличествоДавальческогоСырьяВвезенногоВОтчетныйПериодИтого_тонн = 
				ДанныеПечати.КоличествоДавальческогоСырьяВвезенногоВОтчетныйПериодИтого_тонн 
				+ ВыборкаПриложение8.КоличествоДавальческогоСырьяВвезенногоВОтчетныйПериод;
				
			ДанныеПечати.КоличествоДавальческогоСырьяПереработанногоВОтчетномПериодеИтого_тонн = 
				ДанныеПечати.КоличествоДавальческогоСырьяПереработанногоВОтчетномПериодеИтого_тонн 
				+ ВыборкаПриложение8.КоличествоДавальческогоСырьяПереработанногоВОтчетномПериоде;
				
			ДанныеПечати.ОстатокДавальческогоСырьяИтого_тонн = 
				ДанныеПечати.ОстатокДавальческогоСырьяИтого_тонн + ВыборкаПриложение8.ОстатокДавальческогоСырья;
				
			ДанныеПечати.КоличествоТовараПодлежащегоЭкспорту_тонн = 
				ДанныеПечати.КоличествоТовараПодлежащегоЭкспорту_тонн + ВыборкаПриложение8.КоличествоТовараПодлежащегоЭкспорту;
				
			ДанныеПечати.ПодлежитВнесениюИтого 	 = ДанныеПечати.ПодлежитВнесениюИтого + ВыборкаПриложение8.ПодлежитВнесению;
			ДанныеПечати.ФактическиВнесенноИтого = ДанныеПечати.ФактическиВнесенноИтого + ВыборкаПриложение8.ФактическиВнесенно;
			
			ДанныеПечати.СуммаДепозитаНеПодтвержденнаяДокументальноИтого = 
				ДанныеПечати.СуммаДепозитаНеПодтвержденнаяДокументальноИтого 
				+ ВыборкаПриложение8.СуммаДепозитаНеПодтвержденнаяДокументально;
				
			ДанныеПечати.СуммаДепозитаПодлежащаяВозвратуИтого = 
				ДанныеПечати.СуммаДепозитаПодлежащаяВозвратуИтого + ВыборкаПриложение8.СуммаДепозитаПодлежащаяВозврату;	
			
			ОбластиПроверки.Добавить(ОбластьСтрока);
			
			Если КоличествоСтрок = НомерСтроки Тогда
				ОбластьИтоги.Параметры.Заполнить(ДанныеПечати);
				ОбластиПроверки.Добавить(ОбластьИтоги);
			КонецЕсли;	
				
			Если НЕ ТабличныйДокумент.ПроверитьВывод(ОбластиПроверки) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьШапка);	
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ОбластиПроверки.Удалить(0);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложение9(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоКосвеннымНалогам.Ссылка КАК Ссылка,
		|	ОтчетПоКосвеннымНалогам.Дата КАК Дата,
		|	ОтчетПоКосвеннымНалогам.Организация КАК Организация,
		|	ОтчетПоКосвеннымНалогам.Приложение9.(
		|		КодСтроки КАК КодСтроки,
		|		КоличествоИмпортированныхПодакцизныхТоваров КАК КоличествоТоваров,
		|		СтоимостьИмпортированныхПодакцизныхТоваров КАК СтоимостьТоваров
		|	) КАК Приложение9
		|ИЗ
		|	Документ.ОтчетПоКосвеннымНалогам КАК ОтчетПоКосвеннымНалогам
		|ГДЕ
		|	ОтчетПоКосвеннымНалогам.Ссылка В(&СписокДокументов)";		
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоКосвеннымНалогам_Приложение9";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение9");
	ИмяМакета = "Приложение9";
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", 	Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", 	НачалоМесяца(Шапка.Дата));
		СтруктураПараметров.Вставить("КонецПериода", 	КонецМесяца(Шапка.Дата));

 		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета, ИмяМакета);
		
		ДанныеПечати = Новый Структура();
		ДанныеПечати.Вставить("КоличествоИмпортированныхПодакцизныхТоваров920_литр"	, 	0);
		ДанныеПечати.Вставить("КоличествоИмпортированныхПодакцизныхТоваров920_1000" , 	0);
		ДанныеПечати.Вставить("КоличествоИмпортированныхПодакцизныхТоваров920_тонна" , 	0);
		ДанныеПечати.Вставить("СтоимостьИмпортированныхПодакцизныхТоваров920", 			0);
		
		Выборка = Шапка.Приложение9.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.КодСтроки = "901" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров901 	= Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров901 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_литр 		= Выборка.СтоимостьТоваров;
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;
				
			ИначеЕсли Выборка.КодСтроки = "902" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров902_1000 = Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров902_1000 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_1000 			= Выборка.СтоимостьТоваров;				
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;
				
			ИначеЕсли Выборка.КодСтроки = "903" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров903 	= Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров903 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна 		
					= ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна + Выборка.СтоимостьТоваров;
					
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;
				
			ИначеЕсли Выборка.КодСтроки = "904" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров904 	= Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров904 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна 		
					= ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна + Выборка.СтоимостьТоваров;
					
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;
				
			ИначеЕсли Выборка.КодСтроки = "905" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров905 	= Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров905 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна 		
					= ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна + Выборка.СтоимостьТоваров;
					
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;
				
			ИначеЕсли Выборка.КодСтроки = "906" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров906 	= Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров906 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна 		
					= ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна + Выборка.СтоимостьТоваров;
					
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;
				
			ИначеЕсли Выборка.КодСтроки = "907" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров907 	= Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров907 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна 		
					= ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна + Выборка.СтоимостьТоваров;
					
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;
				
			ИначеЕсли Выборка.КодСтроки = "908" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров908 	= Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров908 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна 		
					= ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна + Выборка.СтоимостьТоваров;
					
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;
					
			ИначеЕсли Выборка.КодСтроки = "909" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров909 	= Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров909 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна 		
					= ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна + Выборка.СтоимостьТоваров;
					
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;
					
			ИначеЕсли Выборка.КодСтроки = "910" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров910 	= Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров910 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна 		
					= ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна + Выборка.СтоимостьТоваров;
					
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;
					
			ИначеЕсли Выборка.КодСтроки = "911" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров911 	= Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров911 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна 		
					= ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна + Выборка.СтоимостьТоваров;
					
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;
					
			ИначеЕсли Выборка.КодСтроки = "912" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров912 	= Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров912 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна 		
					= ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна + Выборка.СтоимостьТоваров;
					
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;
					
			ИначеЕсли Выборка.КодСтроки = "913" Тогда
				ОбластьМакета.Параметры.КоличествоИмпортированныхПодакцизныхТоваров913 	= Выборка.КоличествоТоваров;
				ОбластьМакета.Параметры.СтоимостьИмпортированныхПодакцизныхТоваров913 	= Выборка.СтоимостьТоваров;
				ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна 		
					= ДанныеПечати.КоличествоИмпортированныхПодакцизныхТоваров920_тонна + Выборка.СтоимостьТоваров;
					
				ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 				
					= ДанныеПечати.СтоимостьИмпортированныхПодакцизныхТоваров920 + Выборка.СтоимостьТоваров;		
			КонецЕсли;
		КонецЦикла;	
		
		ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Функция формирует табличный документ с печатной формой
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьПриложение10(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоКосвеннымНалогам.Ссылка КАК Ссылка,
		|	ОтчетПоКосвеннымНалогам.Дата КАК Дата,
		|	ОтчетПоКосвеннымНалогам.Организация КАК Организация,
		|	ОтчетПоКосвеннымНалогам.Приложение10.(
		|		НомерСтроки КАК НомерСтроки,
		|		НаименованиеТовара КАК НаименованиеТовара,
		|		КодТНВЭД КАК КодТНВЭД,
		|		ДатаПринятияТоваровНаУчет КАК ДатаПринятия,
		|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		КоличествоТоваров КАК Количество,
		|		СтоимостьТоваров КАК Стоимость,
		|		СуммаУсловногоНачисленияНДС КАК СуммаНДС
		|	) КАК Приложение10
		|ИЗ
		|	Документ.ОтчетПоКосвеннымНалогам КАК ОтчетПоКосвеннымНалогам
		|ГДЕ
		|	ОтчетПоКосвеннымНалогам.Ссылка В(&СписокДокументов)";		
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоКосвеннымНалогам_Приложение10";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение10");
	ИмяМакета = "Приложение10";
	
	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", 	Шапка.Организация);
		СтруктураПараметров.Вставить("НачалоПериода", 	НачалоМесяца(Шапка.Дата));
		СтруктураПараметров.Вставить("КонецПериода", 	КонецМесяца(Шапка.Дата));

 		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьМакета, ИмяМакета);		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");		
		ОбластьИтоги 	= Макет.ПолучитьОбласть("Итого");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластиПроверки = Новый Массив();
		
		ДанныеПечати = Новый Структура();
		ДанныеПечати.Вставить("КодТНВЭД1", "");
		ДанныеПечати.Вставить("КодТНВЭД2", "");
		ДанныеПечати.Вставить("КодТНВЭД3", "");
		ДанныеПечати.Вставить("КодТНВЭД4", "");
		ДанныеПечати.Вставить("КодТНВЭД5", "");
		ДанныеПечати.Вставить("КодТНВЭД6", "");
		ДанныеПечати.Вставить("КодТНВЭД7", "");
		ДанныеПечати.Вставить("КодТНВЭД8", "");
		ДанныеПечати.Вставить("КодТНВЭД9", "");
		ДанныеПечати.Вставить("КодТНВЭД10", "");
		ДанныеПечати.Вставить("КоличествоИтого", 0);
		ДанныеПечати.Вставить("СтоимостьИтого", 0);
		ДанныеПечати.Вставить("СуммаНДСИтого", 0);
				
		ВыборкаПриложение10 = Шапка.Приложение10.Выбрать();
		КоличествоСтрок = ВыборкаПриложение10.Количество();
		НомерСтроки = 1;
		
		Пока ВыборкаПриложение10.Следующий() Цикл			
			ДанныеПечати.КодТНВЭД1 = Сред(ВыборкаПриложение10.КодТНВЭД, 1, 1);
			ДанныеПечати.КодТНВЭД2 = Сред(ВыборкаПриложение10.КодТНВЭД, 2, 1);
			ДанныеПечати.КодТНВЭД3 = Сред(ВыборкаПриложение10.КодТНВЭД, 3, 1);
			ДанныеПечати.КодТНВЭД4 = Сред(ВыборкаПриложение10.КодТНВЭД, 4, 1);
			ДанныеПечати.КодТНВЭД5 = Сред(ВыборкаПриложение10.КодТНВЭД, 5, 1);
			ДанныеПечати.КодТНВЭД6 = Сред(ВыборкаПриложение10.КодТНВЭД, 6, 1);
			ДанныеПечати.КодТНВЭД7 = Сред(ВыборкаПриложение10.КодТНВЭД, 7, 1);
			ДанныеПечати.КодТНВЭД8 = Сред(ВыборкаПриложение10.КодТНВЭД, 8, 1);
			ДанныеПечати.КодТНВЭД9 = Сред(ВыборкаПриложение10.КодТНВЭД, 9, 1);
			ДанныеПечати.КодТНВЭД10 = Сред(ВыборкаПриложение10.КодТНВЭД, 10, 1);
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаПриложение10);
			ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
			
			ДанныеПечати.КоличествоИтого 	= ДанныеПечати.КоличествоИтого + ВыборкаПриложение10.Количество;
			ДанныеПечати.СтоимостьИтого 	= ДанныеПечати.СтоимостьИтого + ВыборкаПриложение10.Стоимость;
			ДанныеПечати.СуммаНДСИтого 		= ДанныеПечати.СуммаНДСИтого + ВыборкаПриложение10.СуммаНДС;
			
			ОбластиПроверки.Добавить(ОбластьСтрока);
			
			Если КоличествоСтрок = НомерСтроки Тогда
				ОбластьИтоги.Параметры.Заполнить(ДанныеПечати);
				ОбластиПроверки.Добавить(ОбластьИтоги);
			КонецЕсли;	
				
			Если НЕ ТабличныйДокумент.ПроверитьВывод(ОбластиПроверки) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьШапка);	
			КонецЕсли;	
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ОбластиПроверки.Удалить(0);
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;	
		
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.     
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;      
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОсновнаяФорма") Тогда
		 // Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ОсновнаяФорма",  НСтр("ru = 'Основная форма'"), ПечатьОсновнаяФорма(МассивОбъектов, ОбъектыПечати),,
			"Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_ОсновнаяФорма");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение1") Тогда
		 // Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Приложение1",  НСтр("ru = 'Приложение 1'"), ПечатьПриложение1(МассивОбъектов, ОбъектыПечати),,
			"Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение1");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение2") Тогда
		 // Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Приложение2",  НСтр("ru = 'Приложение 2'"), ПечатьПриложение2(МассивОбъектов, ОбъектыПечати),,
			"Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение2");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение3") Тогда
		 // Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Приложение3",  НСтр("ru = 'Приложение 3'"), ПечатьПриложение3(МассивОбъектов, ОбъектыПечати),,
			"Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение3");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение4") Тогда
		 // Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Приложение4",  НСтр("ru = 'Приложение 4'"), ПечатьПриложение4(МассивОбъектов, ОбъектыПечати),,
			"Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение4");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение5") Тогда
		 // Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Приложение5",  НСтр("ru = 'Приложение 5'"), ПечатьПриложение5(МассивОбъектов, ОбъектыПечати),,
			"Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение5");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение6") Тогда
		 // Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Приложение6",  НСтр("ru = 'Приложение 6'"), ПечатьПриложение6(МассивОбъектов, ОбъектыПечати),,
			"Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение6");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение7") Тогда
		 // Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Приложение7",  НСтр("ru = 'Приложение 7'"), ПечатьПриложение7(МассивОбъектов, ОбъектыПечати),,
			"Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение7");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение8") Тогда
		 // Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Приложение8",  НСтр("ru = 'Приложение 8'"), ПечатьПриложение8(МассивОбъектов, ОбъектыПечати),,
			"Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение8");
	КонецЕсли;
			
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение9") Тогда
		 // Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Приложение9",  НСтр("ru = 'Приложение 9'"), ПечатьПриложение9(МассивОбъектов, ОбъектыПечати),,
			"Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение9");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение10") Тогда
		 // Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Приложение10",  НСтр("ru = 'Приложение 10'"), ПечатьПриложение10(МассивОбъектов, ОбъектыПечати),,
			"Документ.ОтчетПоКосвеннымНалогам.ПФ_MXL_Приложение10");
	КонецЕсли;
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОсновнаяФорма";
	КомандаПечати.Представление = НСтр("ru = 'Основная форма'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение1";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 1'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение2";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 2'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 3;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение3";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 3'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 4;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение4";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 4'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 5;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение5";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 5'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 6;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение6";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 6'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 7;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение7";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 7'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 8;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение8";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 8'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 9;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение9";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 9'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение10";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 10'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 11;
		
	Если НЕ Пользователи.ЭтоСеансВнешнегоПользователя() Тогда
		// Настраиваемый комплект документов.
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "ОсновнаяФорма,Приложение1,Приложение2,Приложение3,Приложение4,Приложение5,Приложение6,Приложение7,Приложение8,Приложение9,Приложение10";
		КомандаПечати.Представление = НСтр("ru = 'Комплект'");
		КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Настраиваемый комплект'");
		КомандаПечати.ДополнитьКомплектВнешнимиПечатнымиФормами = Истина;
		КомандаПечати.Порядок = 75;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли