#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "Объект.Дата", "МесяцСтрокой");
	
	УстановитьВидимостьДоступностьЭлементов();
	
	// РаботаСФормами
	РаботаСФормамиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец РаботаСФормами
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаВажныеКоманды;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменений
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменений
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом 
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписиНаСервере.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)	
	
	// РаботаСФормами
	РаботаСФормамиСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец РаботаСФормами
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события ПриИзменении поля ввода Организация.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// Обработка события изменения организации.
	Объект.Номер = "";
	БухгалтерскийУчетВызовСервера.УчетнаяПолитикаСуществует(Объект.Организация, ДатаДокумента, Истина, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьВидимостьДоступностьЭлементов();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)	
	Если Объект.ОсновнаяФорма.Количество() > 0 Тогда 
		ДополнительныеПараметры = Новый Структура();
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросЗаполнитьТабличыеЧасти", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru = 'Табличные части документа будут очищены. Продолжить выполнение операции?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);	
	Иначе
		ЗаполнитьТабличныеЧастиНаСервере();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ОтветНаВопросЗаполнитьТабличыеЧасти(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.ОсновнаяФорма.Очистить();
		Объект.Приложение1.Очистить();
		Объект.Приложение2.Очистить();
		Объект.Приложение3.Очистить();
		Объект.Приложение4.Очистить();
		Объект.Приложение5.Очистить();
		Объект.Приложение9.Очистить();
		
        ЗаполнитьТабличныеЧастиНаСервере();
    КонецЕсли;
КонецПроцедуры // ЗаполнитьПоОснованию()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость и доступность элементов.
//
&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	Элементы.ОсновнаяФормаСуммаИтоги.Видимость 														= Ложь;
	Элементы.Приложение1СуммаИтоги.Видимость 														= Ложь;
	Элементы.Приложение1СуммаНДСИтоги.Видимость 													= Ложь;
	Элементы.Приложение2СтоимостьТовараИтоги.Видимость 												= Ложь;
	Элементы.Приложение2УвеличениеСтоимостиСУчетомМУКЦИтоги.Видимость 								= Ложь;
	Элементы.Приложение2СуммаАкцизногоНалогаИтоги.Видимость 										= Ложь;
	Элементы.Приложение2СуммаНДСИтоги.Видимость 													= Ложь;
	Элементы.Приложение2НачислениеНДССУчетомМУКЦИтоги.Видимость 									= Ложь;
	Элементы.Приложение2СуммаНДСЗачетИтоги.Видимость 												= Ложь;
	Элементы.Приложение3КоличествоИмпортированногоТовараИтоги.Видимость 							= Ложь;
	Элементы.Приложение3РазницаВСтоимостиТовараСУчетомМУКЦИтоги.Видимость 							= Ложь;
	Элементы.Приложение3НачислениеНДССУчетомМУКЦИтоги.Видимость 									= Ложь;
	Элементы.Приложение4СуммаИтоги.Видимость 														= Ложь;
	Элементы.Приложение5ОблагаемыйОбъемИтоги.Видимость 												= Ложь;
	Элементы.Приложение5СуммаАкцизаИтоги.Видимость 													= Ложь;
	Элементы.Приложение6ОблагаемыйОбъемИтоги.Видимость 												= Ложь;
	Элементы.Приложение6СуммаАкцизаИтоги.Видимость 													= Ложь;
	Элементы.Приложение7ОблагаемыйОбъемИтоги.Видимость 												= Ложь;
	Элементы.Приложение7СуммаАкцизаИтоги.Видимость 													= Ложь;
	Элементы.Приложение8КоличествоДавальческогоСырьяВвезенногоВОтчетныйПериодИтоги.Видимость 		= Ложь;
	Элементы.Приложение8КоличествоДавальческогоСырьяПереработанногоВОтчетномПериодеИтоги.Видимость 	= Ложь;
	Элементы.Приложение8ОстатокДавальческогоСырьяИтоги.Видимость 									= Ложь;
	Элементы.Приложение8КоличествоТовараПодлежащегоЭкспортуИтоги.Видимость 							= Ложь;
	Элементы.Приложение8ПодлежитВнесениюИтоги.Видимость 											= Ложь;
	Элементы.Приложение8ФактическиВнесенноИтоги.Видимость 											= Ложь;
	Элементы.Приложение8СуммаДепозитаНеПодтвержденнаяДокументальноИтоги.Видимость 					= Ложь;
	Элементы.Приложение8СуммаДепозитаПодлежащаяВозвратуИтоги.Видимость 								= Ложь;
	Элементы.Приложение9КоличествоИмпортированныхПодакцизныхТоваровИтоги.Видимость 					= Ложь;
	Элементы.Приложение9СтоимостьИмпортированныхПодакцизныхТоваровИтоги.Видимость 					= Ложь;
	Элементы.Приложение10КоличествоТоваровИтги.Видимость 											= Ложь;
	Элементы.Приложение10СтоимостьТоваровИтоги.Видимость 											= Ложь;
	Элементы.Приложение10СуммаУсловногоНачисленияНДСИтоги.Видимость 								= Ложь;
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОсновнаяФорма Тогда
		Элементы.ОсновнаяФормаСуммаИтоги.Видимость 														= Истина;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПриложение1 Тогда	
		Элементы.Приложение1СуммаИтоги.Видимость 														= Истина;
		Элементы.Приложение1СуммаНДСИтоги.Видимость 													= Истина;	
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПриложение2 Тогда
		Элементы.Приложение2УвеличениеСтоимостиСУчетомМУКЦИтоги.Видимость 								= Истина;
		Элементы.Приложение2СуммаАкцизногоНалогаИтоги.Видимость 										= Истина;
		Элементы.Приложение2СуммаНДСИтоги.Видимость 													= Истина;
		Элементы.Приложение2НачислениеНДССУчетомМУКЦИтоги.Видимость 									= Истина;
		Элементы.Приложение2СуммаНДСЗачетИтоги.Видимость 												= Истина;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПриложение3 Тогда	
		Элементы.Приложение3КоличествоИмпортированногоТовараИтоги.Видимость 							= Истина;
		Элементы.Приложение3РазницаВСтоимостиТовараСУчетомМУКЦИтоги.Видимость 							= Истина;
		Элементы.Приложение3НачислениеНДССУчетомМУКЦИтоги.Видимость 									= Истина;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПриложение4 Тогда
		Элементы.Приложение4СуммаИтоги.Видимость 														= Истина;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПриложение5 Тогда
		Элементы.Приложение5ОблагаемыйОбъемИтоги.Видимость 												= Истина;
		Элементы.Приложение5СуммаАкцизаИтоги.Видимость 													= Истина;	
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПриложение6 Тогда
		Элементы.Приложение6ОблагаемыйОбъемИтоги.Видимость 												= Истина;
		Элементы.Приложение6СуммаАкцизаИтоги.Видимость 													= Истина;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПриложение7 Тогда
		Элементы.Приложение7ОблагаемыйОбъемИтоги.Видимость 												= Истина;
		Элементы.Приложение7СуммаАкцизаИтоги.Видимость 													= Истина;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПриложение8 Тогда
		Элементы.Приложение8КоличествоДавальческогоСырьяВвезенногоВОтчетныйПериодИтоги.Видимость 		= Истина;
		Элементы.Приложение8КоличествоДавальческогоСырьяПереработанногоВОтчетномПериодеИтоги.Видимость 	= Истина;
		Элементы.Приложение8ОстатокДавальческогоСырьяИтоги.Видимость 									= Истина;
		Элементы.Приложение8КоличествоТовараПодлежащегоЭкспортуИтоги.Видимость 							= Истина;
		Элементы.Приложение8ПодлежитВнесениюИтоги.Видимость 											= Истина;
		Элементы.Приложение8ФактическиВнесенноИтоги.Видимость 											= Истина;
		Элементы.Приложение8СуммаДепозитаНеПодтвержденнаяДокументальноИтоги.Видимость 					= Истина;
		Элементы.Приложение8СуммаДепозитаПодлежащаяВозвратуИтоги.Видимость 								= Истина;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПриложение9 Тогда
		Элементы.Приложение9КоличествоИмпортированныхПодакцизныхТоваровИтоги.Видимость 					= Истина;
		Элементы.Приложение9СтоимостьИмпортированныхПодакцизныхТоваровИтоги.Видимость 					= Истина;
	
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПриложение10 Тогда	
		Элементы.Приложение10КоличествоТоваровИтги.Видимость 											= Истина;
		Элементы.Приложение10СтоимостьТоваровИтоги.Видимость 											= Истина;
		Элементы.Приложение10СуммаУсловногоНачисленияНДСИтоги.Видимость 								= Истина;
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТабличныеЧастиНаСервере()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьДокумент();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
	Модифицированность = Истина;
КонецПроцедуры // ЗаполнитьТабличныеЧастиНаСервере(ИмяКоманды)

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
     ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
     ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
 
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
     ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
     ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область РедактированиеМесяцаСтрокой

&НаКлиенте
Процедура ПериодОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "Объект.Дата", "МесяцСтрокой");
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ПериодОтчета.
//
&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "Объект.Дата", "МесяцСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "Объект.Дата", "МесяцСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтчетаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
