
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ВидДокумента = "ППИ" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийППИ"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
	ИначеЕсли Объект.ВидДокумента = "РКО" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийРКО"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
	ИначеЕсли Объект.ВидДокумента = "ППВ" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийППВ"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
	Иначе
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийПКО"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);	
	КонецЕсли;	
	
	Элементы.ВидОперации.ОграничениеТипа = ОписаниеТипов;	
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	Объект.ВидОперации = Неопределено;
	
	Если Объект.ВидДокумента = "ППИ" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийППИ"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
	ИначеЕсли Объект.ВидДокумента = "РКО" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийРКО"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
	ИначеЕсли Объект.ВидДокумента = "ППВ" Тогда
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийППВ"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);
		
	Иначе
		Массив = Новый Массив();
		Массив.Добавить(Тип("ПеречислениеСсылка.ВидыОперацийПКО"));
		ОписаниеТипов = Новый ОписаниеТипов(Массив);	
	КонецЕсли;	
	
	Элементы.ВидОперации.ОграничениеТипа = ОписаниеТипов;
	
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
		
	Элементы.КодПлатежа.Видимость 			= Объект.ВидДокумента = "ППИ";
	Элементы.НазначениеПлатежа.Видимость 	= Объект.ВидДокумента = "ППИ";
	
КонецПроцедуры 

#КонецОбласти
