
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидДокумента") Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидДокумента");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = Параметры.ВидДокумента;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	
	ВыбранныйЭлемент = Элементы.Список.ТекущиеДанные;
	
	Если ВыбранныйЭлемент <> Неопределено Тогда	
		СтруктураДанных = Новый Структура();
		СтруктураДанных.Вставить("Операции", 						Истина);	
		СтруктураДанных.Вставить("КорСчет", 						ВыбранныйЭлемент.КорСчет);
		СтруктураДанных.Вставить("ВидОперации", 					ВыбранныйЭлемент.ВидОперации);
		СтруктураДанных.Вставить("СтатьяДвиженияДенежныхСредств", 	ВыбранныйЭлемент.СтатьяДвиженияДенежныхСредств);
		СтруктураДанных.Вставить("КодПлатежа", 						ВыбранныйЭлемент.КодПлатежа);
		СтруктураДанных.Вставить("НазначениеПлатежа", 				ВыбранныйЭлемент.НазначениеПлатежа);
		
		Если ВыбранныйЭлемент.ВидДокумента = "РКО" Тогда
			ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаДокумента", СтруктураДанных);
			
		ИначеЕсли ВыбранныйЭлемент.ВидДокумента = "ППИ" Тогда
			ОткрытьФорму("Документ.ПлатежноеПоручениеИсходящее.Форма.ФормаДокумента", СтруктураДанных);
			
		ИначеЕсли ВыбранныйЭлемент.ВидДокумента = "ППВ" Тогда
			ОткрытьФорму("Документ.ПлатежноеПоручениеВходящее.Форма.ФормаДокумента", СтруктураДанных);
			
		ИначеЕсли ВыбранныйЭлемент.ВидДокумента = "ПКО" Тогда
			ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.Форма.ФормаДокумента", СтруктураДанных);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти