#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	 Для Каждого Запись из ЭтотОбъект Цикл
		 
		 Если Запись.СтавкаНаличная <> Запись.СтавкаБезналичная 
		 	И ПроверяемыйВидДеятельности(Запись.ВидДеятельности) Тогда  
		 	
		 	ТекстСообщения = НСтр("ru = 'Ставки для данного вида деятельности должны быть равны.'");
		 	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "СтавкаНаличная",, Отказ);
		 	
		 КонецЕсли;
		 
	 КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверяемыйВидДеятельности(ВидДеятельности)
	
	Если ВидДеятельности = Перечисления.ВидыДеятельностиЕН.РежимУсловногоНачисленияНДС
		Или ВидДеятельности = Перечисления.ВидыДеятельностиЕН.ШвейноеТекстильноеПроизводство 
		Или ВидДеятельности = Перечисления.ВидыДеятельностиЕН.Услуги 
		Или ВидДеятельности = Перечисления.ВидыДеятельностиЕН.УслугиСаун 
		Или ВидДеятельности = Перечисления.ВидыДеятельностиЕН.УслугиБильярда 
		Или ВидДеятельности = Перечисления.ВидыДеятельностиЕН.УслугиБань  Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли