
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков;
	Драйвер.ИмяДрайвера  = "Драйвер1СПринтерЧеков";
	Драйвер.Наименование = НСтр("ru = '1С:Принтер чеков'");
	Драйвер.ИдентификаторОбъекта = "ReceiptPrinterNative"; 
	Драйвер.ВерсияДрайвера = "3.1.4.6"; 
	
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	Драйвер.ИмяДрайвера  = "ДрайверКатоОнлайнКасса";
	Драйвер.Наименование = "Като:1С онлайн касса";
	Драйвер.ИдентификаторОбъекта = "ОнлайнКасса";
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ПодключениеНеТребуется;
	Драйвер.ВерсияДрайвера = "1.0.0.1";
	
КонецПроцедуры

#КонецОбласти
