#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьОснованиеУвольненияПоУмолчанию(Пользователь = Неопределено) Экспорт
	
	ЗначениеПоУмолчанию = Справочники.ОснованияУвольненияИзОрганизации.ПустаяСсылка();
	
	ОсновноеОснованиеУвольнения = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОсновноеОснованиеУвольнения", "ЗначениеПоУмолчанию",, Пользователь);
	
	Если ТипЗнч(ОсновноеОснованиеУвольнения) = ТипЗнч(ЗначениеПоУмолчанию) Тогда
		Если ОбщегоНазначения.СсылкаСуществует(ОсновноеОснованиеУвольнения) Тогда
			ЗначениеПоУмолчанию = ОсновноеОснованиеУвольнения;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;

КонецФункции

#КонецОбласти
	
#КонецЕсли

