
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт
	СправочникМенеджер = Справочники.ГруппыИмущества;
	
	КлассификаторXML = РегистрыСведений.СтавкиНалогаНаИмущество.ПолучитьМакет("МакетЗаполнения").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	НаборЗаписей = РегистрыСведений.СтавкиНалогаНаИмущество.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();                 
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		Период = Дата(СокрЛП(СтрокаТаблицыЗначений.Период));
		Ставка   = Число(СокрЛП(СтрокаТаблицыЗначений.Ставка));
		ГруппаНалогаНаИмущество = СправочникМенеджер.НайтиПоКоду(СокрЛП(СтрокаТаблицыЗначений.Код));
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ГруппаНалогаНаИмущество = ГруппаНалогаНаИмущество;
		НоваяЗапись.Период = Период;
		НоваяЗапись.Ставка   = Ставка;
	КонецЦикла;
	
	Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	Исключение
	КонецПопытки;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#КонецЕсли